{
  "Cloud Infrastructure and Platform Services": "Google Cloud Services",
  "Reviews": [
    {
      "Index": 0,
      "Date": "December 26, 2021",
      "User link": null,
      "User name": "Verified User",
      "User job": "Contributor in Research & Development",
      "User company": "Computer Software Company, 1-10 employees",
      "Overview": "Google Cloud Storage Review",
      "Score": "9/10",
      "Detail": "Google Cloud Storage is easy and flexible to use, multi-purpose and secure. Can also send files to others fast and securely. This software has a reasonable price point compared to other companies. It allows you to store your data and retrieve it anytime as desired from any location at any time. Prefer google cloud over google drive, it has better features."
    },
    {
      "Index": 1,
      "Date": "November 18, 2021",
      "User link": "/users/6144e73b4614ec001d6afe23",
      "User name": "Dhiman Roy",
      "User job": "Officer",
      "User company": "Sonali Bank Limited (Banking, 10,001+ employees)",
      "Overview": "Superb software in the digital era",
      "Score": "9/10",
      "Detail": "In the recent era, we have to generate huge amounts of data for organizations. So we have to store it in a secure way. Here cloud storage is the perfect platform to perform it. We can easily access the data which are secured in this software. In my organization, we can easily store our data in this software and perfectly use the data in the future."
    },
    {
      "Index": 2,
      "Date": "July 22, 2021",
      "User link": null,
      "User name": "Verified User",
      "User job": "Analyst in Other",
      "User company": "Hospitality Company, 10,001+ employees",
      "Overview": "Google Cloud Storage Review",
      "Score": "8/10",
      "Detail": "Google Cloud Storage is being used across multiple departments of our organization for storing, managing, and sharing documents, reports, and files. It helps reduce the number of emails, especially attachments to be sent over email, also helps keep everything organized. We give access to team members appropriately and manage the visibility of certain files between departments and teams."
    },
    {
      "Index": 3,
      "Date": "July 09, 2021",
      "User link": null,
      "User name": "Verified User",
      "User job": "Manager in Research & Development",
      "User company": "Market Research Company, 11-50 employees",
      "Overview": "Best Cloud Storage for Video Files",
      "Score": "10/10",
      "Detail": "We use [Google Cloud Storage] to store large video recordings of gameplay from user research participants, and it works great! Can play the files straight from the cloud without having to download them. Of course, it also works great for smaller files like documents and presentations."
    },
    {
      "Index": 4,
      "Date": "June 02, 2021",
      "User link": null,
      "User name": "Verified User",
      "User job": "Manager in Other",
      "User company": "Construction Company, 1001-5000 employees",
      "Overview": "Google Cloud Storage - great for R&D file sharing.",
      "Score": "9/10",
      "Detail": "We have utilized Google Cloud Storage as a method for file transfers and file sharing amongst our R&D group. It's useful for sharing across organizations, for internal and external storage."
    },
    {
      "Index": 5,
      "Date": "March 23, 2020",
      "User link": null,
      "User name": "Verified User",
      "User job": "Manager in Information Technology",
      "User company": "Restaurants Company, 501-1000 employees",
      "Overview": "Google Cloud Storage - Good for projects from simple to demanding!",
      "Score": "9/10",
      "Detail": "We use Google Cloud Storage to backup individual files, backup entire systems, share files, and to host static content. Since a storage bucket can be configured to a URL, this tool allows us to easily and temporarily host files needed between systems. Some of our storage buckets are used to host software updates, others are used only as background system backups, among many other uses."
    },
    {
      "Index": 6,
      "Date": "March 11, 2020",
      "User link": "/users/59ba8f8389347b00107e3b37",
      "User name": "Matthew Bernstein",
      "User job": "Account Executive",
      "User company": "Intersection Co. (Marketing and Advertising, 501-1000 employees)",
      "Overview": "Google Cloud Storage is Great!",
      "Score": "7/10",
      "Detail": "Google Cloud Storage is a great cloud infrastructure as a solution product, and deserves to be held up to the tops of the industry. The cost is rather reasonable for the amount of licenses it allows, and is used across all functions of my organization. Highly recommend this product."
    },
    {
      "Index": 7,
      "Date": "March 04, 2020",
      "User link": null,
      "User name": "Verified User",
      "User job": "C-Level Executive in Information Technology",
      "User company": "Computer Software Company, 11-50 employees",
      "Overview": "Good Storage Solution",
      "Score": "9/10",
      "Detail": "Google Cloud Storage is used across our organization in support of our product line as well as our customer success team. It allows us to store data files, images, and other resources required by our product lines inexpensively and securely. We can control access to all resources without being cumbersome and data retrieval is quick and easy."
    },
    {
      "Index": 8,
      "Date": "March 02, 2020",
      "User link": "/users/5d5d6cace1029a001a15c5fd",
      "User name": "Cameron Gable",
      "User job": "Software Engineer",
      "User company": "Serimmune Inc. (Biotechnology, 11-50 employees)",
      "Overview": "Google Cloud Storage is a Highly Available and Integrated Object Storage",
      "Score": "8/10",
      "Detail": "Our software platform is a distributed system; we run many batch jobs of varying workload types and sizes. We use GCS to store data from these VMs. GCS is able to solve the issue of needing a highly available storage option that one can store data on easily using various APIs. Our company also uses it as backup storage for our Google-managed file server."
    },
    {
      "Index": 9,
      "Date": "February 29, 2020",
      "User link": null,
      "User name": "Verified User",
      "User job": "Director in Product Management",
      "User company": "Computer Software Company, 11-50 employees",
      "Overview": "Google Cloud Storage compared to AWS",
      "Score": "8/10",
      "Detail": "Google Cloud Storage is currently used by IT, QA, and Accounting. For IT, it is used to manage and verify backups for the business. The Quality Assurance team uses Google Cloud Storage to store and automate code regression and edge case testing. The Accounting department uses the service to store and maintain historical employee records."
    },
    {
      "Index": 10,
      "Date": "February 26, 2020",
      "User link": "/users/5a3bd57a6dc50600121ef943",
      "User name": "Randi Yeaman",
      "User job": "Inside Sales",
      "User company": "Prime Solution Inc. (Machinery, 11-50 employees)",
      "Overview": "Cloud for Emails",
      "Score": "10/10",
      "Detail": "Individuals use the Cloud Storage for emails that we need to hold onto due to the length of our projects. I have to hold onto every email that comes in to Prime Solution and the only way I was able to accomplish this task was to use the Google Cloud Storage for these emails. This has helped us increase our email and storage capacity in order to best help our customers and their projects we are working with them on."
    },
    {
      "Index": 11,
      "Date": "January 30, 2020",
      "User link": null,
      "User name": "Verified User",
      "User job": "Engineer in Information Technology",
      "User company": "Marketing and Advertising Company, 201-500 employees",
      "Overview": "Google Cloud Storage : Enterprise level solution with a good price",
      "Score": "10/10",
      "Detail": "We use the Google Cloud Storage in the most diverse technology projects, software development and also in data analysis projects. It is one of the many solutions that Google Cloud Platform offers and is used by the technology and data science department. The GCS helps us deliver high quality solutions when there is a requirement for data storage in the cloud."
    },
    {
      "Index": 12,
      "Date": "January 24, 2020",
      "User link": "/users/5d85612a5731da002b76c6a6",
      "User name": "Eric Mason",
      "User job": "Lead Developer",
      "User company": "SaaSquatch (Marketing and Advertising, 11-50 employees)",
      "Overview": "Google Cloud Storage, Cheap, Secure and Reliable",
      "Score": "8/10",
      "Detail": "We primarily use Google Cloud Storage when we need to store data with a low access frequency cheaply. In the past, we've used it to assist with data migrations and for secure data exchanges. It's mostly used by the product/development team and infrequently used by other teams. The primary business problems it addresses relate to keeping \"colder\" data storage cheap and secure."
    },
    {
      "Index": 13,
      "Date": "January 06, 2020",
      "User link": "/users/5c799ad02e141d00b7cc6e49",
      "User name": "Christian Oquendo",
      "User job": "Personal Trainer",
      "User company": "Adrenalous Fitness (Health, Wellness and Fitness, 1-10 employees)",
      "Overview": "Google Cloud Storage - Best for Business",
      "Score": "9/10",
      "Detail": "At the moment, my company is using Google Cloud Storage for collaboration purposes with other companies. The convenience of cloud storage is useful for situations when there is no physical storage space available, as my company uses a lot of video content. This software also addresses many organizational issues with documents we share."
    },
    {
      "Index": 14,
      "Date": "December 04, 2019",
      "User link": null,
      "User name": "Verified User",
      "User job": "Team Lead in Engineering",
      "User company": "Consumer Goods Company, 1-10 employees",
      "Overview": "Overall great product",
      "Score": "8/10",
      "Detail": "It’s is currently being used across our entire organization. We are using the Cloud Storage for product images. We are especially using it for also storing profile images."
    },
    {
      "Index": 15,
      "Date": "November 19, 2019",
      "User link": "/users/5c4763c92869c10101320dba",
      "User name": "Leonel Quinteros",
      "User job": "Director of Technology",
      "User company": "Global Brigades, Inc. (Non-Profit Organization Management, 11-50 employees)",
      "Overview": "Store and host anything, worry-free, on Google Cloud Storage",
      "Score": "10/10",
      "Detail": "The first adoption was to store media files (videos) that needed to be accessible publicly. Then we extended the use to store all files generated by our systems. It releases us from having to allocate disk space on our infrastructure to store growing assets. By just uploading to cloud ctorage we can focus on business cases and don't have to monitor space available over time."
    },
    {
      "Index": 16,
      "Date": "September 02, 2019",
      "User link": "/users/5bc64d77d80ce00016da478e",
      "User name": "JaCoby Marston, CPA",
      "User job": "Chief Financial Officer",
      "User company": "Shopper Approved (Computer Software, 11-50 employees)",
      "Overview": "Peace of Mind!",
      "Score": "9/10",
      "Detail": "We have been using Google Cloud Storage for multiple years now. We as a company will do anything we can to verify that our data is safely stored. We love using cloud storage because it gives my business peace of mind that if a computer was to crash, all is not lost. We have a back up located on Google Cloud Storage. We use Google Cloud Storage to back up our serve data. I personally love using Google Cloud Storage because I use multiple Google products and I love having all of the my stuff in one central location with one company."
    },
    {
      "Index": 17,
      "Date": "August 29, 2019",
      "User link": null,
      "User name": "Verified User",
      "User job": "Manager in Sales",
      "User company": "Marketing and Advertising Company, 11-50 employees",
      "Overview": "Google Cloud Storage is the way to go!",
      "Score": "10/10",
      "Detail": "We use Google Cloud Storage basically in our whole organization. The most common problem it addresses for us is that a group of us can work on a document/project remotely, so that we don't end up with this huge email string of forwarding and replying to documents. A group of us can make the changes no matter where we are."
    },
    {
      "Index": 18,
      "Date": "July 23, 2019",
      "User link": "/users/5b9665c0a3df4300124ce93b",
      "User name": "Sam Randika",
      "User job": "Software Engineer Internship",
      "User company": "Virtusa (Computer Software, 1001-5000 employees)",
      "Overview": "Google Cloud Storage Review",
      "Score": "9/10",
      "Detail": "The Google Cloud software platform came up with more than one concept. not only background APIs that operate at code and scripting level of shell and IDEs but also can manage common computer tasks, service, object, the client from virtual disks and machines.its gives everyone a free account that comes with 15GB free storage. When comparing with other competitors that's a huge step. Since it connects with every Google product we can easily share data among them."
    },
    {
      "Index": 19,
      "Date": "April 19, 2019",
      "User link": null,
      "User name": "Verified User",
      "User job": "Manager in Information Technology",
      "User company": "Higher Education Company, 51-200 employees",
      "Overview": "Great Storage Alternative to AWS",
      "Score": "8/10",
      "Detail": "We currently use Google Cloud Storage on the I.T. operations side. Our end users all use Google Drive as their primary storage. On the operations side, we use it for the long-term storage of critical information. We also keep data in Google Cloud Storage long-term for servers (physical, virtual, cloud) that have been retired. Archiving data in Google Cloud Storage allows us to eliminate physical media."
    },
    {
      "Index": 20,
      "Date": "February 26, 2019",
      "User link": "/users/5bfec57a2029a30022f52055",
      "User name": "Alejandro Matheu, MD, MBA, MSc in Digital Marketing",
      "User job": "Digital Marketing Manager",
      "User company": "Paradise Professional Delelopment School (Hospital & Health Care, 501-1000 employees)",
      "Overview": "Google Cloud Storage is a good and cheaper alternative to Amazon S3.",
      "Score": "8/10",
      "Detail": "We use this service for Cloud Storage (obviously). We use two cloud storage services, in case one of these fails or goes down for any reason. This service is used by the IT area mainly. We started using Google Cloud Storage as a trial and kept using it for a couple of months just for testing, but the pricing was better than the competition, that's why we finally decided to use both."
    },
    {
      "Index": 21,
      "Date": "February 26, 2019",
      "User link": "/users/59e8cf579ad0af0010e7e44f",
      "User name": "Spencer Baselice",
      "User job": "SEO Manager",
      "User company": "MilliporeSigma (Pharmaceuticals, 10,001+ employees)",
      "Overview": "Google Cloud Storage Exports BigQuery Data Reliably",
      "Score": "9/10",
      "Detail": "Cloud Storage is used to store files exported from Big Query. When larger data sets are pulled, the tables can be exported into the cloud storage. It is also used for other purposes but my main use is exportation from Big Query. This is needed whenever you have to query data sets containing more than 10,000 rows."
    },
    {
      "Index": 22,
      "Date": "February 26, 2019",
      "User link": null,
      "User name": "Verified User",
      "User job": "Employee in Customer Service",
      "User company": "Computer Software Company, 51-200 employees",
      "Overview": "Love it!",
      "Score": "10/10",
      "Detail": "We use Google Cloud Storage to house the various documents that our team needs to collaborate on before they are published. This could be anything from \"how to\" guides to Excel spreadsheets."
    },
    {
      "Index": 23,
      "Date": "February 25, 2019",
      "User link": "/users/5a71f5aa0c9c100017237750",
      "User name": "Michael Timms",
      "User job": "Network Administrator II",
      "User company": "iQor (Telecommunications, 10,001+ employees)",
      "Overview": "File Sharing and Storing on any device",
      "Score": "9/10",
      "Detail": "I use Google Cloud Storage for several different tasks. For me, it is perfect when I have files that I need to save for an indefinite period of time because I have a habit of sticking them on my Google drive and forgetting about them, then when I need them 6 months later they are there. I also use it for file sharing when I need to quickly get a big file to someone else."
    },
    {
      "Index": 24,
      "Date": "February 25, 2019",
      "User link": "/users/595970e735129e000fd6bdaf",
      "User name": "Claudio Hoffer",
      "User job": "Business Development",
      "User company": "BRADLEY, DENKOVICH & KARAYIANNIS, P.C. (Law Practice, 51-200 employees)",
      "Overview": "Google Cloud Storage: an ideal, reliable and easy to use storage solution that doesn't break the bank and take your business to the highest tech standards!",
      "Score": "10/10",
      "Detail": "We used to have file servers storing our customer's cases, forms, and documents. Accessing these documents remotely was not simple nor easy for members without extensive training and specific hardware. We replaced our main file server for personal data and legal documents for Google Cloud Storage—this gave us easy access to those files from any device, anywhere."
    },
    {
      "Index": 0,
      "Date": "February 23, 2019",
      "User link": null,
      "User name": "Verified User",
      "User job": "Director in Engineering",
      "User company": "Computer Software Company, 51-200 employees",
      "Overview": "Google Cloud Storage Review",
      "Score": "7/10",
      "Detail": "We use Google Cloud Storage for managing static assets across numerous projects and initiatives within the organization. We tend to use Google Cloud Storage as our base storage layer when working with other products in the Google Cloud family, like App Engine. Our use of Google's Cloud Storage product mimics how we use other cloud storage products, likeAmazon S3."
    },
    {
      "Index": 1,
      "Date": "February 22, 2019",
      "User link": "/users/5bfeade245ec740036a93b62",
      "User name": "Thomas Young",
      "User job": "Owner, previous CEO",
      "User company": "Econometric Studios (Financial Services, 11-50 employees)",
      "Overview": "Google Cloud Storage is a functional option for storage, accessing data and managing a unified API",
      "Score": "9/10",
      "Detail": "Google Cloud Storage is used across the organization for sharing of documents, gathering data, accessing data, and deploying APIs. As mentioned, the software is used across the organization to enable secure storage, while also enabling simultaneous access to all the company's data sets."
    },
    {
      "Index": 2,
      "Date": "February 21, 2019",
      "User link": "/users/58c84001433e19000f11f570",
      "User name": "Anatoly Geyfman",
      "User job": "Founder & CEO",
      "User company": "Carevoyance (Health, Wellness and Fitness, 1-10 employees)",
      "Overview": "Google Cloud Storage is an indispensable part of  a big data infrastructure",
      "Score": "10/10",
      "Detail": "We use Google Cloud Storage (GCS) for a variety of needs. My company manages terabytes of healthcare claims data, which we analyze and present to our customers in an easy-to-use application, mobile app, and reports. We use GCS to stage raw claims data for injection, to stage post-processed data for indexing, and for intermediary storage for a variety of analytics tools."
    },
    {
      "Index": 3,
      "Date": "May 01, 2017",
      "User link": "/users/57bcc91b3dddd2350053a0d5",
      "User name": "Eduardo Reyes",
      "User job": "Network Operation",
      "User company": "Alcance Media Group (Marketing and Advertising, 11-50 employees)",
      "Overview": "Quick and inexpensive but for simple projects",
      "Score": "8/10",
      "Detail": "Google Cloud Storage (GCS) is very easy to use, it's very intuitive. Works pretty well to keep an important amount of files, if you won't need [them] too often. If you need them frequently, probably you will need extra tools to manage (like FTP tools) them. In this point, GCS is not that good because the connection is not that easy to establish. I did it but It's cost me days of works to find out how to connect GCS and the FTP app. Additionally, when you use GCS with instances, well, it's a little complicated."
    },
    {
      "Index": 4,
      "Date": "March 29, 2017",
      "User link": "/users/58da95de5ba1f6000fa757be",
      "User name": "Jonah Dempcy",
      "User job": "Web & Mobile Developer",
      "User company": "Bluefire Productions (Computer Software, 11-50 employees)",
      "Overview": "Making Digital Distribution Easy",
      "Score": "9/10",
      "Detail": "Google Cloud Storage allows us the flexibility we need to deliver digital assets to end-users in a sophisticated e-book distribution platform. It has the access control we require for ensuring that our assets are accessible to the right people at the right time. The world of digital publishing requires fine-grained control of access to web content and Google Cloud Storage provides us with exactly that."
    },
    {
      "Index": 5,
      "Date": "March 27, 2017",
      "User link": "/users/5806787ff5487b000f52f52f",
      "User name": "Mary Chandler",
      "User job": "Internal Recruiter",
      "User company": "Digital First Media (Publishing, 10,001+ employees)",
      "Overview": "Great enterprise-level storage product!",
      "Score": "10/10",
      "Detail": "I use Google Cloud Storage on a daily basis in order to organize various documents that I view daily as a Recruiter (resumes, job descriptions, various hiring paperwork, etc). In addition, Google Cloud Storage is used across our organization in order to make document sharing easier for all groups that work cross functionally."
    },
    {
      "Index": 6,
      "Date": "March 24, 2017",
      "User link": "/users/574f09eb412ef50c00c7fe2b",
      "User name": "venkat nitin panaganti",
      "User job": "Student",
      "User company": "RIT (Computer Software, 501-1000 employees)",
      "Overview": "A highlevel insight on the Google Cloud Storage.",
      "Score": "10/10",
      "Detail": "I have used google cloud storage to (along with a few other teammates) to store research data. A cloud platform is more of an obvious choice when the data is huge and needs to be accessed by multiple people and hence we decided to use the google cloud storage. Like any cloud storage service, the reason for usage is to store data in a secure, convenient location which can be accessed by all the required personal. To make it more convenient for users, Google allows you to use an existing Google account."
    },
    {
      "Index": 7,
      "Date": "March 21, 2017",
      "User link": "/users/58b10f8234df75009bca9650",
      "User name": "Tip Iuliucci",
      "User job": "Realtor",
      "User company": "Northside Realty Inc (Real Estate, 51-200 employees)",
      "Overview": "Google scores in the cloud!",
      "Score": "9/10",
      "Detail": "I use Google Cloud Storage in conjunction with a couple of partners in a real estate investment project. We use it to save receipts and important documents for safekeeping and easy retrieval. The main partner set it up and finds it useful for the tax preparations. We've had to fetch documents on the go many times and it was easy!"
    },
    {
      "Index": 8,
      "Date": "March 17, 2017",
      "User link": null,
      "User name": "Verified User",
      "User job": "Administrator in Finance and Accounting",
      "User company": "Investment Management Company, 11-50 employees",
      "Overview": "Global hedge fund employee's review of Google Cloud Storage",
      "Score": "10/10",
      "Detail": "Our company extensively uses google cloud storage for day to day work via Google Drive. We have 45 employees globally who can work seamlessly over the Google cloud with co-workers in Hong Kong, the UK, NY and New Orleans."
    },
    {
      "Index": 9,
      "Date": "April 13, 2016",
      "User link": "/users/55f8b929486a2b1900e068b3",
      "User name": "Jessica Groff",
      "User job": "Teacher",
      "User company": "New Milford Public Schools (Education Management, 201-500 employees)",
      "Overview": "Easy Storage in the Cloud",
      "Score": "9/10",
      "Detail": "Google Cloud Storage is being used across our school district. It allows staff and administration to access files from any device anywhere."
    }
  ]
}