{"name":"Alibaba Cloud - International","oneline":"It is necessary to have software that provides us with security, Alibaba Cloud is ideal for that, it gives us the confidence we need from the private cloud.   It allows us to mitigate possible attacks to guarantee the company the security it needs.   We can.  We use Alibaba Cloud to introduce our product in China.   Since our default cloud provider is not there, we decided to go with Alibaba.   It has almost similar features as other cloud providers, so getting used to it wasn't that hard.  Alibaba Cloud has been evolving rapidly which competitive with Amazon Web Services.   it also provides many advanced security features to protect the instances and data stored in the cloud.   Storage services in Alibaba Cloud is very reliable as.  Alibaba cloud seems to be provide plethora of products and infrastructure solutions in the market.   It's a hybrid of clouds that we use in our organization with Alibaba limited to specific region, although it suffices all our need infrastructure needs.  Alibaba Cloud now is very mature in the market whereby most of the third-party solutions are supported.   Due to its scalability, Alibaba Cloud has become very competitive compared to AWS, GCP and Microsoft Azure.   The built-in modules in.  Alibaba Cloud is one of the market leaders in the field of cloud infrastructure/computing.   It is leading in many geographies, main being China and the Asia Pacific APAC region.   The Alibaba Cloud offers many cost efficient plans to cater.  Alibaba Cloud is one of leading public cloud services in the market due to its scalability.   Many of the products or solutions are now supporting for Alibaba Cloud platform.   Instances can be managed easily and able to monitor in real-time.  Alibaba Cloud is one of the market leaders in China and the Asia Pacific region and offers great scalability and flexibility.   It is cost-efficient and provides a max number of cores to users increasing the speed and efficiency of the cloud platform present.  Alibaba Cloud Is Delivering You Hardware-less On Your Network.  The provider meets the initial requirements for the deployment of a reliable cloud service with internationally certified and endorsed security levels, scalable software and efficient integration into the enterprise environment for a hybrid cloud.  The overall experience when using the product is that it meets successfully and addresses challenges in within cloud security.  We've had a positive experience with it to date, reliable service and helpful support.   Internal stakeholders have been happy with the product, and we look forward to evolving this technology stack in future improvements.  Good UI for Alibaba cloud.   It has a path that they still need to walk but overall they are doing great.   It is very secure and overall easy to use.   keep it up Alibaba!.  Alibaba Cloud international version has been gaining foothold very fast, especially in Asia.   The platform has been reliable in general and also offers features that fit the local needs better.   In addition, Alibaba Cloud provide powerful SaaS tools from the.  Reliable cloud solution for general web app service and virtual private cloud networks.   With its versatile functionalities available, it becomes relatively easier as one traverses through the enterprise network capabilities.  This one offers a wide range of latest cutting edge technology in the field & its cot effective policies are really a good support to a mid scale companies.  Alibaba is a great Cloud framework for starters.   It seems to be a Google Cloud like option and it's getting mature everyday.   The support team does it job very well offering any assistance you may need.  My experience been excellent with Alibaba Cloud team, they give training as well so that your technology team knows what to do and how to manage the whole infrastructure.  Overall a pleasant experience of  moving to private cloud through the Cloud Business Enabler Suite Solution to Enable the IT department be hassle free and Infra independent.  Everything what you could have from AWS can be found from Alibaba Cloud (Aliyun/Ali Cloud), it is definitely alternative solution to AWS and/or Google Cloud; and services at Alibaba Cloud are quite cheaper than AWS, but not the AWS Reserved Instances (if.  Alibaba cloud - international is a good server less  computing platform and we can easily drive and event's which is actually useful for us, we can build our own things and deploy it over there itself without any infrastructure support so these kind of things.  As any cloud server Alibaba cloud offers a big variety of products/ services that will help to bring your organization to digital era.  A nice cloud platform that works well for all our needs.   We love the fact the cloud is great in collaborating and easy to use with all the team members.  The service it offers is comparative to industry leaders in clouding computing is very good looking at the cost side which is an important factor for a mid-size firm.  It's very scalable and flexible cloud platform.  Easy mangement and wide app support and has many usefull functions and features.  The overall experience is just average as offered initial credits free for instance setup, but instance cannot be automatically destroyed.   Results in a heavy bill just after 24 hours.   Need to be careful before use.   Offer XX$ welcome signup offer.  Deployment have been very good and effective.   The platform is agile with Pay As you Go (PAYG) model.   Also the WAP feature is also very effective.  Alibaba cloud internationally support all the shopping web sites and make this system so easy to access and usable from anywhere .   it is user friendly and easily team members can be trained on this.   This offer the feature of data analysis for the sales.  Still has a lot to offer in terms of flexibility.   Less exposure in terms of compatibility between cloud entities but good in terms of cost and the services offered.  me and my company using this around from few years and we are very happy to have such a great platform to store our data and files and more more stuffs related to our company.   and we can easily access it whenever we want.   very happy to have it .  Alibaba cloud is a good platform to different tasks and very useful.   And it is very user friendly.   It is very easier to story the millions of data in the cloud.  The cloud service is consistently available without interruptions, and we have obtained value for money with Alibaba cloud.   Also, access control is guaranteed.  Overall experience is fine as a user.   User interface is easy to use so you easily manage the devices in your cloud infrastructure.  Cloud-based security and server management has a lot of results on our RoI and compliance and security management.  UI is a little complex, AWS is very simple and usable, but Alibaba Cloud's UI is difficult to manage without guidance.    So I want to improve UI image.  I like that I can manage the different websites at in different ways based on the different model.   Alibaba Cloud is helpful for companies like us that deal with a range of client.   One of my favorite things that I most like to use Alibaba Cloud software is that.  Good pricing, excellent support, can do attitude Their English were blurry.   Not very saturated compared to AWS or such.  Alibaba Cloud is a great platform to access the different tasks and its process is very simple to use.   Alibaba Cloud is perfect for medium to large businesses that can invest amounts of money in one of the best cloud infrastructures in the world.   It has many.  Alibaba Cloud makes it easier for my organization to store millions of data points, access data tables from different departments, and analyze information in an efficient and quick way.   Since everything is consolidated in the cloud, getting access to data.  We used alibaba cloud in our firm and it was a wonderful experience,Alibaba Cloud is the only Public Cloud provider to really empowered cloud business between Europe and China.   It is very easy to use and is quite secure the overall experience is.  Alibaba cloud computing provides up to date and latest advancements of the digital world.   The best part about this is that it provides seamless compatibility.   Now a days lot of industries are using Colocation services and for that humongous amount of.  Alibaba cloud is a giant cloud computing which offers a great classy versions of highly optimized and performs great is a  high performing business-oriented cloud services it has data storage, relational databases, large data processing, content delivery.  The company has a good user interface and offers the customers a satisfactory experience to a certain extent.   it has a lot of things still to achieve before it becomes a pacesetter in the current market but the initial experience points towards a new.  The overall experience with Alibaba Cloud-International is excellent, by implementing the cloud-based  technology and security systems, we can work towards our vision - to make it easier for you to do business anywhere, We have implemented cloud-based.  Overall experience with the product is awesome .   it is the cloud based application which provides more secure and user friendly experience.  Alibaba services are good to use and cheaper in price than other clouds provider, But currently, there is not much documentation available.  Alibaba has more at it's disposal than just cloud hosting, which proves as a plus point if you're looking for one service that can do multiple things rather than finding multiple services to take care of them.   Pricing wise it's pretty fair too, and it offers a.  My team was the first to use this tool here in my company.   We loved the interface and the agility, so we've show to the other guys, and now the hole company is using Alibaba Cloud.  Alibaba Cloud - International has been a great company to work with.   We love utilizing their Cloud backup services and feel great knowing that our data is always backed up and extremely secure on a very high level.  We have used Alibaba a couple of times to purchase promotional gear for our company.   Alibaba allows you to find products and contact information from thousands of sellers (mostly in China) that have very competitive prices and let's you save.  Currently, many Japanese customers in China are considering migration of server resources on existing IDC (on-premises) to the cloud.    The main consideration points at that time are security, cost, and stability.   Alibaba Cloud has many achievements in.  slb service not good it's Single node and create it is very difficult because i need know my web service provides  services for many users.   I think the SLB product should be charged on demand to provide users with convenient and reliable.  Overall we were able to cut down on our latency by working with Alibaba Cloud services.   They were able to help our overall website performance and get us to where our site and company wanted to be!.  Overall, the experience with Alibaba Cloud is very good.   Comprehensive functionality and friendly interaction excites me.   But i think some details are not well grasped.   For example, file directory size counting.  This is one of the finest cloud platform, which provides the best uptime.   The services and billing cycle is prompt, using it for a long period, no issues faced as of now.  We have no problem with Alibaba Cloud, very easy integration and control.    Have a good performing but sometimes be slow.  I used their products for some of my developments, it was a great experience.   The normal or basic web hosting plan is a bit limited, you to quickly and easily configure a server with your choice of operating system and application images like CentOS.  Using Alibaba Cloud is a must if you plan on deploying in China.   Since Google Cloud doesn't operate well due to China's firewall, Alibaba Cloud is one of the few options available and is very fair in pricing actually.  Great cloud service to have access to all business document and files.   It is not just a standard cloud, you can have access to other features like computing and networking very safe.   Get your website domain with the most efficient data analysis in the.  Outstanding, they website is intuitive and they have a complete family of services to cover any need.  One of the best cloud providers available in the market today.   The breadth of solutions available with Alibaba Cloud is at par with the incumbents and yet pricing is competitive.  In general was a good experience.   But sometimes it turned a little bit complicated due to poor documentation in some provisioning steps.  The best solution is Alibaba Cloud Web Hosting, which leverages the power and flexibility of Alibaba's Elastic Compute Service while keeping costs predictable and setup straightforward.   While web hosting services are fairly commonplace today,.  Alibaba Cloud is a decent competitor to the bigger companies that offers that a lot of functionality and quick and easy transition from other brands.   In terms of usage and interface its not bad but it can definitely be improved as you get some errors here.  Its AWS but with an interface that actually makes sense.   The pricing is on par or cheaper than most other cloud providers.  Looking into this product, I quickly realized that pricing is something that sets it apart from other cloud computing and DMS products.   It offers a pay as you go type of payment plan that is helpful, especially if you are wanting to check out the product.  Alibaba Cloud is a decent offering that has a lot of functionality built in making it not that hard to switch over from other traditional cloud providers like Amazon.   It doesn't feel as polished but otherwise has worked well for us.  While using  Alibaba Cloud, i discovered that iaaS,AI, and the security are well in place.   As the service i requested for is Pay As You Go, the ticketing portal and the online booking request is superb for the world at large.   From experience, the Alibaba.  Ariba is a great tool to manage expense tracking and reporting to business stakeholders.   We use Ariba to track our vendor evaluations and invoices within our company.  Alibaba Cloud provides basic cloud computing.   If you have primarily locations in China and Asia Pacific region, Alibaba Cloud has very strong presence here.  Global application with rapid implementation.    Satisfactory global service and support.    Test pilot application across several geographic regions.  The documentation is getting better but there is a long way to go.   The usage and promise of SAML is not there yet, and if so an undocumented feature.  The whole infrastructure services and software on top of it give us a very good and mature experience.   Provision resources are fast, options and configurations are flexible, and costs are transparent.   Documentations are well written, new services.  Pros: Close support from the technical architecture team of the vendor helped move fast on various migration projects planned.   There was fast escalation on issues that were encountered.   Cons: Due to lesser community, sometimes things were harder.  Alibaba cloud provide high level of customer support start from the POC.   Their strong backend support are very responsive and you will get the reply within 5 mins.   Engineers are very skillfull, the arrangement on datacenter migration is proved very.  Alibaba Cloud offers the great customer experience and also help our business growth.  meet our requirment with good offering and support.  Good performance, SLA Great support from Alibaba Cloud Team Pro-active Teams.  needed a larger range of services that are comparable to AWS and Azure.  I like this service a lot.   We do a cross-border ecommerce between USA and China.   Alibaba Cloud provides a reliable service to our American developer team and production environment for our targeted consumers in China.   I do not know any.  Amazing service (the management of the VM, quality of experience) Quality of the service (VM, network.  ) impecable.  Very good facility in China, including 5 regions, bgp network and hundreds of CDN nodes, which help us to extend our business to China successfully.   Also Alibaba Cloud's Express Connect can provide connectivity between China and global.  Instances and services are stable most of the time.   Connections between different data centers across the continent are great.   No need to setup different account in China.   Customer services are very responsive.   Would love to see more features to.  Had experience years ago with Alibaba cloud China, but I do think the customer services of their Intl business is better.  Easy to use the console.   not enough service resources.   (ECS, SSD, EIP).  "}