{"name":"Alibaba Cloud - China","oneline":"Best public cloud in China mainland market.  Strong support on P2C High Flexibility, Scalability Rich product market to support vary kinds of requirment. I have used Ali Baba China to deliver a banking solution that required to be hosted in China and to be compliant with CBRC, and it was very easy to get our environment to comply with the lp with Ali Baba's account manage,et. Use friendly interface and can operate smoothly.  It was a good experience also when it comes on deployment of package and its a very unique style. ECS,SLB and RDS Servics are always running fine.  Nothing serious incident happened.  Strorage Service (OSS and NAS) had been effected by a public-knowed change incident at 2018, service was not stable and unreachable at that time.   Hybrid Cloud. Alibaba Cloud and the HPC clusters built by SAIC deliver excellent performance alongside flexible and scalable resources, dramatically reducing the pressure on R&D and ensuring project development progress.  Alibaba Cloud's public cloud has a. * Alibaba has world-class know-how * We have received great support and very fast turn around on all our enquiries * Performance-wise we're very happy with the quality and reliability of Alibaba Infrastructure.  No major issue have occurred. The overall experience with Alibaba Cloud is very positive.  Their platform ensures a high level of business continuity and the service team is very responsive. Currently, many Japanese customers in China are considering migration of server resources on existing IDC (on-premises) to the cloud.  The main consideration points at that time are security, cost, and stability.  Alibaba Cloud has many achievements in. slb service not good, it's Single node and create it is very difficult because i need know my web service provides  services for many users.  I think the SLB product should be charged on demand to provide users with convenient and reliable. Overall, the experience with Alibaba Cloud is very good.  Comprehensive functionality and friendly interaction excites me.  But i think some details are not well grasped.  For example, file directory size counting. Alibaba cloud has a strong support team to support customer's requirement.  they are quick response and easy to assign good technical skill resource on the project.  The development team is also very efficient to come up with most of customer's. The service provided is very stable, easy to manage and extend the capacity.   The Kubernetes service provide very easy way to manage your Kubernetes cluster, including deploy, scale up/down and upgrade. The whole infrastructure services and software on top of it give us a very good and mature experience.  Provision resources are fast, options and configurations are flexible, and costs are transparent.  Documentations are well written, new services. Alibaba Cloud offers the great customer experience and also help our business growth. meet our requirment with good offering and support. good experience: quickly response, great tech support, and stable cloud service. Good performance, SLA Great support from Alibaba Cloud Team Pro-active Teams. The service is rich, and the stability needs to be further improved. Amazing service (the management of the VM, quality of experience) Quality of the service (VM, network. ) impecable. Instances and services are stable most of the time.  Connections between different data centers across the continent are great.  No need to setup different account in China.  Customer services are very responsive.  Would love to see more features to. Had experience years ago with Alibaba cloud China, but I do think the customer services of their Intl business is better. "}