{"name":"Huawei Cloud - International","oneline":"HUAWEI CLOUD is relatively new as a Cloud infrastructure and service provider compared to AWS, but they have been evolving fast in term of new technical capabilities added and the support that we can provide to partners and customers. HUAWEI CLOUD has sites in Latin America,South Africa,and the Middle East, covering a wide range of sites, meeting our business requirements. HUAWEI CLOUD provides a wide range of products that can meet many service scenarios. We have been using. Huawei Cloud provide excellent service and products.  The cloud infrastructure and platform service are secure, resilient, innovative, trustworthy and stable.  Huawei cloud become a platform to accelerate the digitalisation of my org which offered a new. The service and system is reliable.  It fulfills our R&D work and day-to-day operation work. HUAWEI CLOUD is stable and has been used for more than one year.  HUAWEI CLOUD is easy to use, user experience is good, and new service provisioning and migration are easy. The application is smooth, the functions are perfect, and the service is. huawei provide a very good service on cloud computing.  The most impressive one is fast action.  when there is a problem, it can be solve within 2 days.  Another thing is that the price is also competitive.  Third, huawei is willing to listen to customer's. Who is used to work with AWS will feel very familiar with Huawei Cloud plus good price negotiation. We have with Huawei Cloud different projects as storage files, CMS(Content Management System), and ECM(Enterprise Content Management).  With Huawei Cloud, we have gotten good resilience and very optimized resources. I enjoy the communication with Huawei Cloud team here in Brazil.  It is easier and professional.  They are always open to talk and give professional suggestions based on their practice in China, which help us a lot in terms of new vision and new design. More than 10 projects in Cloud and Infrastructure as a service success implemented. Everything is great from the first engagement, solutions, deployment and D2 services.  Tools are easy to use, another thing we like is the dashboard and documentation. In General, my experience has been very good, considering the consultancies received and the support provided by the provider. Huawei Cloud is the corporate cloud for a journey to cloud strategy. very good commitment, technical personnel on site, always ready to help. It has leading and innovative technical architecture, good technical capability, strong and professional local support team, and good cost performance. Good service, product, and amazing support.  Sales team often go extra mile to help and solve issues around the clock. There is good price comparison service, and better customer service. Huawei has provided an extraordinary service for the last few years. Great commercial team that helped us win business opportunities. Amaze from start to finish, easy to deploy and works like charm. It's very easy to work with the entire team.  Our account manager its excellent and the services and support are great for our business to complement the SAP offers.  We have flexible and scalable options with the right cost. After using HUAWEI CLOUD public cloud services, our operation and maintenance team  no longer needs to perform operation and maintenance on the IaaS layer.  Instead, our team focuses on the operation and maintenance of the business layer,. The support and service from the Huawei team was very impressive.  Nevertheless, since this is our first experience with Huawei Cloud.  There were inevitably some learning curve for my team to pick up. Overall customer experience is excellent from sales presentation, business matching to technical support and trouble shooting.  Sales communication and account management is highly recommended which help us to fully understand the. The infrastructure is flexible and reliable.  User support is efficient and good.  We have been using their cloud resources for some heavy and highly bursty websites without any problems. Low latency with good performance at a competitive price.  Takes little time to handle Save time in time management.  Easy to manage. It's very comfortable to work with them as a strategic partner.  The structure of their team looks good right now.  They have project manager, commercial manager, professional engineer and a service manager to serve us.  I've head that they are. The pre-sales response is quick and provides useful information for us to setup.  And the subscription plan is flexible.  Quick response for the technical question while we setup the infrastructure. The cloud work well and staff is very supportive.  In Thailand, Huawei staff has known the local market quite well and very helpful to support us what we need with reasonable price. HUAWEI CLOUD also provides excellent services and support for small- and medium-sized enterprises.  Not only support for subscription services, but also help companies discuss future strategies and technology directions.  In addition, the performance of. Huawei cloud has a complete product line, excellent product performance, good cost control and excellent service.  It also has specialized colleagues to help deal with problems in time, making it a very good partner. - Huawei sales under our pain point and provide a suitable solution for us.  - Their cloud service is very stable and there are integration with other business partner. Easy & user friendly protal to manage resources & billing.  Resources are competitive and efforable.  Also, Huawei Cloud provide well-equipped function & resources to fit with customer demands of cloud environment. Highly flexible and scalable.  The technical consultants are able to optimize cost for our tender bids for cloud deployment. "}