{"name":"IBM Cloud","oneline":"IBM and its stability have been fantastic for me.  We were relieved of numerous worries after it was implemented.  We don't have to worry about upgrades, fix packs, and environment support thanks to its SaaS model.  The performance is excellent.   Now. With IBM security integration, threats can be controlled across all clouds through a consolidated security dashboard. IBM cloud is a combination of PaaS and laaS that will allow enterprise to create apps and autonate infra deploy.  we use IBM cloud in conjunction with one of our contract manufacturing partners where we used it for both file sharing & app connect.  the. For my research project, the IBM cloud includes a status dashboard that allows me to see the current issues, planned maintenance periods and security bulletins. The Project required an VMware IaaS deployment and IBM Cloud was able to provide the underlying hypervisor infrastructure as well as some Edge Networking Services.  The pricing was competitive and hypervisor selection was varied.  The hardware. It is regarded as one of the most secure and open platforms of its kind for organizations with various objectives and operating in a variety of industries. experience has been good in terms of running infrastructure within the cloud but there have been several large issues that we have had and support has been either unable to resolve or the ticket is closed before the issues are fixed with no ability to reopen. ibm cloud is an awesome service provider in cloud era, my primary use for ibm cloud is to have it act as a dedicated server for clint databases.  ibm cloud provide soils performance as compared to other cloud providers in the market.  it has around 60. IBM Cloud Lab Services team is very capable of getting a PoC done for you.  The only concern is that this service is offered only for new contracts and is limited in time and scope.  Later adoption of IBM Cloud Platform services is smooth (unless you hit bugs. I am having an amazing experience with IBM Cloud in terms of its pricing tier and performance.  Compare to other cloud providers, IBM cloud is very suitable for migrating your on premises infrastructure to private cloud. IBM Cloud has mitigated all risks we had with aging on-premises equipment.  Performance is exceptional and the end users are delighted.  We've been live for 9-months so far and have not had any significant technical issues.  In terms of total. With its cloud services, IBM cloud provides fully customized bare metal solutions, variable object storage options and free tech support. My experience is quite good because the availability of the service is high, and when we got any problem, we have an operation team to resolve it. Initial setup was  quite easy an relevant, but no follow up after to enhance and tune thing with latest new feature service available.  The portal is still slow and painful to use, the API as well.  Material is good, failure replacement also, but price still a point,. Use of the platform overall has been a very good experience.  Some of the tools available are may be geared to organisations larger than my own, and a bit more complex than some alternatives, but these are enterprise level tools providing huge. We are using IBM Cloud Foundry to quickly deploy, launch and scale our application microservices.  The unified command line interface to access the IBM cloud services and tooling has accelerated the deployment journey substantially. IBM Cloud is a solid, flexible, and secure platform that holds all the business content, more so the data and other comprehensive information.  Besides, IBM Cloud has outstanding developers services, from the updates, detailed orientation, and system. IBM Cloud is the most flexible and classical storage solution where security compliance is fully deployed and attacks are extremely eliminated.   More so, the distribution of the content is made simplistic and successful, making businesses. I've found the stability to be excellent with IBM cloud.  for non-complex environment applications, IBM Cloud totally works fine & much more supported services for the clients.  the solution is purely cloud-based and therefore we dont need to worry. IBM Cloud has maintained the storage safety compliance, where several considerations are enhanced to keep every process safe and secure.  More so, IBM Cloud has a flexible interface, that allow the use of several technologies to support. IBM Cloud teams have provided a truly first class Cloud Object Storage (s3) service.   They currently handle approximately 18 PB of our data. The team is highly supportive and customer oriented.  There always is the firm intention to find and implement a suitable solution - if needed, beyond standard processes.  Flexible infrastructure options combining legacy (bare metal servers, VLANs). Excellent secure platform to support  new , existing and growing with cost effective and good capability services.  Cloud portal is very efficient and user friendly and can manage all activities from infrastructure point of view.  On the operational side. IBM Cloud is a full-stack cloud platform that spans public, private, and hybrid environments.  Builds with a robust suite of advanced data and AI tools , and draw on deep industry expertise to help you on your journey to the cloud . IBM Cloud is a secure and standard application for content management and it has supported big data, which is the current norm for big companies.  Besides, IBM Cloud has sustainable operations management, which focus in keeping every content. My experience with this platform has been a good one.  I happened to use this platform together with the IBM watson studio. IBM cloud has very strong infrastructure, we are using this cloud service for one my database server since 5 years, I never felt like system hanged or needed to reboot the server. IBM Cloud is a confined application that allows flexibility of content, where resources and data are well used and shared.  Further, the big data where advanced analytics and cloud storage is supported has been facilitated by IBM Cloud. IBM cloud is a very user friendly and helps to validate and analyse raw data that its arrival time and size. This is very useful when we have applications caterings to large user bases like a  chat bot or payment wallet.  It is easily triggered when needed.  it. We launched a new business on IBM Cloud.  IBM Cloud and IBMer provided strong support in all phases of planning, implementation and operations.  First, we provided a simple company-specific service with PaaS.  Next, we provided a complex. IBM Cloud is an rationalized application that increases the content storage, from different avenues but the certified sources.  Besides, IBM Cloud has a suitable architecture in terms of flexibility and public sharing without an exaggerated cost. In our company, IBM Cloud is preferred because it is easy and efficient in how to use it.  Also, this cloud is usually used by several employees in the Asset and Project Departments. I am a user of this product, personally I liked the product , the storage capabilities are awesome, the security aspect is strong, I am sure that my data is secure.  the support from the team is exceptional.  Integration is easy to do with the systems.  sometimes I. IBM Cloud is next generation platform which enable AI & Machine learning support.  It is the best secure cloud storage.  It has low latency.  It has Mobile app support with AI based software. I only use some IBM services, and each one stands out in the category. Overall our experience on IBM cloud has been very good.  There are occasional hiccups in network connectivity and upsizing/downsizing of Kubernetes nodes have gotten stuck in loops.  But when running in a stable pattern, IBM cloud has proven very. It is highly reliable.  It was almost unaffected by the failure in the cloud infrastructure. It's has useful online documentations for practical use. IBM Cloud Team and Sales/Role out team from Kyndryl not well connected.  However, Where issues arose, IBM Cloud team was quick to respond, and many meetings were held, impromptu, to over come and stay on timeline. IBM Cloud it's a good cloud provider with experience in our business and they offer awesome service. I recommend IBM Cloud to anyone who needs real PaaS solutions. Good point : We are able to arrange a virtual server quickly.  Bad point : Due to the small number of VPC ancillary services, we had to design everything from scratch. We were running our SAP on IBM cloud for about two years.  There support was very good and all the time when we are facing any issues they are at the door step.  There product design and delivery team also exceptionally talented and easily understand. IBM Cloud is a package which allows cloud storage & cloud networking.  It allows us to get Public, Private , Hybrid network.  It provides secured & encrypted data network. Overall we have had a great experience with IBM and they continue to enable our growth and change effectively. Overall impressions of IBM are a great partner who are receptive to change however sometimes especial in urgent major incident cases could adapt their approach to meet customer needs. IBM cloud is giving the high quality service of public cloud.  Especially bare metal GPU servers are awesome as reasonable price and very fast internal network speed.  It is helpful for business. IBM Cloud has allowed our warehouse to automate heavily without reducing our work-force by more than 6% which was our target.  The benefits of using IBM cloud is always expanding as each department uses it differently to achieve success. My experience relate to IBM cloud was not very positive for the first months with service 24/7 offline for a long times and operation service non proactive.  After this months, with different escalation and modification to operations Management and. Our production, testing, and dev servers all run on the IBM Cloud.  Overall, it has almost every features other cloud providers have. Overall experience with IBM CLoud is outstanding.  Their Infrastucture as a Service performance is satisfying, which supports us grow the business multiple times in recent years tiehout. Flexibility of cloud services and ease of access is very good.  Availability of cloud services is very good. Online documentation is good in principle, however sometimes differs from reality.  Also finding the information needed is hard sometimes. This software has ability to support my workload of my system and it has ability to scale up on demand that allows us to get more relief. We highly recommend using IBM Cloud as we've been using their services (mainly On-Premise servers) for more than 6 years and it's been a great experience using their services. We are using IBM cloud service for Bare Metals hardware and really happy with the overall support services  in case of any issue/rectification. The response from support team are fast and the solutions given are effective.  Many functions are provided for operations management such as VM backup and restore, dashboards, etc. Different options for integrating a hybrid cloud deployment is very good. IBM cloud provides best in class Computation , Network Management and storage. Good and reliable tool, built in a simple way that makes everything easier.  We could really easier integrate with our software. The right balance to implement IBM platforms solutions, easier and resilient solutions. The advantage is that you can quickly verify Open Shift. I have overall found my exerience with IBM cloud very good, the people I have worked with within IBM have been helpful and supportive, whilst the products IBM provide have been consistently good with no downtime experienced on the whole. our overall experience with IBM cloud is great! they have a complete and strong portfolio to help customer on their cloud journey. Good experience with a very helpful account manager on IBM's side. Overall the experience has been good , they have the required end user tools for deployments.  Support also has been good so far. Multi-purpose Machine Learning solution to create powerful end-to-end workflows for different business use cases like chatbots, document analysis and data extraction or data classification. I'm an old customer, and i like your services, but i have little problem for technical support, i prefer managed services like managed server and VPS, but with Egypt team this problem was solved.  Your prices are still expensive compared to competitors, it. IBM Cloud has been very reliable for us, and the level of support is strong.  The infrastructure IBM has on the backend/management side is great. I am having a great experience with IBM Cloud so far as its speed is wonderful and servers are very safe. IBM cloud is an exceptional system, with tones of uses and services. IBMs ability to work effectively with all team / individuals associated with Cora Platform. Very easy to migrate VMs to IBM Cloud using our Veeam Backup software. It has good flexibility and is easy to use as an enterprise level distributed cloud platform. Working with IBM has created an effective partnership with the flexibility to allow continual improvement. To date I have only used IBM cloud personally for managing services and software, but I have found the experience easy to use. The support is not really focus to find a solution is more focus to close the task. Service seems to be fairly new to devops infrastructure.  There's alot of room for improvement. In general, the service is acceptable, but there are times when the support service is neccesary and its accompaniment or solutions are deficient. Good functional product coverage with safe and easy inegration. I have always found the IBM services of an excellent level witch confirms the great professionalism of this company. We use IBM Cloud as the Infrastructure for our shift creation tool,and We have a high reputation for response and stability. Solid provider with personal support when needed.  Not time tested by us yet. for problems not that solutions and slow support.  We have had enoughs problems with incidents but the support was very slow in response.  I would like it to be faster. There are frequent emergency maintenance that disrupt our service, so we decided to only use them as backup. The best Cloud Platform we are using, simple integration, and easy to manage. Excellent expertise of IBM in AI.  The product Watson and IBM Cloud together, are a big difference for our business. Initially we  has performance issue with the storage  assigned to us. It is a good cloud , with self service resources, and has local architects to help. support need enhancement due to some problem we faced during a large incident and took time to solve. Good service using Technical Account Manager contact. Highly satisfied with its data first approach.  It provides an easy and secure way for data storage.  Its a great product by IBM. IBM is Good in Technical and Support and stronger enough to compete with other cloud providers with their Baremetal servers and GPU worloads. IBM Cloud is knows as the safest, resourceful, and advanced platform for storage, and every security measure is taken to control the access.  Further, the flexibility part from IBM Cloud brings more editing and customization, allowing firms to stand firm in. IBM Cloud is a different and value alternative for critical (As Oracle Database on POWER) and new workloads (AI / BigData / Watson), but it has complications against other cloud vendors for traditional workloads (such as virtual environments). IBM has  good servers with accepatable costs.  It is usefull for in-house projects. Very good account manager, issues with service due to some failures. the UI is nice, easy to estimate costs, provision , or manage services. IBM cloud and garage team are excellent team to work together to deliver the solution. We use IBM cloud hosting services for all our data and applications.  We have chosen IBM as our supplier because of dedicated support and account management.  We are very pleased with their services and their support on tickets raised have been. On the overall, our experience with the IBM  CLOUD has been a good one.  The security of the CLOUD service has been up-to-scale and up-to the standards in compliance of the regulatory requirements within which we operate.  Data migration from our. I am satisfied completely cloud servicees.  They contributed my productivities. Overall Good Experience, Experienced Technical staff, Well support. in terms of the services are good but support needs to be improved. great company with fast support and live chat ,ecllent services. The IBM Cloud and its available services have allowed us to accelerate innovation and drive growth in our AI system.  The ability to provision services to support an immediate ask (build a machine learning model) to something more long term, e. g. We have been a customer for many years and have experienced the growth of our and their company and this his been without any disruptions.  We get guidance to the new offerings on a regular basis and feel that they move in the right direction and. Overall experience with IBM Cloud has been good.  We feel valued and IBM team listen to our requirements and work with us to achieve our Project goals. I'm an experienced user of NLU and I'm truly interested and working now with IBM on  Watson discover.  IBM had help us to achieved some of the expected results.  We beleive IBM watson is the best API available for NLP purposes and application. As we all know, IBM is the leading provider of Bare Metal Server.  And so it is.  Customer Support is quite good.  The tech team always respond very quickly. We have been working with IBM cloud for the quite some time now (earlier softlayer).  We are primarily using their IaaS offering with a combination of bare metal servers and VMs, load balancer and enterprise SAN storage and running serious production. We are overall satisfied about using IBM Cloud Services for our production environment.  It's a perfect environment to support the work of our developers. IBM is responsive and have knowledgeable staff.  The solutions specialists are genuinely interested in how you use IBM and how it works with your company.  Because of the attention to detail on solutions they provide, you get the right solution and right the. Great customer service provided by our Customer Service Success Manager.  Always responsive and provides valuable service. We use IBM Cloud for several years.  We are happy with the service and very cost effective for bandwidth intensive workloads. Good client relationship and support when issues raised.  The cloud services offer great flexibility to customise your own solution, however we have seen some issues with certain services, where the resilience and reliability is not as good as it should be. IBM cloud is one of the most trustable and durable cloud computing that we have experienced it has a lot of advantage and lot of features that will give a bonus for working and over all its really very helpful to maintain all our datas safe and secure. They have a solid performance and provide access to lots of data centers and they support a big amount of network usage. IBM Cloud is one of the best cloud service currently available in market.  It is provided by the IT giant IBM.  It includes all the three types of cloud services i. e Infrastructure as a Service, Software as a service and Platform as a Service.  These three comes under. I had been using IBM cloud for several years now and I wil say it is by far the best cloud computing service I have ever used. The overall experience has been great as there is efficiency in data security as well as flexibility in terms of organization determining the level of control. IBM cloud is a great product by IBM, henceforth my company has used it with trust and joy.  It stores data in an easy and secure way.  It has a data migration feature with high security which increases the efficiency of work.  My overall experience was. IBM Cloud is good with: Log Access, Approval workflow, Data security, Performance monitering,SLA monitoring, Reporting and data migration  this are some areas where IBM stands at a higher side than other companies which are providing same kind of. Overall, we've been happy with IBM Cloud.  It may not be quite on par with Adobe or Microsoft, but for us, it's gotten the job done quite nicely. - Mutli-platform support [ PC, a Mac or a Linux ] is something wonderful we are expecting these days - Store files on secure cloud servers, eliminating the need for local copies.  - Also provide the option of lite version which was great.   Best so far. IBM Cloud has helped my organization with a secure infrastructure.  Data migration is very fast and streamlines my work efficiency. Best cloud solution for store data and manage your information remotely without any interruption.  IBM provides most advanced technological support for their cloud solution. IBM cloud does what it is supposed to.  It performs well and allows a massive 40GB networking.  It is however not as easy as others re the setup and some of the solutions are a bit complex.  It proves amazing because you can add developer services and. The speed of usage / Performance is well satisfied, with a strong storage management  And also the GUI is good  It eliminate the need of administration on database. It has been long since our organization switched to IBM cloud, it gives an easy solution to work on data be it transfer of data, storing data over cloud from base locations with remote access to data from a centralized location.  We can access data from all our. Wonderful cloud solution developed by IBM to manage the information remotely and store it to apply artificial intelligence in different systems. The cost, services offered in terms of deliverables are justified to the market value.  I hope to see many vendor compatible connectivity. Using IBM cloud we can access Data storage using different platforms and locations, we can easily integrate daily processes, we can customize applications, and access cloud services from anywhere with an active internet connection, few. Friendly, very intuitive, it works very well when it comes to data collection, flexible database creation, and very accessible to users. IBM cloud provides a provision to clients to choose from IBM virtualization-enabled servers, middleware and SaaS applications.  I think, IBM cloud has a good future if you compare it with Amazon and other services.  It is highly secure, dependable, reliable. IBM Cloud is the very efficient , user friendly and easy to integrate with any application.  Its also very cost effective and have so many custom functions for business use. All the services available in IBM cloud are well architecture, easy to use and comply to the industry best standards and have a well documented process to be followed for deployment. Allows more storage and collaboration.  Security and efficiency goals can be achieved using specific tools in the IBM cloud.  This platform is very easy to use and the service is very good.  It has better storage and efficiency compared to other similar. IBM was consistently late with their deliverables, however, once delivered, the components were working properly. Was ok- but not exciting.  Consultants/partner seemed really busy with several project at the same time. The management of our services for our clients was an easy affair.  The possibility of customization to needs and scalability at zero resource engagement has been outstanding. This is a great and open cloud for business with an advanced Artificial Intelligence  capabilities  and wide web expertise on enterprises. Our company has really reaped the benefits of working with IBM.  They are one of the best in the industry for a reason.  Very knowledgeable and reliable partners.  The IBM Cloud itself has saved us from a winded web of disparate systems and data.  We now. The application provides great flexibility to use according to the requirements.  And also the service.  I used get quick service from the team. Me and my peers feel it is only meant only for event-driven serverless computing.  But, not for large monolith applications.  We can comfortably perform all small tasks without starting up complex infrastructure.  Not recommendable for long run services. The first thing is that it is very easy to use and any new user can use it easily, easy to use in transfer of data , Storing and communication through remote client location. Best option for project managers looking for integrated application lifecycle also relevant for digital agencies. IBM Cloud is mainly providrs n financial services to industry for providing public transport for the security,its a very important for every organisation which is working on cloud , this gives us more flexible n security to our organization financial. I have worked /used IBM cloud for one of the AI/ML capstone project .  the layout and features easibility is developer friendly and one can easily explore and develop/deploy with out ep knowledge .   a vast no of API' available that can be easily integrated to. We have used IBM Cloud Services for our organization and great experience with the service it is better than other cloud service provider.  we really appreciated and would like to recommended in my circle. It is very reliable and useful for sharing confidential data and hosting a meeting.  We have also used the service since it provides more agile and speeds up the delivery of features to our business. We are using IBM Cloud for deploying the Microservice, which provides faster response when compare on-prem.  The infrastructure can be done with easy way with monitoring, auto scaling. Easy to understand and any new user can use it easily, data management is amazing which helps in key decision making, I am also fully confident that my data is safe. In general my experience is good, since IBM has different alternatives for each necessary solution, so you can select one service or another and adapt to each situation. IBM cloud hosting is top notch with in-build security features available automatically coupled with the cloud hosting.  Being a leader in cloud hosting, they ensure that any available soft layer, security or OS patches are automatically applied to the system. Over all its good and very flexible to use.   They had a amazing product line and very user friendly Ui which helps  users guide to right options. Data analysis capabilities and security are the key factors which makes any cloud solution standout.  In both these areas IBM really ups the game. this is awesome for any company who works more and need cloud related things and it also provides a enough level of storage and services. the experience overall was the best one i have had with software supoort and applications for development and progress reporting. Great user interface  great KB info and support  Integration & Deployment with other SaaS apps definitely recommend for this product. IBM cloud is a brank and definitely, it is one of the best solutions for our private hosting alternatives.  The way it integrates with our existing cloud is really the best feature of its all. IBM Cloud is adaptable for almost every requirement.  It does not offer partial functions.  The Contractperiod ranges from six month to a year. Secure and Customisable Hybrid cloud platform for organization and business needs.  Integrated AI technology  improves agility. IBM clouds, BlueMix or SoftLayer, both are very flexible and excellent choices to deploy something that requires dedicated physical servers or hardware, but they lack behind on all other cloud offers. My Company believes in using both the art and sciences to deliver radical insights and deeper connections to drive evolution in the media industry.  The vision for Media Mantra was to create a next generation, cloud-based data analytics platform to. Compare with AWS or Azure, there are less manuals and sample use cases.  But free trial is very useful. We migrated our microservice APIs away from an on-premise implementation into IBM Cloud, and have been in production for 2. 5 years.   This service has offered us the ability to be more agile and speed up the delivery of features to our business, whilst. I usually use this to share files and conduct calls with staff team.  File sharing on call gets easy. . so hands down. . for smpoth functioning.  Yes, interface could be more creative & interesting. My overall experience is very positive, it's a stable relationship between IBM and us.  We have and had also some challenges but as in other stable relationships we find always a solution.  And we are solution oriented and not who has made which failure.  This. IBM Cloud helps us wit constant data storage capability for microservices.  It's is extremely fast in it's operations and easy to implement.  It's also very easy to scale.  The menus are easy to access.  It provides fast database provisions.  The set up is so fast. IBM Cloud is an incredible solution.  It offers the best in cloud computing security and fraud detection.  This tool helps us to compute data in parallel necessary for our day to day activities.  The scalability is tremendous without a manual as guide or special. It is the best tool for helping your business to handle customer service issues in a timely and efficient manner.  It offers you a standby and out of the box backups on the cloud.  It offers you the best database service on the cloud. It has been a sincere pleasure to work with IBM.   Their customer service teams are excellent, the product is first rate and we have been able to collaborate on multiple new business pursuits. The IBM service has much more security and access very safe and secure data in our company project.  Managing relevant data to prevent a mask to deliver ourselves. Now a days organizations are going to shift their businesses from On Premise Solutions to cloud.  We have implemented IBM Cloud which offers Infrastructure as a Service (Iaas) and Platform as a service (Paas).  We have implemented (IaaS) Platform.  It. IBM Cloud is a bit platform to store the large amount of data into one unit of suite.  It supports many programming languages like PHP,phython, java and more .  Easy way to access this IBM Cloud from any where in the world. They offer end to end support. IBM Cloud was adopted in our company to increase our multi-cloud project and they deliver what we expect in cloud providers.  Since we have many options in this area, IBM should give more attention on it if they want to continue in a scenario with. IBM Cloud is a cloud server which are using for storage the data.  We can Store our very valuable and important data in it and it provides very good security for secure our data.  We can share and transfer the data with the help of it.  And the performance of. Shifted all our email toward IBM Cloud, which gives us reliability and availability of each individual email 24/7 with peace of mind.   Mails are available on Verse software over mobile at anytime off office hours. Its one of the well known cloud system.  Very good at sharing and protecting your data.  As we know speed is a very important key for clouding.  IBM cloud is fast, trustworthy nad protective. IBM Cloud services has functional tools such as IBM Watson, NLP and online R-Studio for data analytics.  Once I created user account process is gone very smooth and I was able to learn quickly from documentation.  There are many cloud solutions online but. The main positive side of the IBM cloud is, it's built upon technologies to ensure interoperability and flexibility.  It has multi-zone capabilities available over all regions.  Provides good analytics by using tools such as aPache spark, Apache Hadoop and. IBM Cloud offers an innovative environment and platform, support much more programming languages such as PHP, Python, and Java. Very good experience that I have with the services it provides. IBM Cloud is an implementation of IBM's Cloud Foundry-based open cloud architecture that enables you to quickly create, deploy and manage your cloud applications. Mailing experience has been great while working with IBM Cloud, hardly single incident which has resulted service outage. We use the IBM Cloud Functions product for our application development teams.  The product helps our teams and developers scale easily and quickly with mobile integration. Cloud set by IBM or International Business Machine Corp.  consists of infrastructure as a service and platform as a service.  IBM Cloud can be used for the creation of new applications, deployment, and mangaging of them.  Furthermore, it is an open cloud. IBM Cloud is a robust suite of advanced data and AI tools, and deep industry expertise to help you on your journey to the cloud. I had a great Experience working on the IBM cloud .  Implementations was very easier, and additional features can be included.  It. It is a tool that has adapted very well to the needs of the company, since it has a large database that integrates services of mobile solutions, internet of things and cognitive abilities very well allowing us to develop technological experiences.  This software. It is a business cloud tool that allows to implement artificial intelligence processes that adapts very well to the needs of the company.  This excellent software has a wide variety of database options for easy integration, low latency, parallel processing,. IBM cloud is one of the most prominent cloud provider by one of the tech giant IBM.  IBM is pioneer in computer related software and a really impactful company.  IBM cloud is mainly used in enterprise industries. Security of files and information of any given company is something to take a high consideration about.  In fact, IBM Cloud is from one of the biggest corporation in the world, more so on the technology field.  IBM Cloud is mobility, accessibility, and. IBM Cloud is from a company that is trusted and well known for best software creation.  Secondly, IBM Cloud has well established safety measures, and no single case of insecurity that we have ever experienced.  Finally, IBM Cloud has its own well. I have used IBM Cloud for almost two years and my experience is good.  The tool is very safe, mobile, and comes with ample cloud storage space.  It is easy to use and the UI is very intuitive.  With IBM Cloud, we no longer worry about misplacing business files. IBM's long-standing mantra is 'Think. ' What has always made IBM a fascinating and compelling place for me, is the passion of the company, and its people, to apply technology and scientific thinking to major societal issues. It allows users to process heavy workloads and store large volumes of information, which contributes to increased productivity.  It is pleasing to offer users a monthly or 'pay as you go' payment option. IBM Cloud (previously Bluemix) helped us to leverage multiple services on Cloud.  The IBM Cloud offered various options like bare servers, Watson services, GPU servers for ML activities.   For startups like ours, it is a great bouquet of services. It provides the good technical features and the brand itself which is reliable also and for organization most to the company need a trusted brand which provide virtual storage or cloud storage and it does support on all OS such as windows, linux etc. IBM Bluemix is based on Cloud Foundry, an open PaaS (platform as a service) to provide customers a choice of clouds.  A PaaS model allows developers to focus on writing code since all infrastructure including the application servers are provided. bluemix was cloud based platform,it supports programming languages like java,php,angular,node etc. . , it was more security and speed in process good to use,it was used for different platforms like social,mobile etc. . ,. The IBM cloud is a great environment for deploying applications in the cloud in many ways, such as web services as well as artificial intelligence.  Its simplified infrastructure makes the deploy process very simple and also the maintenance of these. It was possible to make available a number of cloud resources that made it possible to gather data from a variety of sources, scale systems, and incorporate cognitive services that drove the value of our business quickly and with aggregate economic. IBM cloud was one of best PaaS I've been used for IoT services deployment, have documentation for all levels of technical knowledge from getting started guides to complete feature reference manual.    On the operational side, the platform is very. Get a platform and install/ implement/ Customize as per requirement.  No predefined flow which makes it easy for deployment. Tech specific application deployment needs the expertise of cloud environment, but you can try where I tested with Node js application and it's run smooth as expected.  The response time of server is impressive (also depended on nearest datacenter. Once Softlayer, after Bluemix and now IBM Cloud.  It looks like IBM deleted the first two and created IBM Cloud from scratch.  Softlayer was badly evaluated, with some security issues - and now IBM Cloud solves everything.  It is a good promise, being in. IBM cloud is a reliable cloud platform which offers PaaS and SaaS features.  We have been using IBM cloud for all our computing needs.  This include provisioning the servers as well as using high level services like Watson assistant.   IBM Cloud services. We started using Bluemix mostly for its Software as a service API's for Watson, and integrated it with out RPA solution (Blueprism).  The experience was good, the API integration worked as expected, but for superior performance, most of them. We migrated from an IBM dedicated data center to a SoftLayer cloud service.   Our company was allowed to BYOIP even with the conflicting RFC1918 address space.   We even had IBM route one of our public IP subnets that the company owns, to use in. People can work parallelly on the same product/app.  Developers can work remotely irrespective of their location. Its an awesome PaaS offering from IBM.  It was developed on top of Cloud Foundry software.  With less support team, the developers can easily choose whatever services they like and deploy their code quickly. It provides the user with the best customisable options and user can pay only for the space that is needed by him/her.  By using IBM cloud we can access our data, files and folders anywhere in this world and it also saves our data from hackers as it provides. I supervise developments of mobile apps and web apps.  I upload our VMware space to IBM Cloud.  But I did not work with Big Data analisys. Very good experience that I have with the services it provides, the actions we have with this great tool is very high and I like the way we can work with it, it is very safe and very effective, it was implemented very well in my company and with my users and. IBM provides very good Information technology services provider and also provides very good cloud services which is used worldwide for storing data which can be stored for longer time. With IBM Cloud or Bluemix I can easily store data in a safe and secure manner.  IBM's Bluemix provides us peace of mind that in case of a catastrophic data loss it will be there to recover our systems. IBM Cloud provides enterprises (SMEs and Large) numerous ways to elevate the value of enterprise data with new insights and AI. Its very good and worthy.  had very nice experience .  liked it very much. interested in sending reference to friends as well. Performance issues and lack of support make it difficult building something on a large scale.  and it comes cheap initially but becomes costlier when you start upgrading the plans. Managed SAP Applications ticked all the boxes in terms of availability, performance and security.  Most important, however, was the fact that IBM offered fully managed services.  My Company wanted to reduce the burden on its IT team so that they. Big company. lots of moving parts.  Need good relationship to get things done.  Basic services available, with not much toolset or features as compared to others in industry. Bluemix is the best option for cloud hosting.  This tool has clear segmentation of a big application catalogs. Ensuring customer satisfaction through a secure and cost-effective cloud hosting. Long-term contracts, services are available at hourly or monthly rates, so that users only need to pay for exactly what they use. Our company uses the IBM cloud infrastructure to provide an integrated and scalable platform for reverse logistics.  We develop recyclable collection points with a proprietary rewards program, where the user delivers the product packaging, which. The overall experience with their lifecycle management suite have been very satisfying.  The ability to get a complete traceability between Requirements, work items, test cases and defects has worked out really well and reduced the need to create. IBM Watson / Bluemix is more of an enterprise solution when compared to AWS or Google Cloud.  Integration of Watson offers incredible processing power and computer vision capabilities built-in.  Only thing is it has a bit of a learning curve and GUI can. Very good service.  They really care about customer.  IBM and our organization worked together to solve problems.  They gave training and implemented projects like one team. Out of the mix of cloud app development environments, IBM Bluemix needs to focus on functional improvements if it stands a chance of beating the likes of Google or AWS. IBM Private Cloud has proven a useful tool for us to extend our applications for use inside or outside of our office network.  IBM Watson technology helps us monitor and analyze key trends in our industry. Service goes down a lot, time to spin up new instances is long.  Pricing is the biggest attraction. Software is OK, not thrilled with it or the vendor.   Was expecting it to go much easier than it did. Its great to use and understand.  One of the fundamentals in technical usages.  It has a great support and reliable in a implementation of virtual cloud or cloud storage. Ensuring availability of your system is critical and that's what IBM Cloud does exactly.  though the user interface needs improvement, having your system always available and secure is an important factor in the product success. IBM cloud tools you need to all the cloud solutions.  It service offered through public, private and etc. My experience has been good with IBM Cloud.  It has helped us to sace our time and money.  Additionaly, it had helped us to keep our business safe and secured. It is a nice product/service with more than adequate support.  IBM has built a product that will not fail you for sure!. The interface is quite user friendly and allows to build app. Specially nodeRed is quite helpful to design apps to show the flow of the components. IBM cloud is probably the most upto date storage management tools especially when compared to other cloud storage like google drive. It is extremely helpful and remains relevent due to its constant updating and efficient and timely customer service and. Good solution but it is handled by a very large company which takes time to respond.  The type of contract we have does this way. Cloud computing or cloud computing is a model for the provision of information technology services in which resources are retrieved from the Internet through web-based tools and applications instead of a direct connection to a server. Adding the softlayer datacenters as an extension to the KP datacenters had its challenges.  There were gaps in meeting the standards required for operational support organizations and the implementation was a slightly under developed for a. Picking IBM was a good bet.  It is a great product/service with more than adequate support.  They have a team working with us who are very knowledgeable. Expensive cloud services, responsive support, about what you'd expect with IBM.  Watson is still not useful enough. The service and the quality of the machine are good but the console interface an toos are a little complicate, it could be better. The IBM cloud platform weaves together services, infrastructure and data to rapidly bring ideas to production.  The vendor's value proposition is that it simplifies the process of building systems that use data to understand, reason, and learn.  IBM. Provisioning and Orchestration are not as seamless as compared to other cloud providers.  The engagement and handoff between IBM and Softlayer makes you realize that the integration of the 2 is still WIP. Works well, generally there is no issue, good download speeed  Response time to resolve a call can be improved. This is good with an integration of all API that needed by a developer.  This makes developer life easy so a developer can concentrate on only development instead of wasting time on integration and resource allocation and how to communicate with. Anything that should be quick and accessible is made a long process through IBM.  You can tell that their PaaS offering is more set up to give their sales team something to do rather than speak for itself like its competitors. nice experience in term of data storage accessed through different platform and loation,easy to manage connection between partners and customers,. I am using IBM Cloud for more than 1 year.  This is one of the best platform for Cloud computing and virtualization.  Implementation on both IaaS and PaaS platforms is very easy and flexible.  It also provide different deployment models which helps in. Excellent plataform, I like the fact that it allows in an integrated way the creation, execution and management of several applications in the cloud.  His concept based on the use of open technoogy seems very successful, since it supports different. After the acquisition by IBM, Softlayer is having problems on the service they provide, unstable infrastructure and the lack of expertise on our platform (ATG), impacting our operation. Although, IBM Cloud has many many good attributes, the team still needs to look at the stability of the overall platform and it's components. We've been experimenting with IBM's cloud services and have had mixed results at best.  The documentation and setup has vastly improved over the past year, but the actual services we attempted to use remain fragile and inconsistent. The project took twice as long and it did not go well.   Each member of the team turned over during the process, which impacted our project as new members were not provided to us in a timely manner.   The overall feel was that they did not understand. We have considered Blue Mix in the entire solution Watson IoT.  To have a vendor with a tool for any needs and with so many professional people it has been a success factor.  The negative aspects are mainly the costs of consultancy and the rigid environment. IBM has great reps that are super responsive and have your best interest in mind.  We are using their Personality Insights API and love it so far. Our company already had familiarity with IBM products and services.  IBM Cloud has great speed and storage capacity.  We use it as a platform for cloud implementation. Bluemix for Blockchain is absolutely bad.  The hidden costs, the misconfiguration elements as well as the black box they try to sell are the reasons of my rating. IBM is a great partner that is well equipped to meet the needs of a large financial institution.  The IBM bluemix platform is feature rich and is a great for initiating the journey of migration from on-prem to cloud. Their platforms on private cloud integration and virtualization is sophisticated and not vulnerable to cyberattacks.  Great security features. As a platform, Bluemix promises to be a single point of access for much of the new-generation IBM cloud-based product line.  It contains a mobile app development environment, a mobile app test environment as well as access to the. The IBM cloud has been very useful for the company due to its cost and quality ratio, ideal for our storage needs and one of its points in favor is the secure data exchange it provides us.  In general terms, it has an optimal performance for the storage that we. It's Excellent  a) Creating Apps With The Use Of Artificial Intelligence, IoT, Data & Mobile Services.  Build And Run Apps.  b) Optimize App Performance.  IoT Platform. Ok product based on Cloud Foundry technology by pivotal.  They incorporate common technology standards like WAS. We are currently using their API offering (API Connect) and we're very satisfied with the service, including a disaster-recovery infrastructure we activated during a go-live, without any issues. No one ever got fired for picking IBM.   That is because they dont want to see their products or services fail.   It was a solid product/service with more than adequate support. We had opted IBM Softlayer for it's service on dedicated servers, managed hosting, and cloud computing for our company. We use Bluemix for several things, but our main use thus far has been for the Conversation Service.  We use this service for the dialog design of our Virtual Agent.  Additionally, we are using WKS (which I hear is now no longer a part of bluemix?) for. The IBM cloud has a good interface/api's that make it easy to provision but its not great on performance. it is very functional , because supports several programming languages and services as well as the DevOps, also an integrated way to create, execute, deploy and manage applications in the cloud. The cloud platform is based on good products but the overall experience is quite frustrating.  It lacks a good support and a good integration beetween the different tools. While Bluemix offers a wide variety of services and products, they are very segmented and it is quite hard to figure out which services/products to select and how much it would cost for a given project.   It is also not easy to figure out what are the. We ran into some technical issues with the server, and the response time to tickets is really fast, and tickets are also auto generated and the system is monitored 24/7. IBM Bluemix (now IBM Cloud) has been having many changes in a short time, it has improved a lot but it is still far from AWS or Azure. They have a good team working with us and knowledgeable.  In IaaS they still do not have bring your own IP for baremetal servers when using their managed services.  Different could offering does not integrate well and the roadmap is not clear. cloud platform as a service developed by IBM.  It supports several programming languages and services as well as integrated DevOps to build, run, deploy and manage applications on the cloud. Didn't work well:  took a long time to establish a good working team with an aligned understanding of the requirements and implementation (IBM in Canada did not seem well versed in the way the product would be sold and used) [Note:  this is much. Softlayer and IaaS not in our end state vision for this project and adopting PaaS/Bluemix longer term.  Bluemix offers significant additional benefits in our end state devops vision.   Full access to bluemix senior resources and teams have created. For softlayer the infrastructure in general works according to the definition of iaas, has some limitations with respect to GSLB.  For bluemix the services in general are regular, they still have a long way to mature in aspects of self-management and elasticity. The customer service experience at IBM/SoftLayer has been wonderful, based primarily on the actions and relationship with two of our SoftLayer support personnel.  The overall product is solidly behind AWS, Google, and other providers in capability. Smooth cutover from legacy data centers to IaaS with no disruptions in service.    Following cut over systems have been extremely stable. Overall the Softlayer IaaS service works well for our needs.  Its extremely important in going to the cloud however to strongly assess and control the expectations of the organization on what workloads should go to the cloud, and when.  Vendors,. The solution is reliable and robust but the implementation journey was long and painful due to clearly adoption. they are current providers of technology mainly of infrastructure, they support and maintain the equipment and applications related to their brand and that was the main reason why their cloud was chosen, but when implementing solutions in their cloud,. We had a neutral experience on physical boxes.  We didn't have any wow factor and the services worked as expected.  Direct connectivity was difficult to provision and expensive.  In the end, we decided to roll back to our in-house infrastructure as the. Local skill is some what limited.   Different IBM teams not talking to each other. The product suites is able to satisfy most of the necessity for modern development, unluckily the the vendor support severely limits its possibilities. We have implemented Bluemix, specially for the use of the Watson module.  Our engineering area had very specific needs and IBM was the vendor that best suited their needs.  As we already has a previous contract of SAP support with them, the prices. IBM cloud offering is still maturing, technical team was very helpful and knowledgeable about the product. easy to implemment with an expertise partner. I think that Bluemix offers some good services like MobileFirst but IBM isn't a cloud leader provider, because has a lot of dependencies of the physical world.  The auto-provisioning its not true at all, we really need the provider during the. Overal conventional IaaS is all fine although some components are noticebly external, i. e.  Fortinet FortiGate firewall - managed outside the SoftLayer portal.    DirectLink arrangements are not straight forward especially to expose interconnected external. Solution given by IBM was fit to our requirement, Cost effetcive.  Seamlessly product impleted.  Customer focus solution.  SoftLayer's modular architecture provides unparalleled performance and control, with a full-featured API and sophisticated. Initial stage IBM has demonstrated very good capability, We went on iPaaS solution but when we went on implementation mode then all the surprise has started coming. .  Capability issue.  no single point everything . .  everywhere. Some cloud capabilities are not enabled in IBM CLoud. there was good support in the questions regarding the use of the cloud solution. Very easy to use when the purchased services are known, the service behave as expected.  Almost impossible to involve new services or technologies, based only on the providers pre-sale: documentation is confusing, the support has little idea. Our second forray into the IaaS vendor landscape, and our experience was quite better than our first here at SoftLayer.  It was clear that the IBM team we worked with had good experience in moving in customers and helped us think of the right questions. Issues with the service stability and solution times.  It's been hard within the people to realize that the cloud is a real option, a secure and viable option.  The process of adoption has been hard. Very satisfied, with the level of support and tools provided for integrating API.  Watson API was great and robust. IBM Bluemix provides a great foundation for the various Watson services, but can be a bit more challenging to manage than AWS or Azure virtual infrastructure. IBM always have prime solution for diverse IT applications to run application with efficiency and performance.  We have started using IBM as IAAS platform have migrated many mission critical application which is hosted  in IBM cloud VM's.  We. IBM is not enough agile and their cloud is under heavy development if you compare i. e.  Azure. Good IaaS platform that is easy to scale and  relatively ease to begin using.   Should have governance and strategy in place as you begin to utilize these type services. IBM could never get the natting to work across their network and ours. Easy to use, but not standard procedures.  AWS seems to dominate the market so they are establishing standards and it will easier for consumer if they follow that or convince AWS to use a common procedure.  That will help consumer reusability of the. Softlayer taken the burden out of hardware and VMware licenses. Availability of bare metal server Service and support. Overall platform reliability did not meed our needs.  There were frequent outages and configuration changes on Bluemix affecting our workloads. We used Softlayer for application hosting One amazing thing about softlayer is that it give more power and better performace than any cloud hosting I have used.  Also,moving data betwen regions are free no additional charges were charged.  This. implementation was straightforward and smooth. Good products; processes weren't optimal. the product is easy to install and use.  but it is not easy to find an expert of the product in my country Turkey.  So the expert came from abroad all the time which was expensive.  But we concentrated on the API part of the product only so our people. it's definitely one of the very good products out there if you're looking to control maintenance costs. Very satisfied with IBM Bluemix and its support. Easy to use platform, development IDE good to follow.   Training services and education support fantastic. It was good experience working with IBM and IBM products. Overall experience was positive.  IBM APIC on bluemix dedicated aligns with our hybrid cloud strategy nicely , but we do have to iron out some of the wrinkles in the product to get it fully working. Not all development software available on BlueMix limiting application deployment to cloud infrastructure. Though the implementation was easy, the software is even easier to use. operational reality on the bluemix platform needs to improve and provide more resilency and automation to ease the lives of the platform engineers. Some aspects of IBM - Bluemix are well developed and provide enhanced usabiulity  (Data Science Experience for example).  Others are needing some additional development.  Our companies other IaaS vendor is AWS, and so it's hard to make a. Management portal is a dream to use.   It's well organized and very intuitive without any training.   We ran into some technical issues with the server, and the response time to tickets is really fast, and tickets are also auto generated and the system is monitored. The Softlayer (now part of Bluemix) project has been an overall success providing us with fast provisioning, scalability, and agility which wouldn't be possible in-house or with most of the other providers.  We were looking for an IaaS where we would have. IBM was amazong when it came to designing the perfect Bluemix instance.  Their sales team listened to our needs and architected a total solution for a little over budget. It works well with the vendor and able to provide a design solution to satisfy my business requirement. IBM Bluemix as a cloud service is behind its competitors like Google, Amazon, and Azure.   We frequently had issues with users logging in and the system not properly running.   It is not as effective for analyzing actual costs of the product as compared. Good support and quick response from the vendor. easy to use. The IBM Bluemix platform provides a variety of services that we are using to teach students around Artificial Intelligence topics, using analytics through Watson and implementing IoT projects. Support was good but the product needs more time for roll out. IBM Softlayer Cloud had the bare-metal capacity of upwards of 40000 cores with 256 GB RAM that we needed for bursting our compute intensive rendering tasks over a period of 2 months of 24x7 operations.  Augmented by the fact that these were all in. The support docs were very well documented and easy to follow.  It required minimal effort to install and get it up and running.  Overall the performance is satisfactory.  We are waiting for more stable version to be released. A key focus is flexibility and openness of integration options.  Company requirements dictate a hybrid solution.  The maturity of capabilities to meet those requirements is lacking and therefore prohibits rapid implementation and opens the door for. System performed as promised, and customer service was excellent. The Object Storage enviornment is well suited for doing backup's to the cloud.   Utilizing our existing backup software, CommVault, we were able to connect up to the Swift Object storage enviornment via an API.   The Object storage enviornment in the. Lacks efficient Backup and Archival.  Lacks infrastructure disaster recovery. Had. IBM Softlayer is a solid platform for supporting multiple types of workloads.  The following are the postitves: 1.  They have a solid capability to provision physical workloads just like cloud workloads 2.  You have the ability to leverage the backhaul. Time to implement solutions was very good, and provisioning new environments and deploying applications was a breeze.   That was the biggest benefit.   We were able to provision and deploy new applications, including servers and back end resources, in. Lot's of capability available quickly!. New product, cost effective,  feature rich, support and version control is in early stages. No longer innovative and agile after IBM acquisition.  Limited services compared to other providers.  Difficulty providing required infrastructure due to vendor capacity constraints. poor product support model. Expert knowledge available 24/7. Great Service. My Experience with BlueMix has been one of great value.  The vendor help provides a launching pad as well has provided valuable insights on how to deploy and operate within BlueMix.  We are currently using it for our IoT and Mobile projects and. Bluemix is IBM's Platform as a service solution leveraging Cloud foundry, this is powerful solution which can empower fast development and deployment of applications.  Overall, I am impressed with the vision, however,  the documentation is. Very flexible offering. Still early days since full deployment is later in 2016 and 2017. Our experience overall was positive when it came to the original softlayer team.  They were using more mainstream technologies than those IBM team would be familiar with.  The knowledge and skills of the softlayer team was also much better than IBM team. Had difficulties with AD integration. good to have experience. Very intuitive tools with easy implamentation, great AI services and data AI.  Data Storage services with super competitive prices. IBM cloud is the flexibility where we can order our own hardware, one of the feature that I really like about this cloud.  on the IBM cloud, best services are like Storage, servers & load balancer.  IBM cloud pricing is very flexible. My experience with IBM cloud as engineer is very good and I would recommend the use of IBM cloud services.  IBM cloud bare matel service only provided by IBM cloud provider, they are growing at a very faster rate & soon they will compete with major. I manage the infrastructure of an important customer on a dailyy basis, buyng services and HW through the portal.  My experience is positive, IBM Cloud services are stable and do not give any problems. IBM cloud is good and has 3 types of cloud services IaaS, PaaS, and SaaS. IBM meets all our technical requirements and are awayas available when we need assistance. Well Bare Metal cloud with a good hardware and capabilities. Overall its good experience for our customer to continue with IBM Cloud services. Well Bare Metal cloud with a good hardware and capabilities. Very good.  Easy to use and deploy, excellent support services. Good overall experience, with lots of available services.  However the  first level support response could have been better. IBM cloud, for me its amazing experience more then expectation after moving to IBM cloud we are relax and increasing our productivity.  due to large no of servers we were facing issues in data management and security.  this platform is extensive with. we need a public cloud that can offered multiple suites of application aimed of various busniess needs, it helps us to analytics data, oracle database platform.  it has specific tools to achieve our main security and efficiency goals.  it has easier interface with. Drive Innovation, improved business agility, client focused. the technology, compared with other cloud providers, is poor.  the technological service support is not. IBM Cloud is a full stack cloud provider which provides 170+ more products.  We can use other cloud providers also to use IBM Cloud.  We tried all the cloud providers products and out of which I found IBM Cloud more feasible to use.  Also its pricing. I can configure a flexible system as much as i build an op-remises infrastructure. Have been exploring various IBM Cloud services for many years.  Lately on Quantum Computing, Artificial Intelligence.  Previously also on Bigdata, Internet of Things, and more. ibm cloud is act as a dedicated server for my database.  most like about ibm cloud isnhow easy it is to create serverless functions, called to be an IBM functions.  its good for storage capacity and security offered to other services & applications. Overall experience is very good, hardly experienced any downtime during business hours. We are using IBM Cloud to provide various services and infrastructures for our customers.  We are happy to go ahead with it and continue to increase our revenues jointly. IBM cloud is the trusted cloud service provider for many global enterprises and is known for one of the best cloud services in the market.  The user interface is simple and easy to understand with more than 170 product and services. ibm cloud provided bundles of services including storage, api, app connect, automation and data warehouse etc. it provides many inbuilt AI related services that helps to implement some ai features in our application. IBM cloud is a next-generation hybrid cloud platform, it has advanced AI capabilities, basically we choosed IBM cloud because it has or it offers a unique combination of benefits.  it has best storage capacity and it puts package together for us.  overall. Ibm cloud software is at cutting edge of technology.  this is fully secure and gives fully confident that my all busniess critical data is safe. IBM cloud pak for busniess automatiom provided lot of functionality and fit for business use. "}