{"name":"Lumen Public Cloud","oneline":"Easy to use product and had proven very effective and useful for our business. overall good performance and reliability. offerings compare with others in the industry. cost is higher but since we were already on there network we were able to have some savings in that area. i like that its interconnected within there own network, and the vastness of the services. Project management and engineering support from beginning to end. Public cloud services have quickly become one of the more useful products out here. With the recent changes to our work environment due to COVID, a larger remote workforce has brought the realization and need for a better remote cloud solution. At the same time, penetration risks is something I have worried about with other. When we started using CenturyLink, I was nervous - I had only used Amazon and Google services prior to implementation. However, I had nothing to be worried about: the cloud is easy to navigate, and technical support has been great. Century link cloud is fulfilling the needs of huge amount of customers worldwide. It involves platform services, servers, storage and backup, application services management for smooth functioning at workplace. They facilitates outstanding. Centurylink Cloud offers secure enterprise cloud services ideal for business apps, IaaS, PaaS, SaaS, DBaaS and cloud management. CenturyLink Cloud has been an excellent solution to our web hosting and web data problems. By working with CenturyLink Cloud we have been able to focus less on our backup data and more on what we do and having our websites hosted and secure. Not impressed with getting the project started. They took two months to get the contracts correct. Once correct it was another thirty does before implementation because of the holidays. Overall, CenturyLink leaves you with the impression that it is several products taped together, but it does still work. Our overall experience with CenturyLink Cloud has been somewhat mediocre. Their solution is not as flexible as we would like it to be and the Add-On costs for Managed Services ends up being more expensive than other options. CenturyLink has been a fantastic partner for our adoption of cloud usage.Although we'd had a business relationship with Savvis prior to its acquisition by CenturyLink, we found CenturyLink to be much more challenging to do business with. The technical team was very good, and the management portal was fairly easy to. CenturyLink has a great vision and we believe in that vision. We are only frustrated with the lack of training that the sales force seems to have. They do not grasp the wide array of service offerings available and we often had to rely on our own research and. Horrible. We selected Tier 3 and were relatively happy with Tier 3 prior to their acquisition by CenturyLink. Reliability/downtime and service have gone downhill since Tier 3 was acquired by CenturyLink. We still are in transition so we are struggling at times since we are in the 'moving process'. Strong financial position and track record of results. CLC works well for our development/test use cases."}