{"name":"Oracle Private Cloud","oneline":"It was fun and great to work with the Oracle team on this. It really helped me come to grips with these services. Great job!. I have been working for 13 years in a Multinacional company in the telecommunications industry, in information technology, CRM/Projects team. I had my first  experience with Oracle. I liked its interactive environment, but it seemed a bit complicated when entering the units of my requirements for the shopping area. Very complex organization with many different capabilities. Sales tends to over simplify implementation and set executive expectations they cannot implement. I found Oracle OCI services exceedingly cost effective, efficient and robust that work around the clock seamlessly. The accessibility and availability of their services is excellent. All great at the moment, i don't know much to extend myself. I have been using this service past 15 years and found it resilient, robust and secure. totally satisfied with the services and the support. It is awesome to use oracle services and products. proper information with practical information and the paper work is also available to practice on your own with the free account available to us by the oracle team,. I want to be a professional expert in oracle cloud environment. My organization operates on very critical information and services and to secure that services we used oracle. Professional service and experience, knowledgeable staff. Best product as i can expect and very easy to manage its amazing. Your performance in general is excellent even in different work environments. Extremely good product and Service. Provisioning and patching are completely automated and eliminate manual effort. Easy to adopt and manage. Migration is handled easily with minimum downtime. Overall I'm very satisfied with the services provided by Oracle Cloud. It easy, user friendly with competitive price. The Support of Our Brazil manager is good and sometimes the, and sometimes the another Countries Support i not So good, in my opnion this is need to improve. Compared to other clouds the value you receive is a lot greater. Nice API, stable, regional support and easy to monitor. From a bare metal perspective, this is hands-down the best cloud ecosystem for our applications and services. There has been a massive improvement around integration and other core services supporting data management. Oracle cloud is a service used by my management and sales team. They use it to manage their workload and to stay organized in the fray along with forecasting sales. Integrated wire once software-defined infrastructure system that simplifies the way customers install, deploy, and manage virtual environments for any Linux, Oracle solaris or Microsoft windows application. Supports a large range of OS versions. Re-branded Oracle Integration pieces that still don't work as effectively as they should. Buggy tools that are hard to get the right information out of to fix or at least Support them. Many outstanding issues that Oracle just don't seem to be interested in fixing. A completely efficient cloud that will blow up any previous experience with a similar service. Storage and high-performance pertinence that positively rebound in your results when using this product. Extra features like computing in a networking. Cloud computing and SaaS is less about technology but increase flexibility in regards to consumption of IT solutions. The infrastructure provisioning was fast & easy and  the migration / transition from on-premise was handled well. Performance of the systems & application is as expected. Elastic environments enabled us to be more agile and flexible. And our cost model. Data Integration, Virtualization and Security issues should be guarantee prior commitment to subscribe. The Implementation properly occurred. At first we had to contain some difficulties because we were the first company around the world to adopt Oracle Cloud Machine. Currently the Oracle IaaS is working perfectly. Overall we were very satisfied. We had a set of applications that we needed to upgrade various Oracle stack components and moving into their cloud platform helped avoid that work.  We could redeploy our application on their platform and we were. For our needs Oracle was in a unique position to provide end-to-end expertise, both from the technology standpoint as well as the consulting expertise to rapidly deliver the solution.  Oracle's technical prowess and consulting expertise partnership on IaaS."}