{"name":"Oracle Cloud ERP","oneline":"We have a SAAS license.  It saves time and effort as many customized reports are available to be directly built-in OTBI--Mane EIS processes are customized to meet varied business requirements---Many Essbase reports help with detailed Accounts Analysis.  We use it for Financial operations. I mostly provided support to Order Management and WME, AR, and OTBI to users of the Warehouse (CETI) Sales and Customer service.  I used to research issues in some Orders, also to create MOS SRs, and follow up until resolution.  I also managed the Upload of the customer Catalog and help with Customers Configuration. I was working as a cyber security consultant in Oracle practice and used to recommend and implement Oracle users and roles for clients.  The scope of work used to range from implementing users, roles (Job and data roles) for multiple fortune 500 clients.  The business challenges were, clients wanted to move from legacy system to cloud and we used to perform separation of duties for them.  The product ensures security for different users in different domains. We are an implementer who also provides consulting services to other businesses.  I work as an Oracle Functional Consultant, assisting our clients with the implementation of Oracle Cloud [ERP].  I'm in charge of procurement and supply chain, as well as project space on occasion.  It's also been deployed in Oracle EBS and Oracle Cloud. It is used by the human resources department in our infrastructure and also used for the financial team, where it provides the best way to work in a highly available and reliable environment.  I have noticed it is a very good tool for them and makes life easier. We are an implementer and provide consultancy to other companies.  I am an Oracle Functional Consultant who helps our clients to get Oracle Cloud [ERP] implemented.  I take care of the Procurement and supply chain area and sometimes project space.  I have implemented it in Oracle EBS and Oracle Cloud as well. We implement at client locations and help them migrate from old, traditional ways to the Oracle Cloud ERP platform.  Implementing the procurement module along with inventory will allow users to create PO requisition and PO orders in the cloud itself and then receive them in the warehouse through inventory implementation.  Oracle Cloud ERP it's a very good tool.  However, I believe the cycle counting inventory should have a filter by the locator.  There should be a button to run processes from UI itself.  Buyers should be easy to update as they come and go. Improved end-user interface and scalability it is easy to integrate with our MIS.  I found accessibility from all devices. We implement at client locations and help them migrate from old, traditional ways to the Oracle Cloud ERP platform.  Implementing the procurement module along with inventory will allow users to create PO requisition and PO orders in the cloud itself and then receive them in the warehouse through inventory implementation. We use Oracle Cloud ERP to manage enterprise functions including accounting, financial management, project management, and procurement.  We also use Oracle Risk Management with embedded artificial intelligence (AI) techniques that automate advanced analysis for ERP role design, segregation of duties (SOX), and preventing financial fraud.  Oracle Cloud ERP runs on Oracle technology stack in Oracle's cloud centers so we don't have to maintain servers on our premises. We are Oracle partners and implement Oracle Cloud ERP for our clients.  Previously I worked for one of the largest healthcare organizations in the US and I was implementing with my implementation partners.  I have implemented Source to Settle and Demand to Deliver modules.  I have done configurations, ran CRP and SIT cycles with end-users.  The business problem mainly in healthcare is the standardization of legacy systems to one common ERP system across the healthcare environment. In this case, Oracle Cloud ERP has been used as back-office ERP and integrating different systems using Fusion Accounting Hub. Process transactions using Oracle cloud.  Supplier invoices are processed.  Customer invoices are processed general ledger is used for accounting transactions reports and analysis etc.  Assets, cash management, sub-ledger accounting security features are used to process day-to-day transactions.  Train users on the Oracle ERP module to use for business processing. The Oracle ERP was used to manage the financial, customer management, and procurement of the company.  It was easy to use and implement. This tool works great for smaller organizations, small to mid-size.  It offers many great features for an enterprise such as scalability for financial management and thorough support for users worldwide.  This software works very well with its in-line Oracle products.  It synchronizes the data on the go making it easily retrievable for all its users.  It offers great support for AP, providing a portal with excellent security features that guard all the invoice retrievals and their storage.  Overall it's a great product that keeps on delivering. Cloud storage and procurement ERP was the main business problem that the solution we were looking into to address.  We came across Oracle cloud and tried it out.  The solution worked well and was affordable.  We also got some clients who were looking into Oracle cloud as well for integration into their solutions. As a consultant I have raised and architected solutions for the adoption of Oracle Cloud ERP as well as other products both on-premises and cloud-based, and specifically more recently I was gathering information for the design of an Oracle Cloud ERP implementation in a retail company that presented huge challenges in the way they ran their financial processes with outdated applications.  During the survey process, the clear need for a SaaS solution in the cloud was detected to reduce data center and development costs, obtaining the flexibility of offering an cloud-based solution. Key use cases are: 1.  Running out professional services operations by the project - project management, time and expense entry, project financials, plan vs actuals, and status reporting.  2.  Financial operations - payables, receivables, and business accounting and books. We are partners with a company in India that had a contract with a customer.  We consulted them about business issues mainly, but sometimes we were forced to execute some queries and customize ERP based on customers' special needs.  The queries had difficulty to being written because we had no access to the description of the tables (the table's fields we not available, so we could not understand the names of the fields very easily to execute the right query. Oracle Financials is one of the most useful and helpful ERP product for banking clients.  The EPM and ERP suite together is capable to handle banking products and services provided by large banks to their clients.  For ex - Loans, mortgages data can be interfaced to easily using OFSAA.  Procurement suite again is so helpful to handle their indirect purchases which supports banking clients with their operations. We don’t use it in our organization but I provide oracle consulting services to my client.  I provided consulting services to my clients who are using oracle ERP cloud and how best they can leverage its full capabilities.  We also educate our clients on its flexibility and fit for purpose in financial accounting. Project management and project financial management. There is a big mess on the login URL for various Oracle customers.  It would be easier to use a subdomain that can easily identify the provider you're trying to log into.  I have experienced difficulties in the past logging into the correct portal.  Sometimes after you log in using the provided URL you see a different provider name.  This problem could easily be solved by using sub-domains or C-Names from the provider that resolve to the Oracle link. I work as a project manager and run an offshore support team of Oracle Cloud ERP users who use different applications like financials and procurement.  The main business of the company is contracting and construction in Riyadh, Saudi Arabia. Here in Ethiopia, Oracle Cloud ERP is the best ERP system implemented by the Ministry of Finance and plan to roll out to all public government bodies.  Currently, around 200 public bodies are joined to This ERP system(IFMIS) and being implemented. Oracle Cloud ERP gives organizations more time to focus on the business side of transformation.  Change management and business process management require the same time and resources whether you’re implementing cloud or on-premise ERP. 1) reach to fast and real-time access to application data avoids IT assistance and time-consuming data preparation and ensures accurate reporting.  2) Save time and money establishing a data warehouse or data lake in the cloud with minimal data preparation. Using ERP for financial management needs, Invoice Processing, Procurement.  Also using integrations for importing project and non-project-related\nexpenses into Oracle ERP Project module.  This Oracle ERP Cloud integration Pick data files, Import and loads data in ERP. Hello, It's been a long time I use Oracle cloud ERP.  It is a commendable platform to rely on in Enterprise Relationship _ERP and it produces tangible results which lead to a successful end.  The Bosses got happy [with] the solution and shall for sure continue to work with Oracle in various solutions.  Thank you. Using oracle cloud to Implement all modules, and support all users on oracle. Couldn't able to customize much. In today's world, the cloud oracle ERP technology enhanced the organizational business.  It will allow the end-user to use the ERP system efficiently and effectively.  Easy to use, user-friendly, [accessible], market security, latest market version, It will increase the business growth with low budget investments and security. This is the main ERP system used for everyday work all across the company starting from time cards finishing with Accounting things and even forecasting.  The product addresses a wide variety of problems helping the company to keep all information about its employees in one place and working with accounting very easily. We aimed to reduce report preparation and delivery time.  With Oracle Cloud ERP, we were able to shorten the reporting cycle and strengthen report oversight across all operating locations.  Now, calculations that we use as source for reports (and forecasts) are done much faster and we achieved the goal of delivering reports more frequently. I like the way in which we can program the function of ERP, unlike the traditional ones, since it is cloud-based, I could even access it via mobile or any other device which is a great plus. Implemented it back then in 2016 to use Oracle projects management modules for our program, but we faced some issues at the time like performance issues and not being able to create a master project plan and link it to other smaller projects. AP - post invoices, payments, OTBI tool and Scheduled Processes <br>AR - post different kinds of transactions (invoices, refunds, credit memos etc), manage cash, manag customers, use OTBI tool and Scheduled processes<br>Expense reporting - create/submit/audit/approve expense reports, use Scheduled processes. I use finance and SCM modules in [the] cloud.  The benefit of using [the] cloud is that form-based applications are no longer required.  Java dependency is finished and no need to upgrade java versions.  The application can be accessed out [of] the network easily.  The application is easy to use as it guides for the next step of action.  The option to upload bulk data through excel is a worthwhile feature and it reduces job burden. We use Oracle Cloud ERP for finance and accounting in our organization.  Compared to other systems, the drill-down capabilities and projecting your balances [are] great. Oracle\nERP Cloud is the first-ever kick of our organization.  It gave us easy support\nwith exceptional performance even at a downtime.  Oracle ERP Cloud is great in\nthe scalability of mind to help business processes i. e.  reporting, finances,\nproject management, risk management, and planning.  Oracle ERP Cloud is very\nhelpful in the financial planning and infrastructure of data for the whole\ncompany. In my company, we're using in more than 15 companies Oracle Products, and Sap system also.  We're using procurement to finance modules (ap,ar,fa,gl, iexpense etc).  To evaluate the future investment process we make in [the] next 5 years, we evaluate oracle cloud and other products.  Because it was a term investment, we start using [it] to understand the gap and match points with customers especially [the] finance team needs.  After [a] detailed and long review process we shared our feedback and future plan with [a] company representative. As the program manager at my company, I'm reasonable for the implementation of Oracle Cloud ERP for financials & SCM.  My client is a retail company [that is also] a retail partner of Samsung.  They own 32 stores in the Northeast of Brasil making them one of the biggest users of Linx POS solutions [in the country].  We are integrating Oracle Cloud ERP with Linx POS solutions as my client uses the full financials and SCM solutions to maximize their sales. The Accounting and Procurement modules of Oracle cloud ERP are used in the organization to carry out the business process effectively.  It allows the users to access the information on the system in real time and has thus far reduced redundancy and los of information within the organization.  Mangers are able to get proper reports on work done and keep track of the procurements.  Well as for me, I assist train users to understand the system as well as manage their accounts and passwords. We are currently using it for HR, Finance, Procurement, and Administration.  It's a cloud web-based system, very good, and easy to use if you understand.  But at times it's difficult to understand for non-technical guys around the office.  It has addressed the issue of paperless transactions in the office which is what every organization strives to do in this technological era. Oracle Cloud ERP is a cloud-based, all in-one comprehensive business management solution which enables small to medium-sized businesses to upgrade from their entry-level accounting software or legacy ERP system to one single, comprehensive solution that connects sales, service, finance, and operations teams to help them adapt faster and perform better. Use of manual entry to record financials.  Several legacy systems with no integration points.  Data integrity [is] non existent.  Unable to procure from reputable and cost-effective suppliers as there was no data, all manual.  Data intelligence was compiled and printed each morning for management to review.  Etc. Oracle Cloud ERP is being used in multiple departments of my organization to streamline all the budgeting of business processes.  This helps us in identifying different risks that can impact the growth of the company.  Most of the processes have been automated through this and managing the data has become easier. This is my 4th consecutive year using Oracle ERP Cloud, it was easily deployed and the support team has been very exceptional during any technical downtime.  Oracle ERP Cloud is created with scalability and simplicity in mind to help automate key [business] [processes] like planning, procurement, reporting, financials, project planning, product lifecycle[,] and risks management among many more others.  It offers us sets of dependable apps to increase productivity, enhance control[,] and lower operating costs.  Oracle ERP Cloud has streamlined budgeting financial planning and data infrastructure across the entire company.  It gives us forecast reports that uncover all hidden risks that can lead to our [company's] slow growth. Oracle Cloud ERP is a very flexible solution.  The finance department enjoys this great feature.  It helps them in reporting and computation of the transactions no matter the volume of the data entered.  I love the Task panel that makes it easy to search the invoice number.  The challenge I have is with the interface.  It's so technical and not so friendly to one who doesn't know or doesn't have an IT background. Dashboard with Accounting Infolets Manage integrated info tiles into work areas to supervise operations, track transaction progress, and detect issues and exceptions that may need addressing.  Language Support Streamline internationalization support by translating numbers, dates, names, and addresses into 26 languages.  Timely Collections The strategy management apparatus guarantees on-time collections from overdue clients automatically.  It works with days sales outstanding (DSO), broken promise count, and other collections metrics and formulas for you to better perceive the progress of outstanding receivables, productivity, and prospective problem areas.  Financial Data Gain real-time authorization to accounting information. I use Oracle Cloud ERP for building sow and contract requests. I would place an order in the shopping cart and prepare for the purchase.  This was a simple process but I still had to call people to validate that I had done things correctly.  Also, there were a few common words like an invoice and a purchase order that were confusing. We are using oracle ERP [for the] past 3 years, as an IT admin, I am so happy with their support and [ease] of application usage.  it really helps us to perform day-to-day activities in a very simple way and all my back-office tasks are automated very effectively.  the feedback I have received from my end users is so far better than the previous application I used.  no doubt oracle is the best in the industry when comes to the ERP market.  I believe oracle applications are not heavy as other ERP providers.  Oracle applications run very smoothly without [many] system configurations and are easy to use and manage for nontechnical people. The Oracle Cloud ERP was added to solve problems in the cost, manufacture área. This tool is not\nconfined to any single department rather it is used in almost all departments. \nThe major utilization of Oracle [Cloud] ERP is in our finance department where it is\nhelping us out in the management of the finances of our organization.  We can\nintegrate this tool with other platforms which makes work easier and its\nreports are quite helpful and it provides security to our data as well. [It was a] seamless integration and deployment.  [It has been] free of maintenance, [provides] easy access, [and] reduces [a] lot of human effort [for] deployment and maintenance. It is used across the whole company to make the work easier and all departments are connected . .  everything is managed on ERP and we can collect the data easier.  It's a really good database I can see all the departments from one place and I can take action according to results collected from these departments.  It takes less time to work and I can get any information anytime when I need it. [Oracle Cloud] ERP has helped us to speed up our process in many ways but I will highlight only two.  First, when applying for a leave, before you needed to obtain a hard copy from the HR department fill it and send it to your boss for approval and then [return it] back to HR.  [However, now,] thanks to Oracle [Cloud ERP] you [can] get [that] done in less than two minutes [from] the comfort of your desk.  It has also helped us to speed up communication between staff and HR. We used it during the test phase of the project implementation.  HMC management is not happy to host their data in the Oracle cloud.  So management decided to upgrade the environment to the next version instead of the oracle cloud. We use the solution for centralized procurement and financial management.  It natively integrates with other financial solutions for better visibility and reporting.  The financial module comes with built-in templates which are useful for accounting and payroll operations. Oracle Cloud ERP is being utilized across the entire organization's departments at Verra Mobility.  We implemented Oracle Cloud ERP in early 2017 and has helped us to analyze different types of data via self-service Portals.  On my end, I mainly use it to manage resources, tasks, and projects. Oracle Cloud ERP is being used by the Finance and Accounting dept along with other CRMs and BI tools.  Oracle Cloud ERP, however, manages the majority of the software load. Oracle Cloud ERP is being used across the whole organization to help manage procurements and finance management by monitoring the employee data for accounting processes. Oracle Cloud ERP is being used by the entire company.  Oracle Cloud ERP helps modernize financial information, keeps track of important data, and is very useful for employee expenses/expense payments and reimbursements. It is acceptable and exercised across organizations starting from management or executive body to each of operational as well as assistant level employees.  It addresses the quality service within the whole of the company at a satisfactory level.  Finally, I am happy to use it in my day-to-day activities. It is used in all departments of my organization.  It is very smooth and flexible in use and provides you excellent results as compared to other software—friendly software, accuracy, and easy to adopt everything in oracle. Oracle Cloud ERP is a versatile product that can handle accounting, procurement, human resource, and other business processes within the same ERP.  Oracle Cloud ERP can definitely be implemented with standard business processes across all industries.  I personally have implemented the Oracle Cloud ERP in various industries like telecommunications, hospitality, retail, construction, manpower companies, as well as at various local governments, including schools and stock exchanges across various regions.  We have successfully implemented Oracle Cloud ERP products at all Middle East countries Like UAE, Qatar, Saudi Arabia, Bahrain, Asia and Pacific regions, Australia and New Zealand, Europe, UK, United States, etc. Oracle Cloud ERP helps with sales in my organization.  It reduces costs.  It's mainly used across the entire organization.  It also ensures rocket fast service providing.  It provides wise and insightful decision-making.  With efficient database management, it gives security options that are easily accessible.  It is the best product in terms of efficiency in administration and data application tools. It helps streamline business processes as per best industry practice and opens new gates of vision for future enhancements, plus it will allow complete digital transformation. It mainly solves the procurement problems and also the financial process which almost every company has.  We had designed our process in such a way that we pay minimal tax for all our expenses using doa rules and technical setups.  We also have a wide range of reports and ess jobs developed for businesses to keep a constant watch on the data being inflowed. We use Oracle Cloud ERP in a specific department for providing solutions using ERP cloud implemented On PaaS.  We provide solutions on Finance Modules such as OM, AR, etc.  Through invoking Rest/Soap/OIC Services, we provide client solutions over a custom application for a]better user experience.  We are addressing problems that users generally face while creating/updating a sales order. This enterprise resource planning software suite is used by different teams and departments across my entire organization.  For my department, we mainly use Oracle Cloud ERP to manage financial processes within our organization, thus ensuring a dynamic and centralized accounting infrastructure.  Our use of Oracle Cloud ERP has greatly benefitted my organization in vital areas such as expense management, cash forecasting, cash management, and event-based graphical analysis of our finances, amongst many other benefits. Oracle Cloud ERP is used when the organization needs to scale its business and grow and expand.  It helps in automating manual processes, which reduces business costs.  It also helps in analytics and management. Oracle Cloud ERP is awesome and supports so many facets of our business.  It allows us to manage downtime properly and keeps us active throughout the year.  I recommend Oracle Cloud ERP to every individual, group, company, or organization, and you will definitely not regret this wonderful experience.  You'll have an amazing experience and recommend it and its other related packages just as I have done.  Cheers!. Oracle Cloud ERP is used for our client's financial and reporting purposes.  Oracle Cloud ERP allows a lot of easy integration with third-party applications.  It is easy to understand and use. It is used in one company branch, and implementation is going on in another branch.  It addresses the purchasing scope of the business stream. Used by my client across departments for their day-to-day business activity, the objective is to have an integrated and simplified financial process. We are using the software at this moment in time for finance, procurement, project management, and risk management.  In the near future, we plan to expand our usage of Oracle Cloud ERP to more fields of business within our organization.  Currently, it makes our work streamlined and easy to access through all business units.  Besides that, security is one of our main concerns, and this is covered with the ERP cloud. This is being used in most of the projects of our organization to ensure our projects are implemented according to the plan.  This system helps us with the necessary tools to implement our projects.  This has enhanced our user experience which helps us to analyze different modules of data. Oracle Cloud ERP is being used in certain departments of the organization that deal in risk and finance data.  This helps them in managing the reconciliation of data in a timely manner.  As it is cloud-based, it is very easy to work with anywhere without any hassle and handle the business in an effective manner. Oracle Cloud ERP is being used by our finance department specifically for payables and receivables, revenue management, and billing.  This helps us run, create and report all the financial data essential for the end-to-end closings in a timely manner.  Since the updates are on a cloud-based system, they are speedy and can be tailored according to the process. It was used for revenue management along with ERP and HCM, recommending and implementing the right solution, and Data Migration and Integration.  Which addressed the problem of data migration planning and key integration considerations related to specific revenue reporting needs and business cycles, and also understanding the route to automate the process to enable seamless connectivity to operational systems. My company migrated from the OeBS to the Fusions cloud in order to continuously manage the business by Oracle Cloud ERP.  Almost all the business processes are covered by Oracle Cloud ERP, except customer billing.  We've integrated Cloud revenue management with legacy customers' order management and invoicing system.  We also perform group consolidation and reporting in the Cloud. We are implementing Oracle Cloud ERP for financial, human resources, and procurement transformation for our customers.  While specific functions would be used by relevant departments, all employees would be using Oracle Cloud ERP for employee-specific functions like expenses and HRMS tasks.  The ease of doing different tasks in Oracle Cloud ERP having intuitive UI is the biggest benefit Oracle Cloud ERP provides to the customer.  This, combined with powerful reporting and analysis, is an ideal modern solution the customer is looking for. Oracle Cloud ERP is used to simplify complex tasks like managing employees, financial issues, and inventory systems.  It is used across the whole organization.  The organization has two branches currently, and both of them are managed by Oracle Cloud ERP.  It has helped us increase our productivity by enabling us to efficiently manage our company resources, especially materials in the warehouse and financial things. As a team member in UPMS gold partner of Oracle in Algeria, we use Premavera p6 pro and EPPM mainly, my role is to assist candidates of other companies, with my supervisor, whether in implementation or the use of the software, we also market the license of the software, so many companies use Premavera p6 pro desktop, hoping that they will use p6 web as much as with the desktop version before, especially with construction and engineering kind of projects, knowing that pivoting from desktop to Cloud is a big step, but it takes time and plans to do so, particularly dealing with previous databases. Oracle Cloud ERP is one of the most well-known Enterprise Resource Planning Systems, which is used by several organizations and clients all around the world.  Oracle Cloud ERP has enhanced the user experience and provided them with better expertise in analyzing different types of data in various modules.  My company has been using Oracle Cloud ERP for a very long time now in different types of work like managing account receivables and account payables and so on. Oracle ERP Cloud assisted Bahri - KSA to streamline their business processes in the following business functions/departments:1.  Finance Function2.  HR Function3.  Procurement Function4.  Business Planning FunctionAdditionally, it is used to interact with Bahri commercial systems (for Customer and Supplier transactions) through Oracle Cloud Integration tools.  It was a transition project from the existing Oracle EBS system to Oracle Cloud ERP.  This transition enabled Bahri to:1.  Digitalize business processes, especially around Support Business Functions. 2.  Enhance user experience with an easier business application interface. 3.  Enhanced experience through different Mobile Applications for the said functions. 4.  Ease of Reporting through built-in Intelligence Tools. Oracle Cloud ERP is being used by the Procurement teams.  We are using the Oracle Cloud ERP within the organization to help in between teams and project groups.  We can go with Oracle ERP Cloud because of user-friendliness, reliable service, allows real-time updates, and excellent customer support so far. Oracle ERP is being used in my company by our finance team to manage billing, procurement, and generate PO orders.  Reconciliation is too good in this where the team is able to manage reconciliation in a timely manner.  This product is fast too which helps employees to finish tasks quickly compared to others. It is being used by multiple clients across the world.  It has improved the user experience and provided them [a] better experience analyzing various data across multiple modules, which has further improved their business and helped in generating better revenue.  Most of the business[es] are connected in a better way using Oracle Cloud applications. This tool was used in one client project to manage day to day activities.  It was used in supply chain finance management and also to monitor the employee data for accounting process[es].  As it is cloud based, it is easy to use and work with from anywhere.  It automates the business process. Oracle Cloud ERP is used by the whole organization as integrated software of AP, GL, AR, FA, projects and other sub-ledger modules.  It helps the problem of storing data on clouds.  It helps in integrating all modules.  It is easy to use.  It addresses business problems of data computing. It has been a great find for us as the cloud-based program actually beneficial for us.  A clear understanding of things with\ncustomizable experience mainly are the stand out features.  Support, dashboard, and go-to guides need a lot of attention to improve the product.  Other than that, I\nwould recommend this to use for handling business effectively. It was used across all department to attend to variety of problems, including buying items for financial accounting. I consult our customers on implementing Oracle Cloud ERP across departments and organizations.  The customers have chosen Oracle Cloud solutions for HCM, Financials, Procurement, and sales functions.  It is the most advanced cloud and Saas product that brings a completely new perspective of ERP applications.  The built-in dashboards and info lets are very useful for business users.  From an IT perspective, it is very simple to manage everything which otherwise a lot of effort in maintaining and running the day-to-day operations. ERP needed for our clients to manage their internal work cycle such as billing, documentation, employees life cycle and more.  We were implementing it for our client who is big Telco.  They has very complex role and responsibilities to full fill the ERP needs. My organization moved to cloud based ERP a few years back.  This is used by multiple departments in the organizations.  One of the problems solved was that we don't to have our own servers; [the] IT hardware [doesn't] need to [be] [maintained] or [have] [upgraded] hardware.  That's a lot of cost saving.  Also, being on cloud, it enables mobility and people can access on the go, which is a necessity in today's world. We are using Oracle Cloud ERP to streamline and automate all our business processes, such as procurement, financial reporting, planning of projects, managing of products life cycle, among others.  This software is fully cloud-hosted and it's created with simplicity, great scalability, and a powerful set of tools that anyone would want to take advantage of. Oracle Cloud ERP is used by our whole company as a main platform for risk management, procurement and project portfolio management.  Some departments are using the platform also for financials, accounting and supply chain management purposes.  Oracle Cloud ERP being a Software as a Service solution simplifies managing our various enterprise operations without need of deployment in our own cloud data center. We have been using Oracle Cloud ERP organization-wide to manage our company financial transactions and budgeting.  The tool has helped us in streamlining and automating our human resources activities.  We now have the ability to achieve optimal management of the data that is needed to execute financial projects and plans. We support Oracle ERP integrations into our business development application system.  Oracle ERP cloud provides a complete enterprise suite of products, including risk, procurement, financial, and ERM.  Oracle ERP Cloud has the support of many integrations and implementation partner networks.  It also has great integrations to others Oracle products like PBCS. Our company is using Oracle Cloud ERP to manage all of our accounts receivable and payable and our entire sales pipeline information across the entire company.  Having everything centralized onto one platform makes it much easier for our Finance, Sales, and upper management to stay on top of our company's financial situation.  Having Oracle ERP in the cloud is also beneficial to our IT team so that they don't have to maintain any of these applications on-prem and continually have to update them, etc. It is primarily used within a small department within the business.  We use it for tracking options, business characterisation and data pipeline management.  It makes all the data we need to do this easily accessible which speeds up the process.  The fact that it is constantly operating allows us to have all the data we need, at hand quickly, to carry out projects related to financial operating models. Oracle Cloud ERP Financials modules like Payables, Receivables, Assets are mainly used for effective management of assets, invoice processing, reconciliation, taxes, credits, billing, and payments among other reporting features.  Payables provide automated invoice processing with features like optical character recognition and imaging.  Also provides with calculation with current tax rules during invoice processing.  It addresses the problem of invoice issues, staying current with tax rules, quick cash reconciliations, and reporting. It is being used across the United States in the Controllers, Accounting and Reconciliation departments monthly and in some countries for Finance to enter accounting transactions and close the books each quarter.  It addresses the general ledger of the organization, the financial close and all accounting entries and reconciliations. We migrated our entire on-premise Oracle E-Business Suite to Oracle Cloud ERP.  It is the only ERP system used in our company and we love it.  It has reduced our operational cost as we don't manage any infrastructure.  All the patches and maintenance are handled seamlessly by the Oracle Cloud ERP team, which gives us room to improve and focus on our business rather than focus on mundane IT tasks like backup and maintenance.  ERP cloud is heavily used by our accounting, finance, supply chain and procurement teams.  Since the system is online there is no need for separate VPN access requests which otherwise would have been the case for on-prem systems putting a heavy reliance on company network connectivity. We use Oracle Cloud ERP to house all of our accounting operations and transactions.  AP/AR/GL/Rev Rec/Tax/Reporting, etc.  We opted for Oracle Cloud ERP due to its superior feature set relative to new incumbents.  We are confident it will help us scale over the long-term vs having to switch if we grow over X milestone.  This product is primarily used by our accounting team, but also in some instances our finance team. An integrated Asset Management approach was the desired state for one of the major Oil Companies.  This includes integration with Maximo and other key enterprise systems.  We had to choose between a couple of our legacy ERP systems.  We have had success with the way Oracle natively integrates and manages our Supply Chain function in the organization.  So Oracle was a system of choice.  Oracle cloud is still new as a concept and has not seen many implementations across the globe, so we were a bit skeptical and time will tell whether the end user experience is smooth or not. We use this platform in our contracted companies for large manufacturers and factories.  Oracle Cloud ERP is a secure platform that is very important for any organization, and the larger the size of the company and the factory, the more vital the existence of ERP becomes.  From the job interview of a new staff member in the organization to human resource management, advertising, marketing, tax payment, how to distribute goods and everything you think an organization needs, wherever there are dedicated facilities, a separate module such as accounting, warehousing, clearance of goods according to need can be added to it.  Saving time, the order in the system, coordination, and integration between different units of the organization are quite evident despite this platform.  All departments of the organization are seamlessly integrated and all are managed and maintained in the cloud platform. We are using Oracle ERP to manage all our organization expenditures and invoices, budgets and to streamline and automate all HR functions.  It has enabled us to realize our financial potential and drive better decision making via a clear view of our operations and finances. For a couple of my clients/customers, Oracle Cloud ERP is being used as an upgrade or replacement for traditional Oracle EBS ERP on premises, in order to be current with Oracle and have access to the best and most complete expanded ERP functionality available from Oracle.  It's used mostly across the whole organization, and BUs, and functions as the enterprise system of record for these companies--financials are deployed and at the core of the system as well. Oracle Cloud ERP is a very reliable tool that is being used by our accounting and procurement related departments.  With this tool we are able to quickly achieve optimal management of the data needed to carry out projects related to financial model execution plans. Our organization uses Oracle Cloud ERP for many different reasons.  We utilize the general ledger and accounting features (such as accounts payable and accounts receivable, reconciliations, reports, journals), some inventory management features (though this is under-utilized at this time), standard and custom reports (which are very user-friendly), as well as API integrations between other platforms to help streamline processes. Oracle Cloud ERP is used in our organization's accounting department.  It helps streamline our accounting operations by supporting several different source systems.  It helps improve performance by decreasing errors and implementing consistent accounting policies.  Oracle Cloud ERP also generates dynamic reports that makes it easier to visualize financial data.  It's also easy to get support and maintenance from Oracle. Oracle Cloud ERP Is being used by a non-profit that we volunteer for since we're on the board of the group.  It is used to manage the entire group from financials (receiving and sending payments) to maintaining our member database to sending out emails and creating events to keep track of registrations.  It is a huge help in terms of managing all of the events we put on. Oracle ERP was selected after an RFP to serve the Procurement and Supply Chain organization.  <div>The purchasing and shipping modules were a key problem in our past ERP and the supply demand signals were not trustworthy.  Furthermore, Oracle cloud added a module for our sourcing events and to organize agreements which was not available in our previous ERP.  </div>. In our organization, as a migration team, we commonly use Oracle Cloud ERP could for data migration and integration projects.  In those projects, we extract data from and load data into Oracle Cloud ERP by using web service or FBDI methods.  As a part of the project, we analyzed Oracle Cloud ERP in depth in the initial stage. Apart from our team, some other teams in our organization use Oracle Cloud ERP for the business process management. Helps to improve ROI and available multiple features like Invoice imaging and readily available templates to load data. Oracle ERP Cloud has been used within our organization to help solve day to day issues that come with resource planning.  We also have partnered with Oracle to make sure our clients can be as happy with Oracle as we are in their on-going projects and within their programs.  The experience we've had is good and we look forward to continued use. Oracle Cloud ERP is a reliable platform that we use in all of our organizations due to its multiplicity and additional modules that fit in the various departments in our organization.  We use it to implement various business processes in our organization such as accounting, procurement, financial and revenue management, project portfolio management thus help our company in offering swift and credible services to our customers and enjoy various economies of scale that benefit our growth.  It helps ensure that our workflows are smooth and implemented without any delay. Oracle ERP Cloud is a robust Enterprise Resource Planning system with mature, flexible, and configurable software functionality to support every business function in the enterprise.  Oracle ERP cloud provides a complete enterprise suite of products, including risk, procurement, financial, and ERM.  Oracle ERP Cloud has a support of vibrant integration and implementation partners network. Oracle Accounting Hub Cloud is used in the accounting department of our organization.  It is one of a kind accounting solution that supports diverse source systems, it is adaptive to changes, generate dynamic reports, it also applies accounting policies consistent with centralized rules, and eliminate errors that might appear in the accounting process. Oracle ERP Cloud is a suite of applications that are designed to help companies and enterprises execute their various business process outcomes from a single platform.  We use the platform in all of our company and each of the department uses two or more modules in executing their functions and assigned tasks.  In our project management department, mostly we use Oracle Project and Portfolio, Financials Cloud Procurement and Risk Management a lot as they are the ones that give us visibility into our ongoing projects and help us implement the related ancillary services such as finance administration and procurement. We use the Oracle cloud for a variety of reasons.  I find the most useful is \"ERP Analytics\".  This program has allowed us to develop very meticulous reports and provide visual aids for big data problems.  Working in engineering and having a large array of techniques for our civil engineering has created an issue when trying to sort data into applicable metrics.  With the use of this asset we have found a comfortable reporting scheme that can be used by project controls, estimating, and engineering.  This product is used specifically by our company.  I can't confidently say that everyone uses it but the reports are definitely used company wide.  In addition Oracle Financials Cloud has worked wonders for creating visualizations for our monthly and quarterly presentations.  Regardless of how vague or detailed you need your reports to be, these systems allow you to streamline your financial business processes and technologies.  Imagine taking thousand of cells of data and having an algorithm find, separate, and explore trends between data.  It's a project control team's dream.  I can say with specifics that two Oracle Financial Cloud's trends have immediately changed how we do things in the field.  Discarding an inefficient method for one that has become apparently more effective and cost saving.  All-in-all the programs pay for themselves. Oracle Cloud ERP is used as a simple solution to connect the multiple acquisitions Shutterfly has acquired over a period of time.  Instead of having an ERP system for each of the organizations and connecting them, we connected the acquired companies using Oracle ERP Cloud. Oracle Financial Cloud is the cloud version of the already popular Oracle EBS solution.  It helps our clients standardize and automate financial processes. Our entire organization uses Oracle ERP Cloud for all accounting and finance functions.  It has allowed us to uptake new features and functionality on a much more regular basis.  It has freed our support team up from worrying about servers and infrastructure to focus solely on business functionality and support. Oracle ERP Cloud is currently being used in our company alongside Oracle Fusion Cloud and other Oracle products.  It is being used organization-wide as well as being sold to customers as part of Fujitsu's consultancy team.  Oracle ERP cloud does an excellent job of managing resources and is highly scalable. Oracle Procurement Cloud is used as a source to pay solution.  The client wanted to reduce the administrative tasks and automate most parts of the payment process while ensuring that all the costs are tightly controlled.  These things along with a better analytics capability was a driving force to use Oracle Procurement Cloud. Oracle Fusion cloud is being used across the organization for all business units.  It addresses AP routing and approvals, JE Routing and Approvals, Supplier additions and updates along with requisite approvals.  We also leverage the system for global and business unit reporting. Across the organization.  We are implementation partners and move customers from on-premise to OCI. Oracle Project Portfolio Management Cloud is used across the whole organization.  We track our program cost and profitability as well as the revenue we recognize throughout the sale of the programs we produce. Oracle ERP Cloud is being used across our entire global organization.  It has helped to facilitate or improve multiple global business processes.  It supports extensive REST APIs for various tasks and automation.  In particular, we have had great success leveraging the allocation functionality to automate common journal entries.  The GL allocation functionality is very different than on-premise EBS, but much more powerful if used correctly. I manage an Oracle consulting group within Bristlecone.  We implement Oracle Cloud products for end customers and we integrate these products with various other Oracle and non-Oracle products.  We work with customers from different verticals and implement industry-specific implementation based on the customer's requirement.  We do customize these products within the permissible limit and make sure they address the need. When I used Oracle ERP my focus was to use it to enter, track, and review employee expense reports.  All departments used it to track invoices as well.  I really like its simplicity of the interface and how you can easily go step by step, and go back to track your expense reports for your budgets. All the teams within my organization run on Oracle Cloud, to establish cpq to supply chain.  We launched last April, so, we've only had six months running the solution.  Oracle ERP Cloud provides us the efficiency that we need.  Our financial department provides the source information to close new projects and products. As a systems integrator, we are required to leverage all cloud providers.  Oracle ERP Cloud availability is instrumental in government agencies who have a reliance on Oracle products, in particular, the financials modules.  Oracle implementations are targeted to a small set of government agencies.  The main problem(s) Oracle ERP Cloud addresses is the migration from on-premise to a hybrid environment consisting of on-premise and Cloud. Oracle ERP Cloud is being used by some of the company's locations throughout Europe.  In North America, the company is still using Oracle E-Business Suite.  But in Europe, each location was previously using its own ERP solution.  The intent with this transition to Oracle ERP Cloud was to begin getting all locations to use the same platform to standardize processes and make communication with the US simpler. I implement ERP solutions for other companies, and it is used across client companies.  It helps them to simplify record-keeping and automate many processes that result in profitability for the client company. The collaborative planning feature is great and helps us get all participants of the project to be in sync.  We can also do very efficient scheduling tools.  Project tasks can easily be entered and classified, post which can be assigned to a person and it can be tracked to completion. We use ERP Procurement Cloud for all our corporate purchasing.  It's very simple and since our vendors also use Oracle, inter-company workflows are recognized and transactions are real-time.  The best part about Oracle ERP Procurement is the user interface, it is very intuitive and modern.  We also get a great dashboard that shows us pending tasks and a deadline option. At UBS, I work with application teams from different domains in Oracle ERP Cloud.  I also work with end users like traders, asset managers, and wealth advisors from different regions for resolving their Oracle ERP Cloud and Transportation Management related issues.  I also have knowledge of SCM cloud products, which are a set of software applications that can be used by clients to manage different business processes like order management, procurement, product management, inventory management, etc. Oracle cloud is an Enterprise-class cloud platform.  It has 3 main divisions, which are the platform as a service, database as a service, and software as a service.  We leveraged all the three components and they worked well for us.  We were using outdated disparate systems for various departments.  Some of the systems were heavily customized and at the end of their life cycle based on outdated technology.  We wanted to move on to a single platform, streamline our processes, use the latest and greatest technology and save money at the same time.  After many deliberations, we chose Oracle Cloud.  Oracle Cloud is secure, agile, comes with collaboration tools, inbuilt analytics, and is mobile and tablet friendly. We use Oracle ERP Cloud for our HR module.  In addition, we're leveraging Oracle Cloud Integration as a middleware to integrate different applications. We use Oracle Financials across the Verizon Media Group.  It is used by finance team and across the entire organization [for] procurement/inventory management.  Helps in procurement to pay process, asset management, inventory, warehouse management etc. , as the primary system of records.  It is the primary system for financial reporting and consolidation process. Oracle ERP Cloud is being solely used by our Finance department.  As our organization started to grow, we quickly realized that we needed a robust and reliable platform that can handle all of our financing needs.  Oracle ERP Cloud solves a variety of fundamental finance-related problems such as: planning finance, ensuring governance, managing accounts, managing risks, and reporting of taxes. It is predominantly used for financial accounting.  It is used by the entire finance department. [Oracle ERP Cloud] is used for internal transactions, this solves a lot of custom requirements and maintenance.  The product has most modern business processes, so there is no need for customization.  It also solves resource costs. Oracle Cloud is used by International Trade org for import and export decisions.  It is used for customer screening, product classification, import and export HTS, and ECCN number.  It gets Order and Shipment data.  It also does US customs filing for export data, and this is done via the Decartes company. New technologies arrive in our country to align with all the financial laws in Mexico.  Oracle has been developing the tool for enhancement processes in this area. We use Oracle ERP Cloud across the enterprise to support all our business and administrative functions in the areas of finance and supply chain. We use Oracle Financials across the whole organization with a user base in the US, Canada, UK, Spain, Sweden, Australia, and APAC regions.  Oracle Financials aids in the majority of our day-to-day financial activities and helps tracks our sub-ledger activities and generate reports out of our ledgers and helps consolidate data from multiple ledgers to our US ledger. We use Oracle Cloud Financials and Revenue Management Cloud to address the multi-country financial needs of our company.  Revenue Management helps us adhere to ASC 606 accounting standards. Our Accounting, Payables, Receivables, Treasury and Revenue Accounting teams mainly use Oracle ERP Cloud.  Apart from that, FP&A, Tax, and Audit teams also use this product.  It helps us from Record to Report, Supplier Payment, AR accounting, and Financial Statement generation. We have implemented and are using OTM and GTM at Uber.  We are currently on 19a Version in production, and will be moving to 19c soon. The GTM module is a great tool, catering to all our compliances Globally.  We use Descartes for Product classification and RPLS data.  A few things to be improved are the RPLS algorithm, which gives a lot of false positives.  Other than this issue, GTM is great.  The AES plugin through Descartes is great.  A few other areas that need improvements are on the integrations.  In addition to GLOG XML, other content types should be supported (JASON, CSV, etc. ). It is being used across the whole org for the financials applications.  I. E. , payables, purchasing, and fixed assets. We support the in-house users for the same, in case they face any issues or need any assistance with the product. It's being used to enable the modern best practice use and the standardization of the organization.  It's used through the organization itself throughout the people and processes. We have implemented Oracle Cloud at many organizations across the globe.  They use it as a single source of truth for their financial application. Oracle Hyperion is being used for budget applications within the Financial and Budgeting teams.  It has greatly helped streamline our processes internally. It is being used by multiple units of the organization for financial reporting and planning. We were able to leverage the project's capability of perpetual accounting to provide operational reports across the financial year.  Customers didn't use the project billing aspect that was turned on.  Assets integration from projects was another advantage that was implemented for them. We use ERP for report development and order management.  ERP simplifies the entry of orders for fulfillment.  Sometimes it can be hard to find the correct module to link the reports with, but ERP Cloud helps with that. Oracle Financials is used by our finance team for reconciliations.  My team grabs all the online transactions on the platform, and then push it to Oracle for our finance team to do the reconciliation magic! The company used different Oracle financial modules like account receivables, account payables, and general ledger to reconcile receipts with the bank transactions. Good product and easy to use. We had disparate solutions that were not integrated.  By using the ERP solution Oracle offers, we consolidated, making information extraction possible.  We also enjoy the security and dependability Oracle offers.  We plan to do more as we integrate other legacy solutions in the near future and look forward to further help with Oracle Cloud solutions. Oracle ERP and HCM are used by all departments across the enterprise.  It takes care of all our financial and accounting needs, including revenue processing, AP, procurement, payroll and budget, and planning. We are using [Oracle Financials] to be more user friendly and people friendly.  As a consultant, we help other people start up with Oracle Financials.  We work with all different industries, anything to do with the financial world.  Recently, we've worked with clients in the Health and AI industries get started with Financials. We use the Oracle Financials across the entire organization spread out in 26 countries with 70+ Legal entities.  It helps in standardizing our accounting policies and processes.  It also helps in consolidating the financials for the company and ease-of-use at the month end and year end processing.  Oracle Financials helps us with getting transactions recorded seamlessly with tight integration. It's used for our full financial process - AR, AP, GL ,FA and Cash Management.  [Oracle Financials] is very useful as it has automated all financial processes and led to manpower reduction and fast process streamlining.  Due to this we are able to close the GL every month by the 6th.  Previously this was not possible.  Complete PROCURE to PAY Process is now automated due to this Implementation. It is used across the whole organization except for core business. Across the organization and multiple BUs. Oracle helps us to provide integration supply chain manufacturing products and linked them with planning and quotes for customers and vendors, communicating better with internal and externals customers.  Planning and Manufacturing runs on the same channel according with sales estimations and reducing inventory cost, this improves our raw materials purchases and reduces cost without impacting quality for our clients. We have currently implemented [Oracle ERP Cloud] at 1 of our North American manufacturing plants as well as our corporate finance and accounting with plans to implement across all North American facilities in the next year and internationally after that.  We are using a variety of Oracle products including ERP, SCM and most recently Iot Production monitoring. We are using the full ERP and SCM modules across three procurement business units.  We plan to roll it out in North American and then globally.  It addresses the problems of financial roll up, data access and real time KPI management.  In our previous system, we did not have ready access to this and we had to talk to I. T.  about getting data and then it also took massive excel work to get the data to tell a story. Oracle ERP Cloud is latest and greatest offering by Oracle, I can tell Oracle is trying to incorporate the latest features, technology & thinking of process efficiencies and going in the right direction to deliver a best in class Cloud ERP solution.  Like previous ERP products, they do have growing and adoptions pains, however, Oracle is trying hard, and listening to customers to make it a more matured product. It was used by most of the departments and driven by IT & Accounts team. We are a consulting company and we implement ERP Cloud for others.  Solves back-end processes by streamlining actions. Payable, Purchasing and Order Management are our teams that use this.  Helps lead others to implement for financials and procurement. We are currently using Oracle ERP cloud for accounting, general ledger and reporting.  The biggest problem that we currently have is Oracle Fusion does not support the expense allocation rules in our organization.  We are currently still using our Essbase On-prem specifically for allocation purpose.  Another problem that is not too crucial is the fact that Oracle Fusion does not have the same recurring journal entry set up functionality as the Oracle on-prem where you have the ability to create a batch of recurring entry, use different rules, and post the recurring entries every month as one batch. Currently we are in what we call phase 2 of Oracle implementation.  Phase implementation started in Nov of 2015 and accounting was the first department on boarded.  Currently that is the only department using Oracle ERP.  I believe our HR department will be in the phase 2. We are currently replacing all of our financial systems with Oracle, part of that will cause us to shift from the Clarity PPM tool to Oracle.  There are 11 total entities that will migrate onto this new platform over the next several years we are leading the charge on the first company going live on this platform in early 2020. Oracle Cloud ERP is fabulous for financial planning and controlling costs and spending.  Organizations should have this tool to improve their processes and measure the results of resource management.  It is fabulous for any organization. We are using it for managing editorial input functions.  Also publication releases and invoicing.  Takes away the manual labor side.  Moreover, it is functional in the manner by which is keeps employees managed and tabbed properly.  Oracle ERP is a powerful tool that has helped our small organization become better at what we are doing which is publishing. Oracle ERP is an organization wide initiative that will touch multiple entities across many business lines including our; Information Technology, Insurance lines, finance, hospitals and diversified business lines.  We are implementing ERP, Supply Chain as well as Financial Modules.  We currently have multiple processes leveraging multiple tools that are not all easily integrated, our goal is to streamline and simplify by leveraging Oracle software suites. My company is an implementer of Oracle ERP Cloud.  We help clients move from EBS or help them fast track to the Oracle Cloud.  I work in SCM and Procurement specifically.  It provides an integrated procurement solution and also a self-service requisitioning solution for organizations. We are currently in the process of implementing the Oracle Modules we have purchased.  We are trying to transform the company in the areas of finance and supply chain. Oracle Financials (AP,AR,GL) modules are being used by finance accounting and the fraud and forecasting team in my organization.  They use it for transaction details and financial reporting purposes.  Our leadership team uses it for daily status and transaction reporting. Our organization is replacing the Oracle EBS on-prem with ERP Cloud.  ERP cloud will be used as the platform for all financial operations of the company once it is implemented. We use it for GL, AP, FA and all apps for financial reporting. I have used Oracle for more than 20 years, on-premise and cloud.  The functionality keeps reducing and the user interface is becoming more un-friendly for users.  The basics, which are an asset for Oracle, are disappearing. Oracle ERP Cloud is only being used in the financial services department which services the entire organization. ERP Cloud is being used by our HR Department. We currently use Oracle ERP in our supply chain finance dept.  I am also sure it is being used across all finance functions at the company.  Right now it is a great tool to help address the consolidation of our financial reporting, as well as helping the overall team with the reconciliation of our finances. Although we are just getting started with using Oracle ERP Cloud, we plan using it for all of government to help us deliver services to citizens more efficiently and to gain valuable information that drives decisions.  We're in the design phase and have seen some training.  These trainings have gone well.  We're working with a consultant from Oracle to get their Oracle university training in person.  Next is planning the rest of our implementation. Oracle ERP is replacing 3 accounting systems.  OFSAA is replacing the enterprise data master.  The biggest benefit is to standardize data and source finance, treasury, and risk information from the same source.  Oracle won out over SAP due to its penetration in the financial services industry.  We did not feel that SAP bank analyzer was as mature or supported although it was less expensive.  Cloud was selected to diversify infrastructure and reduce the dependency on IT operations. Oracle ERP Cloud is being used by our Corporate Accounting department and IT department. It is used across the organization taking care of all company needs.  We are using Oracle Cloud because it makes things much easier to maintain and support instead of having the applications on-premises.  The cost of maintaining is very good compared to the on-premises tool.  We are happy with the service. Oracle ERP Cloud is used for financial reporting, accounts payable and reconciliation, and project management.  Most of the problems are just performance-related. Currently it is being utilized by our Supply Chain Management and Finance groups.  Supply Chain uses it mainly to track production throughout our manufacturing processes.  Since we have many outsource commercial manufacturing organizations it is important to know which of our goods are at each location, and also the quantities of each on hand.  We also like the visibility into each organization to see down to each lot level of each stock keeping unit we have.  We also use it to create and maintain new purchase orders.  This helps us give clarity into which accounts are being hit for each work order that is being performed by a vendor.  It also is helpful in seeing how much money is left on a purchase order, and to see each specific invoices have been processed.  This leads into where finance also works with procurement module because they approve and create each purchase order.  They also use it for cost accounting but I am not an accountant and do not know the specifics behind that.  We are also beginning to move towards implementing our own manufacturing module and demand planning. It is being used across the organization.  Used for supporting integrations within risk management. We use Oracle ERP Cloud for our Finance, Billing, Taxation, Financial Governance and Business Intelligence Reporting.  I am responsible for implementing this software for our India and Middle East offices.  I also manage our relationship with Oracle globally, so I'm giving feedback with their team regularly.  I browse the system for new features to make sure I understand what is available to my whole company and how we can be implementing everything to best benefit our company. I've used Oracle's ERP for 5 years and have helped save 15% of our procurement spending.  The implementation was the hardest lift.  It took about 15 months to get off the ground. It is used by my department (IT).  Oracle ERP Cloud keeps things organized and moving forward.  We use the risk management part of the software, and it allows us to categorize and manage all risks. Oracle ERP Cloud is a good product.  We use it for our financial applications with SAP. It is used for accounting applications and reporting and analytics.  It helps us in addressing various business problems which are mainly catered to business needs including end-users and management.  The basic data entry of the journals, approval process, allocations process, and global consolidations are some of the features that are worth mentioning in the review. Our company provides private cloud infrastructure solutions - my function is to pair Oracle DB & Apps with Supermicro hardware then take the products to market.  I consult with our customers, mainly Oracle & SAP users, on their hardware selection.  My business unit is focused on developing these solutions for our customers. Oracle ERP Cloud is being used by the entire organization.  It is used by Procurement, Accounting and Sales.  We are using Oracle ERP Cloud as the backbone of our business to automate processing and streamline our business. We use Oracle ERP as our primary solution for procurement, AP, GL posting, and orders processing.  Oracle ERP Cloud is the primary source for sales and renewals.  And, we integrated Oracle ERP Cloud with Oracle Business Intelligence Enterprise Edition (OBIEE) for analyzing monthly and quarterly sales data. Our customers use it to run their business, which is Public Sector.  They are using Oracle ERP Cloud to reduce the cost of running their systems, and to take advantage of the SaaS model of consumption.  They have retired multiple custom systems and consolidated onto ERP Cloud. We use for IT as well as in the whole organization.  Usually, we face issues with the load in the back end and also try to resolve the issues for the application team. The product is being used across 36,000 employees across the UK.  It is being used by one main central government department and a smaller entity.  The products looks to bring together HR and Finance to provide one source of the truth to enable planning and business decisions to be made.  The product is currently rolled out for financials only and HCM is due to be released later this year. Oracle ERP Cloud is an innovative business software that is designed for use in all businesses irrespective of their size.  Its cloud based and built and designed with modern business thinking where it amplifies, enables and streamlines all operations in a business.  We use Oracle ERP Cloud in our company due to its simplicity and applicability in a number of business areas such as revenue management, accounting, project management, procurement and financial reporting among others areas and functions.  The software has helped us a lot in managing our operations, lowering our operation costs, improving our workflows, ensuring financial accountability and helping us realize economies of scale and beat competition from our rivals. It is used within the organization to help in the organization between teams and project groups.  It is a reliable service, everybody likes the fact that is such a friendly user program and allows real time updates.  I recommend the use of Oracle ERP Cloud and the customer support has been excellent so far. We use this product to communicate real time data through the planning, manufacturing, and logistics department. ERP Cloud is used across accounting and finance and provides an integrated solution to previously disparate systems. I implement Oracle Cloud ERP for various clients. Depending on the module, the various modules will be used by our appropriate resources. Reports are typically not only leveraged by related departments, but by management in business operations and those responsible for making business decisions. The reporting typically has replaced a manual process that required resources to compile accounting data and distribute it.  Users can now access ready-made reports that have real-time data and flexibility for reporting. We use Oracle ERP Cloud for automotive distribution, warehouse management, accounting, and financial reporting.  Cloud applications are used by approximately 400 users. Our finance and accounting departments are heavily relying on Oracle Cloud ERP.  All employees use the system for Procurement and expense recording needs. Used for financial reporting and cloud services. It will be used to drive efficiency and add value.  Reducing on prem assets and having a more secure system will drive value.  Additional functionality will include more efficient procurement activities with procure to pay.  Punch out capabilities can also be used to save time. Oracle ERP is being used by the Procurement and Legal teams. We use it for mainly for procurement for datacenter infra and to some extent for our hardware products procurement and supply chain.  It is efficient at organizing data and giving quick reports.  It is a well designed system.  Though we had issues to implement, it went well after initial hiccups.  Prototypes were good. Oracle Cloud is used in demand and supply planning as well as procurement departments.  We are running on-prem Oracle applications for other business departments.  We are planning to move other departments Oracle Cloud, especially in PLM area. Used across the entire company.  I currently used to support the purchasing and sourcing processes. Several ERP Cloud Products are used across multiple GE businesses in various aspects.  It addresses problems around optimization. We are in process of Cloud Fusion implementation for the entire organization.  We are currently integrating 3 legacy ERPs into Oracle Fusion. We are currently implementing.  We will be supporting the finance functions with Oracle Cloud - starting with Core Finance across 21 properties in the US. We have just started our journey on the Cloud with Finance and we are in the process for Planning, HCM and OTM and expenses in 2019 and procurement and inventory 2020.  \nExcited about the final product at the end as we have all info flowing in one place and no need to work on multiple systems to address reports, sales, inventory and so foth. \nwe are able to reduce some of our manual journal entries, automate bank reconciliation and looking forward to reduce more in the future of those manual journals. we are in the process to implement Oracle Cloud in the Fuel Division at FEMSA and move from EBS Oracle application. \nThe decision to move to the cloud its a very disruptive move within the organization but will bring significant improvements to our finance department. We are using it for P2P process.  Monthly close process. So far we have rolled out Oracle ERP Cloud to two of our locations in Europe.  We have quite a few subsidiaries throughout Europe—each of which have used their own ERP solution in the past.  We are working to standardize the ERP system, so we will have a common application being used for all of them. Oracle ERP Cloud is our only accounting solution currently and it supports right now 12 different legal entities which we administer as a parent company.  We have simplified all the administrative work of the different legal entities by unifying everything under the same roof.  It has solved a lot of issues since we are using Oracle Best Practices for our company processes.  And it has simplified IT support because it is a software as a service solution so we do not have to maintain the database or the servers for this application.  It has enabled users the ability to work from anywhere they have Internet.  And we sleep well at night knowing our data is secure and backed up in Oracle's data center. Currently, we are using Oracle Cloud for sourcing events, contract negotiations, contract management, self-services requisitions, purchase orders, and AP/GL processes.  Currently, this is being utilized across our organization as a single self-service procurement tool.  This allows our business owners take more responsibility in their spend process.  By truly having self-service, businesses can follow their spend from contract to procurement to payment.  Although this allows our business to see the whole process, we still have encountered areas that wish to not take ownership. Consolidating 5 companies on 4 disparate GLs into a singular ERP solution.  Trying to eliminate redundancies and inefficiencies.  We are currently deploying the AP portion, attempting to consolidate into a Shared Services organization, and demonstrate leadership to the rest of the company.  From there, the AP tool will feed into our Oracle shell GL and then into the disparate GLs until such time as we consolidate.  We are just at the beginning stages of our journey. We are using Oracle Financials to support business operations and street reporting. It is used throughout the organization - GL, A/P, Procurement, & Fixed Assets.  [It] Allows us to have integrated workflow and GL and financial reporting. We use Oracle Cloud’s procurement module for all of our buying needs across the company. We use Oracle for our entire accounting, finance and procurement department.  It replaces our old on premise system (Great Plains). It is used across the organization: order entry, purchasing, shipping, inventory, and accounting. The key reason of investing in EBS was to boost our business efficiency and smooth operational activities.  EBS has an excellent exposure with different multinational groups.  They offer several products with the same terminology which helps users to integrate, if you are using more products of Oracle.  You are open for ideas.  If you want anything can be added, even those which were never part of Oracle. We use Oracle Financials in the Cloud for our corporate ledgers.  After failing to move from on Prem Lawson to Cloud the Oracle Financials implementation supported by Oracle Consulting was a smooth process.  We have not been up and running long but our users are getting more comfortable with the system and are appreciating the ease of use. Service business processing for the whole organization, on modernized ERP.  Simple implementation, lot of features, update possibilities, friendly UI, real-time analysis, great reporting, fast processing, excellent security controls, easy to understand interpretations with enabled help, exciting personalizations, comfortable ESS execution, Shared Services Center, Easy payment disbursements, phenomenal subledger accounting options and rules, great General Ledger experience. Oracle Financials is being across the whole organization. Oracle Financials is used as our book of record for all financial transactions.  It is used as our internal reporting tool to the business unit leaders for monitoring their annual spending and revenues against budget and for drilling into the details that make up those balances.  We also employ the travel and expense module that staff use to get reimbursed and managers use to approve reimbursements. Oracle ERP Cloud hosts our PeopleSoft solutions; Campus Solutions, Financial, and HCM.  While cloud hosting does absolutely have its benefits and provides relief to our infrastructure, it is not with out its issues.  At times there appears to be disconnect between our company and Oracle Managed Cloud Services (OMCS).  Many times they are implementing bugs to our system which cause major issues for our users, but no resolution can be found.  We just have to learn to live with it. Oracle Financials is used across our entire organization. Oracle Financials Cloud is used within large division of the bank, used for all of GL processing and top-of-the-house reporting. We are a large decentralized company that needed to improve our financial management situation (AR, AP, and general ledger) and automate as many processes as possible to eliminate mistakes. Oracle Financials Clouds is being used by our business partners that [work] directly with clients.  It is linked with Salesforce and Oracle Financials.  We hope this will assist our people with reporting their client experience and also keeping tracking of all expenses.  Oracle Financials will assist our marketing partners keep more accurate accounting of their travel expenses and business expenses. Oracle Financials is used primarily by the Business Control (Finance and Accounting) department.  It provides our local management reporting and is used for our budgeting/planning tool.  We also use it to perform our reporting to our Parent company.  It addresses our needs to drill down to lower level data while reporting at a higher level. We use it to track costs and bill customers for project based work. I use Oracle Financials for all financial management from requisitions, to vouchering and interface to assets.  General Ledger income and expense, budgeting, tracking of all monies.  Grants are very important to the organization and we track NIH and many types of grants and research, that is half of our main effort.  We are expanding to mobile inventory, travel, and expenses.  Its been a long road to get everyone using this new product, its been installed here almost 5 years.  We added to the product connections, through interfaces to other applications such as fundraising, patient payments, annuitant payments, vendor invoices, and recently laboratory interface.  We utilize the workflow approval process and have expanded to a successive chain of approvals, based on accounting.  Being a healthcare organization, security is very important and don't expect to go to the cloud anytime soon, there are too many unknowns and HIPPA is very important to us. Entire organization.  It is being used as a platform to simplify our overall back office processes and provide opportunities to automate. We use Financials for our corporate holding company and one line of business.  It provides the consolidated financials for the company and the operational activities (payables, expenses, journals, etc. ) for one of our lines of business.  We are also currently expanding our AR capabilities to additional business units. The Account department utilizes this the most.  The sales team gets to use it sometimes but very infrequently.  This helps track the customers who are actively ordering products from us.  It helps us view the relationship with our distributors and how we get paid.  Sales interacts with this software when a customer is involved a problem has occurred, such as an overdue invoice that has not been paid out. We use JDE's SaaS offering.  It has solved a major infrastructure problem for us in that we no longer have to worry aboutt either application or technology life cycle management, and can scale the JDE ERP offering as users migrate to consolidation target instances from legacy instances. We are deploying it at one business unit with the aim to roll out across all the companies within our company.  The primary goal is to use it for optimizing ERP and SCM operations and eventually try and bring on more modules as and when we compete the phased rollout for each department. It is used by the majority of the organization.  It solves the problem of having too many disparate software programs that did not effectively link finance with manufacturing. We have used FAH for our analytical reports, which was easier to create in FAH environment than building in traditional reporting tool.  Cubes and other tools were very useful. Financials system of record (Accounting) and Supply Chain (Purchasing, Inventory). It is being used enterprise wide for all departments. It is used for processing POs and invoices.  We also use the system for RFPs for external vendors. It addresses needs like tracking invoices, relating those invoices to the issues POs.  Approval by various approvers in the departments and then centrally approved. Across the whole organization, it is being used mostly for the financials part, (GL, payables, receivables, cash management, etc. ) the order management, service contracts for customer orders, install base for customer products, purchasing for the whole organization, inventory and work in process for a few items.  It's also used in HR. Users all across the organization are making use of most modules. Oracle ERP Cloud is used by the customer service team, logistics, accounting, procurement, and manufacturing [teams] for several tasks and information.  The customer service team which I lead uses the Oracle ERP Cloud platform to process all the orders for our customers, check quotes and pricing, and also to track inventory and logistics. Oracle Financials is our main ERP system for all of our financial accounting management.  It is a heavily integrated system which allows transactions and operations data to flow from our work management, inventory, procurement and HR/payroll systems to accurately record our corporate finances.  Oracle Financials allows us to tie together all of these various figures which create the bottom line for the company. Our organization worked on open interfaces (inbound and outbound interfaces) and conversions in Oracle Financials.  Understanding business flows, underlying technical architecture and the table structure of the Financials suite helped in managing assets and their tracking.  It also helped in financial accounting and business intelligence. Oracle Financials being a collection of enterprise resource planning (ERP), customer relationship management (CRM), and supply-chain management (SCM) computer applications is used by our business operations department for revenue reporting and transactions related to investments. Oracle Financials is used across NCI in three different business segments.  The components and the coating business segments use the complete order to cash and procure to pay modules.  Most of the modules that we use at NCI are out of the box modules and we only use customization for manufacturing modules. It is currently being used by the revenue team in our finance department.  It is used for sales booking and revenue reporting. I'm a training consultant and have worked with my client who uses some of the ERP apps to provide their customer orders and to track their travel expenses.  They opted not to use Sales Force automation (I think it was the cost) but wanted to give their field sales reps the ability to track orders and enter their expenses as they occur or while at a customer visit.  Having this application in the cloud avoided the expense and time it would take to host this information via the data center.  So, this particular example would be a department application with cloud services used to manage the data and database computing environment. Oracle Financials is being used by the Finance department for the preparation of financial statements and accounts payable.  We use it for the preparation of the financial statements for the RESP plans that we manage as well as for the corporate entities.  Through some recent customizations, the investment accounting group is also using it to summarize all of the investment transactions received from our custodian. Oracle Financial is used to support the Global Operations of the company and is currently being used extensively across more than 20 countries.  All the operations including both Supply Chain (Order Capture, shipping, purchasing, inventory management, etc. ) and financials (invoicing, collection, taxation, payments, deduction & settlement, costing, cash management and treasury operations) are performed and tracked leveraging Oracle eBusiness Suite. We use Oracle ERP to manage our business operations.  Oracle financials' key modules are used by all our centers across the globe.  The beauty of oracle financials is to manage localisations requirements in different countries.  The eTax module is a great asset.  The open architecture to plug and play has helped us immensely.  Flexibility in setting up the ledger, reporting ledgers and consolidation is fantastic.  Had Oracle provided good looking and easy to build reports in a modern UI, no one could have imagined to look for another ERP. Oracle Financials is used throughout the Emerson organization and is our primary enterprise management software platform.  In my department (and in similar departments throughout the company), we primarily rely upon Hyperion Financial Management (HFM) and its Excel add-in, Smart View, for all of our reporting needs.  As a supervisor in the Financial Planning and Analysis department of Emerson's largest division, we use HFM and Smart View to retrieve and consolidate information loaded by our business units and world areas.  Although HFM apparently has the functionality for report generation, we rely almost exclusively on data manipulation and analysis within Excel for our deliverable needs. "}