{"name":"Oracle Cloud Infrastructure (Gen 1) (Legacy)","oneline":"Love the ease of usage for its application product.  However, it will need a lot of catch up with other Cloud providers due to limited features.  There is also lack of forums / help due to the popularity of the products.  Good thoughts to integrate machine learning for ODA but some of configuration can be templatized further for business self-service. Oracle cloud infrastructure provides many services and products as an integrated set with a high end technology.  The system support and peer community for this product is also very highly skilled. I am work on different cloud infrastructure services, currently Oracle Cloud Infrastructure (IAAS- Infrastructure as a service) work on last 8 months.  it is being used to upgrade from our current system to Oracle cloud. In today's date in our company all testing and developing environments run on Oracle cloud(i. e Web application,database,Monitoring servers etc. ). Back in 2016 we started evaluating the Oracle Public Cloud (now called OCI Classic) with a Proof-of-Concept (PoC).  This PoC consisted mainly of Exadata Cloud Service (ExaCS), compute, storage and network connectivity.  The positive result of our Test-Cases gave us momentum to start a project in Apr-2017 to migrate our global Datawarehouse & BI solution (GloBI) to the Oracle Cloud for one of our internal customers (operating entity), our Partners in USA.   Since then we faced many challenges (see next section for lessons learned).  In mid 2017 we moved from OCI-C to bare metal OCI.  Currently we are in technical Go-Live since Jan-25th 2019 and aim for Business Go-Live by end of March 2019.   We had a couple of lessons learnt for this project: (1) Cloud is not just a fancy new technology, but also a paradigm shift for the whole organization.  Extra care when assembling the project team is needed.  It takes people both internally and from your key partners/vendors (here: Oracle) who need to really have the right skills for Cloud deployment endeavors especially when being faced with a comparable complexity as with this project.  (2) No massive change in the application architecture at the same time when deploying the application in the cloud.  Our application stack is pretty monolithic, hence we decided to lift & shift the application as is to the cloud, any further application refurbishment (containers, serverless / immutable server instances, loosely coupled micro-services, user access only from layer-7 protocols etc. ) will now take place in a second phase.  (3) OCI definitely delivers the necessary flexibility and capabilities for deploying enterprise-grade mission-critical applications like the our global Global data DataWarehouse. Performance & ease of Use through there was lot of learning & training.  it is great value for the investment & good for medium to small companies . In the company I used to work for, most of the infrastructure is on premises, the cultural shift to cloud based systems is still in progress, so since we renewed the User Licence Agreement with oracle, we received some points to be used with Oracle Cloud.  I as a DBA immediatly started using the Infrastructure as a Service feature (IaaS) and created some linux machines in no time and starting installing Oracle Database.  The installers were alreade in the filesystem and the server was available in about 1 hour.  the only thing I did not like is that ASM was not compatible (at the time)  with IaaS, I had to use filesystem for this databases.  We inmediatly started using this server as a development enviroment.  Our dev team was really please to have the server delivered so fast. The product delivered what was promised.  It provided us the flexibility in handling compute based instances which is quite rare in an IaaS cloud type.  Best part is the cloud UI hosts all essential features required for a  beginner. Technical support is very satisfactory.  Performance is good enough to meet our requirements.  Oracle provides very scalable solutions. OCI is revolution in iteslf.   Easy to store database, easy to maintain.  backup , recovery and Patching is easy as breese. We are migrating all the Enterprise databases and applications to OCI, its really great to start with our EBS and retail applications. We started our major Cloud migration work around end of 2016 as part of a new strategic direction to spend more time on innovation and expansion of business rather than keep-lights-on.  Goal was to shut down our entire data center.  Calling it as a migration project is a big understatement; it is a Cloud Transformation.   We wanted to get rid of multiple legacy solutions, migrate applications and enhance them with faster software development, easier scalability, application monitoring, better security and ease of compliance.   We had planned to migrate our primary application (EZSystem PoS), all its subsystems, back-office applications like PeopleSoft and Hyperion.  We have been successful in accomplishing these goals and continue to make progress.    Now we have a full insight into how the EZSystem application is performing and have already made numerous improvements due to that.  Early on we had difficulties, particularly on the networking aspects and trying to obtain the same level of control and visibility.  We also had learning to do and adapt.  We were pushing Oracle hard on several of these features.  It seemed at that time that we were always on their next release.  Oracle brought in their product management and technical teams in full force and heard us.  At times we even asked for less members to be present!   Glad to say that we have now done this Cloud Transformation and also introduced CI/CD processes in software development.  We have bought other Oracle services such as API Management to make enhancements.  It is a vastly different set of capabilities than what we had.  We believe we are on track to a 70-30 model of Innovation to Maintenance rat. The sales and technology teams have been outstanding.  We've had multiple on-site meetings with prospects and customers, which included Oracle staff, and that has made a significant difference in our speed to market and prospect comfort levels.  This has enabled us to quickly address prospect concerns while also providing internal comfort to our on technical teams to accurately address those concerns. We were first Oracle EBS customer on this platform.   Oracle team went above and beyond to get us on their platform.   . We used to implement security (Role-based access control and other security tasks) for our clients.  The company used to purchase Oracle Cloud Infrastructure as a cloud solution for their legacy migrations.  I was a cyber cloud architect for our team.  The product was used to address financial systems such as ERP, which Oracle Cloud Infrastructure supported. We use Oracle Cloud Infrastructure for WAF and CASB in one of my client environments.  The scope of the use case is to have a product in the cloud and not on-prem.  This works well with the management of cloud WAFs. We use oracle constantly for our expense tracking needs.  We have set up a process to expedite the approval and coding process.  This has helped us save time organizing receipts and expenses to validate amounts. The Finances department uses the Oracle Cloud Infrastructure for accounting and managing the expenses of the organization.  It is a non-profit organization that makes the most of the platform for creating sandboxes to automate processes for monitoring and running reports.  The platform is essential for small to mid-size organizations, with many user-friendly features.  The business team is satisfied with Oracle Cloud infrastructure, which gives them better visibility of their products on hand. We help clients set up Oracle services in OCI, including database servers, GoldenGate MA configuration, deployments, etc.  One of the problems I have with OCI is the lack of a data center on the west coast (I'm in Canada).  Toronto is the only choice, which makes some of our clients on the west coast suffer.  We have one client out there who planned to use OGG on OCI to replicate transactions, but due to the network constraints, they ended up using in-house OGG instead. We run test/dev environments in our Oracle Cloud Infrastructure Tenancy.  We test implementations of various Oracle stacks like - Oracle Databases, Oracle E-Business Suite, Oracle Weblogic Suits, etc.  We perform version upgrades, run migration scenarios, and take notes of the issues we face.  This gives us advantages when we perform the same for our customers so we already know what to expect and how to mitigate these issues. we use multiple [Oracle Cloud Infrastructure] compute instances, block volumes, object storage, VCN aggressively for our multiple customers.  Many of the customers have already moved their DC to [Oracle Cloud Infrastructure], also a few of them uses [Oracle Cloud Infrastructure] as their DR solution. Use oracle cloud infrastructure to host our in-house product application business customer-facing software as a service application.  The application uses computer instances that are hosted in the network and use the storage, which consists of the DataBase, logging, and bucket.  Cloud infrastructure reliability and speed into the next level, even though there are multiple cloud providers or I can help us to integrator requirements with the help of their team be very able to migrate from an on-premise solution to Cloud within days without affecting their business.  We take security into consideration very much and are very able to integrate the best of security, compliance, data handling guidance, protection of privacy of our customers, logging and all the government relations at all geography to be set up at the best places that are actually provided. You can utilize the cloud infrastructure if you have CX customers where you can automate processes and allow customers to give feedback. We use the Oracle Cloud infrastructure to move the entire data center to the cloud.  Critical services have 24/7 availability, guaranteeing the SLA of our clients.  We improve connectivity by reducing energy costs within our offices. \nThe migration process was transparent for the users, migrating the virtual disks directly from our Vmware infrastructure. We are using Oracle Cloud Infrastructure for running the dev, staging, and production environment of multiple services.  We use VM,Kubernetesservice, and database services for running the majority of the application.  The benefits we have seen are highly available, scalable, and robust infrastructure at a low cost as compared to other providers in the market.  Oracle Cloud Infrastructure provides direct support of Terraform which helps our infra team to create and scale infrastructure quickly. We are using Oracle Cloud Infrastructure for the deployment of applications and migration of existing applications and databases to Oracle Cloud.  Oracle Cloud has helped in saving infrastructure costs to much extend. I do consulting for an IT services company and advise them on their clients' Oracle infrastructure, including Oracle Cloud Infrastructure and Oracle databases.  I recommend the implementation of management and monitoring tools to perform analysis and recommendation of different actions to better the operation of Oracle implementations for production environments of clients. We have several business applications that need to reside within the geographic boundaries of a country, we were looking for a HIPAA Certified cloud provider with a fully operational data center in that specific country, luckily, oracle did have a cloud data center in the country.  It was our first experience with Oracle Cloud, we needed a few virtual machines with network security, VPN, and load balancing and backup, oracle cloud did provide the needed for us and it was overall a pleasant experience. Improves dynamism and time to provisioning in highly changing environments.  In addition, the benefit is obtained economically by being able to provision computing units in a flexible way both on-demand and automated.  On the other hand, being able to deploy virtual machines in lift and shift mode is tremendously convenient for infrastructures that have a very strong dependency on legacy systems. Amongst many other reasons, we use OCI for its low price of computing and storage, for the possibility to use this database service as pay-per-use.  This means for a small project, or projects with a short life span, we don't need to pay a Database License in advance.  Even the flexibility of the Cloud is applied to the cost of a database license. I use Oracle Cloud infrastructure for VPN and Web hosting platform for the company website on Linux servers. We use OCI mostly for education and testing Cloud technology.  Creating VCN, compute shapes to simulate environment and situation which is interested in us.  In that way we can which is the cost of using any resources like ingress, egress, VM in the state when is stoped or minimal usage.  Very good for that situation. Oracle Cloud Infrastructure is used to enhance excellent cloud hosting services.  The platform ensures that all the networking across the entire company is effectively managed.  Since we deployed this product most data transfer challenges and security for the information we used to face have been rectified.  We have managed to have peace in our workflow processes since this product monitors all the work processes throughout. Cloud Infrastructure was particularly useful for storing several iterations of different simulations and helped put them in a localized area that didn't necessarily require remote access software.  The cloud was so fast and not only stored and managed all of our simulations but provided a fast area to run them as well for when analysis and calculations were quickly needed for a new iteration. It was used as a DR for an Oracle DB solution to the main site. Oracle Cloud Infrastructure is an effective cloud platform that is being used in certain departments of my organization.  The environment provided is pretty secure for storing and sharing data.  The most loved feature is the data and analytics part of it.  Also, the reports are stored safely in the cloud. Oracle Cloud Infrastructure is an excellent cloud platform and provides a lot of effective functionalities.  This is being used in specific departments of our organization.  This cloud ensures safety and reliability when we are sharing different data or information.  This enables us to manage the data easily and helps in performance improvement. We are using Oracle Cloud Infrastructure for all our services.  Storage latency is always below 1ms.  There are some network limitations that require good planning before it is too late.  Using Resource Manager made our life easier [in terms of] creating OCI infrastructure. In my previous project, Oracle Cloud Infrastructure was used to host the client's sensitive Red Hat Enterprise Linux applications and databases in a hybrid cloud.  The on-prem bare-metal oracle VM provided a high level of elasticity and on-demand scalability, which is exceptionally suitable for our high throughput environment. We are deploying NGFWs such as Palo Alto and Fortigate in Oracle Cloud Infrastructure for our customers.  It is being used by all departments.  It addresses threats prevention, traffic control, traffic inspection, segmentation, and visibility in the cloud. It has been used very lightly, mostly to run very small Oracle Linux VMs. We currently use Oracle Cloud Infrastructure (OCI) as the back end of our non-production/Dev/QA environment.  We run an Oracle Enterprise Instance with 100 PDBs.  This configuration allows us to the most cost-efficient way to run a large number of Oracle DB non-production DBs and comply with Oracle licensing terms. It's a highly powerful load-balancing tool and the best cost analytics platform.  Oracle Cloud Infrastructure provides us with capabilities to effectively use multiple autonomous databases and threat detection functionalities, which allows us to keep our customers' data very secure from cyber threats.  Data analytics using Oracle Cloud Infrastructure is excellent. Oracle Cloud Infrastructure is a fairly new program at my company, as we test various cloud storage applications.  My company is working to store audio files for therapists at other companies and be able to assist with scoring their progress for training purposes.  We hope to find a platform that works well across companies. Oracle Cloud Infrastructure is a powerful and effective cloud solution that allows application developers to easily deploy various applications by managing potential data from customers in addition to personal data.  Oracle Cloud Infrastructure is a great platform known for its reliability worldwide by many different companies and industries for the excellent services they offer to their users. It is used to enhance infrastructure across our organization.  Our workforce team can maintain teamwork since they work from a centralized location to enhance the improvement of performance.  It helps us to analyze data from different sources and plan for our operations.  The great platform keeps our internal reports on the cloud safely.  It offers a secure connection environment for faster and more reliable cloud deployment. Excellent cloud operational platform and the most effective data scanning system.  Oracle Cloud Infrastructure configuration experience is [a] perfect and easy option with effective functionalities.  The cloud environment provided to the customers is secure and reliable [for] easy sharing and transferring of different data and other various information, and easy data management. Oracle Cloud Infrastructure has excellent network monitoring ability, which effectively manages network traffic, providing [an] excellent experience to the users.  The cloud capabilities that are offered by the Oracle Cloud Infrastructure system [are] fantastic.  The performance easy monitoring functionalities are also useful, and data detection capability with Oracle Cloud Infrastructure is the best. In my organization, Oracle Cloud Infrastructure has been used for cloud computing.  The tool is heavily leveraged in my department to provide us flexibility in computing power via virtual machines.  The scalability enables the users to call the instance size based on the work needs and significantly improves efficiency. We use Oracle Cloud Infrastructure to manage users and groups and provide Abs access management.  We previously used another cloud platform; however, we have found many good services with Oracle Cloud Infrastructure and thus, migrated our users to it.  We are still working on the complete migration set up from the former cloud to Oracle Cloud Infrastructure. We were working on a POC for data mining, and we needed a lot of computation power at a decent cost.  Oracle Cloud Infrastructure helped in this regard since it's reasonably priced and very easy to set up and get going.  The interface is also quite simple and would not need much training to get started. [Oracle Cloud Infrastructure] is used by [our] organization for evaluation/poc purposes as of now in one of the departments.  We are targeting to use computer container services to deploy and modernize infrastructure.  We are also planning to lift and shift our CI/CD process to [Oracle Cloud Infrastructure].  CI/CD we are targetting to put over computer services on Kubernetes cluster. Our company is the Partner of Oracle.  We use to provide support and sell oracle product.  We do work related to optimisation, audit , security, consulting for Oracle products. Oracle Cloud Infrastructure is used by most of our clients.  It saves the clients maintenance on server and infrastructure [and] it's easy to move, lift, and shift.  Services are very good for customers to move from on premise to cloud.  Monitoring [and] ease of scalability are very good for OCI.  Security capabilities, ease of connectivity, [and] maintenance makes OCI one of best cloud services available in the market right now. Oracle Cloud Infrastructure is really helpful when it comes to the computing part and we want to scale up our infrastructure.  [It used to be] so painful, like procurement of hardware resources, [but] setting them up is getting done with ease. Oracle Cloud Infrastructure on-demand services like dedicated instance on-demand, provisioning of new resources as per the demand of business or load on the application goes up is quite handy and easy to implement.  The documentation part of how to set up quite easy to understand and implement. The use of autoscaling group to automate the entire infrastructure is quite extraordinary feature and also avoid any kind of human errors and manual intervention. We implement Oracle Cloud Infrastructure for our customers--primarily APEX on Autonomous Database and object storage. We are managing clients' environments.  We are a managed services provider in the EMEA region.  Some are running B2B apps, some are tuning CRM Systems and insurance and health apps using containers. My organization manages a lot of processes outsourced by our clients.  We use a lot of Machine Learning based solutions and require cloud infrastructure to support it.  Since volume of requests keep on changing dynamically, Oracle Cloud Infrastructure provides an economical and convenient way to scale up the operations to meet the increased demand.  This is being used for backend operations of lot of processes. Historically Genpact used to maintain their own hardware in data centers which was expensive and maintenance cost was high.  With this recent switch to Oracle Cloud Infrastructure, the performance has improved and the costs have gone down.  Further, we can now focus on our core work. We are using [Oracle Cloud Infrastructure] across the whole organization.  Our legacy systems are running out of date.  Most of our legacy systems are pretty old and single instance of failure without High Availability and Redundancy.  And Performance is degrading. Oracle Cloud Infrastructure is being used to support our Oracle Production and Test environments.  It's being used across our whole organization.  The main business problem addressed is the affordability, scalability, and reliability of our Oracle environment.  The Oracle Cloud Infrastructure products allow us to easily push out patches, assist our users, and scale up when needed - all at a great price!. We're implemented Oracle Cloud Infrastructure for the services that needed to be always on initially.  Nowadays, Oracle Cloud Infrastructure is being used across the whole organization and being used by different departments and offering different services.  Oracle Cloud Infrastructure allows to implement local and remote services, both providing a zero rate failure of these services. Both block and object storage are very useful to our business and our business needs.  Oracle storage has several options and can support a number of our use cases.  It is important for us to have some storage which supports NFS file systems and others that are not structured.  We mostly use the basic tiers attached to our VMs but sometimes use higher performance options. Our entire organization is using Oracle Cloud Infrastructure (based on requirements).  In our project, we worked on creating a new design for an application where we are moving our existing solutions to a cloud environment.  We already have limited usage of [the] cloud.  Now we are working on the enhancement phase of our application, where Oracle Cloud Infrastructure can perform much better than others, comparatively.  We are working closely with Oracle-based products like Java andOracle Cloud Infrastructure Storage.  Using OCI gives more confidence when it comes to performance.  We also planned to implement RPA solutions to make the process effective. This system, in general, was implemented for the company to maintain order with the amount of data and information.  As a food company, we have too much information regarding sales & customers.  We have had favorable results using their service since we can keep our data safe.  It is extremely spectacular to maintain a single structure where we can enter and search for the information we need or simply save that data safely and securely.  It is a system that is implemented all over the web. Oracle Cloud Infrastructure is used throughout my organization.  We are working on many financial clients like banking and insurance, where data and security is utmost important, and we also need high computing power to access these/interacting with the on premises network.  I am currently in a project where we need to move/integrate on premises application with some client application. My Banking Customer have migrated from legacy on-premise infrastructure to ORACLE Cloud Infrastructure OCI. In fact this is an Oracle SAAS (software as a service) offering / implementation: end-to-end right from infrastructure, virtualization layer, Operating System, Application Server (middle-ware tier), Orchestration, Database, Core banking solution (Oracle Lending product) as been delivered.  Customer is delighted because of Consumption based pricing model which is very much cost effective and reliable when compared with any other Cloud provider in the market. We used Oracle Cloud Infrastructure for our project, including Oracle Autonomous Data Warehouse.  It's always easier when you are using existing, on-premises Oracle applications to migrate into Oracle Cloud Infrastructure for higher performance and lower costs.  This addressed reduced cost, high performance, high availability, security, auto patching, backups, and easy pathway to upgrade applications. Have used and also currently using OCI Compute for testing, evaluation and deployment of different software.  Definitely handy to use with a variety of distros in the service to deploy software across various versions to test and evaluate software.  Always free cloud compute is easy and fast to setup and very beginner friendly. We use Oracle Cloud Infrastructure Compute for spinning up Linux and Windows Server instances to provide development, preproduction, and UAT environments for the individuals to test their web applications to ensure they're working correctly, enhance production delivery, and create instances without worrying about infrastructure. OCI offers multiple types of storage - Block Storage, File Storage, Object Storage.  We use all these storage services based on the need.  These are being used by all departments within an organization - kind of shared services.  Block Volume storage offers up to 30K IOPS which is higher than most of the on-premises servers.  IOPS can be decreased or increased based on the need and required performance.  Also, block storage can be encrypted to meet multiple compliance requirements.  The business problem that can be solved with block storage is to improve application performance.  File Storage solves the problem of shared folders and plays a key role in HA applications.  Object Storage is cheaper than competitors and provides durable storage across the organization. I'm using Oracle Cloud Infrastructure to create POC (proof of concept) for different solutions and services in the projects I'm currently involved.  I usually employ the Free Tier offer to create one or twoOracle Databaseinstances, and also volume storage and compute instances to install and configure the components I need to test / demonstrate. Oracle Cloud Infrastructure is used by the user profile and product catalog department of my company's e-commerce arm.  We adopted Oracle Public Cloud to deploy Oracle services like Java Cloud Service, ExaData, etc.  in the Cloud. Since JCS is Oracle's SaaS extension to reduce the complexity associated with deploying and maintaining enterprise Java applications, we decided to deploy in Oracle Cloud Infrastructure to ensure a better and seamless vendor service. We host all our Oracle PeopleSoft instances on the Oracle Cloud Infrastructure.  Earlier, we hosted them on the Amazon Web Services.  We moved to Oracle Cloud Infrastructure due to the cost-effectiveness of the Oracle Cloud Infrastructure.  The Return on Investment has been great with Oracle cloud infrastructure compared to the AWS.  We also host many of our customers on Oracle Cloud Infrastructure and provide managed services. It is heavily used by our company.  Being Oracle Partners helps our customers migrate to OCI and implement their solution. Oracle Cloud Infrastructure (OCI) is used across our organization to host our IAAS and PAAS resources and hence reduce the footprint of physical servers.  Scalability and the speed of provisioning resources was an issue before but are no longer a problem with Oracle Cloud Infrastructure (OCI). Our company is using Oracle Cloud Infrastructure as our main Infrastructure, as a service solution for the majority of our products.  Oracle online services high-level APIs enable us to control operating systems, storage, and deployed applications, without managing or controlling the underlying physical cloud infrastructure hardware.  Finally, all services can be provisioned completely on-demand, over the Internet. We provide a fast backbone for hybrid clouds.  OCI is part of our hybrid cloud solution. Oracle Cloud Infrastructure Container Engine forKubernetes(OKE) is used for some of the R&D related, non-customer facing workloads including applications for AI / Deep learning training in the cloud (OCI).  It is currently not used for consumer facing application workloads as our use is recent. We're evaluating for the technology platform, and are currently limited to the eval stage.  We're looking to move the Technology stack to Oracle Driven Tech. We use this for multiple products and I use it to work on the Oracle Analytics Cloud - Essbase product.  It was really good in terms of updating/upgrading products.  We don't need to do anything as everything will be taken care of by Oracle.  But, the UI should've been better for Oracle Analytics Cloud - Essbase. We started using Oracle Govt Cloud Gen1 as a pilot since it's inception and we were very new to this cloud environment at the time.  We had significant issues using Oracle Cloud Gen1.  Also, due to lack of support from Oracle and lack of understanding from our staff, we had to cancel our efforts to pilot in the cloud.  Our experience was very painful and we decided not to use Gen1. Moving forward, when Oracle introduced Gen2 cloud it looked very promising.  We are in the process of getting Oracle Cloud Gen2 for piloting a few applications and based on our experience will decide to migrate the rest of the apps. We are evaluating IAAS solutions, and we were interested in Oracle Cloud. Currently, we use OCI for hosting our BI-related applications.  All our data warehouse and BI applications are hosted in OCI CLassic.  Applications are in OAC.  Our BI apps are used across the organization on a daily basis and are critical for month-end and quarter-end reports.  It is a centralized data warehouse loading data ETLs from different boundry systems. We are a shared service provider to other agencies.  We have an existing on-premise environment in our data center and are migrating to an OCI-based cloud environment.  This gives us the flexibility in scaling up/down our environment and to make rapid changes based on our customer feedback. It's used for quantitative model data processing, and has solid support for our use cases. It is used to put the Oracle HTTP Server for our POS.  It's used only by the IT department and specifically by the channels section.  The problems we have include the permissions on OHS configuration files using OPC users.  Also, Oracle needs to make a GUI for administrating instead of always using the commands.  Sometimes we have unknown issues sent to support and are solved by only restarting the server. We are using for migrating Oracle SOA app to cloud.  My role is as Database Manager.  We are using this to centralize all products in one place, so we don't have to install multiple on-premise infrastructures.  We have test and dev instances that we can bring up and stop as needed. Oracle Identity and Access Management is the single system being used in our company for all identity and access management related uses.  It was internally deployed for all application accesses and providing employees the needed access to the applications.  It is being used by all the managers to provide access for their teams and other users to have access to the internal company applications. We use Oracle Cloud Infrastructure Compute to test and give recommendations to our clients.  Also we use Oracle Cloud Infrastructure Compute inside the company to practice and build laboratories with our team. My organization planned to migrate from legacy systems for better scalability, faster development, better compliance, and robust security.  Initially, we had issues with networking during set up.  It's a perfect cloud interface match for existing PeopleSoft systems.  The pricing model is very cost efficient and easy to understand.  It took some time to get trained, but once on board, it was a smooth ride. Currently, we are using the OCI for ourPeopleSoftUpgrade Manager (PUM) and ourPeopleSoftdemo databases.  We are evaluating the network set up and firewall rules we can apply to the environment.  We are planning on putting all our non-prod environments into OCI. PeopleSoftis an enterprise application so for testing, it will be used across the organization as well as for DR/BC in the future.  For our business, we are hoping it will be cost neutral and provide easy provisioning for our environments as well as scalability for our non-prod environments. [It's] Used internally to provide access to Oracle applications for all our consultants for development, design, training, demo, and pre-sales work. We are using Oracle Cloud in development environments, production environment for internal applications and demonstrative and proof of concept environments.  Mostly I like its actionable insight reports and customizable dashboards. We are a small consulting software services company that implements custom APEX applications for the Romanian market.  We use Oracle IaaS for our developing environments and also for some of the production environments.  Usually, these are internal applications for 5-20 users on an Oracle stack, but not only, we also have someWordPress/Drupal instances running on Oracle IaaS. We are using Oracle Cloud IaaS across the whole organization to deliver new products for clients quickly. \nIt really helps avoid the need to procure additional hardware in order to initiate projects. IaaS (Infrastructure As a Service) is being used to upgrade from our current ERP system to the next one which is entirely cloud based.  Our servers(web, application, database, monitoring servers etc.  )will be maintained on Oracle's cloud infrastructure.  Whether this will be a pubilic or private cloud will depend on type of environment, stake holder's involved and facilities offered for both these clouds. "}