{"name":"Oracle Cloud Infrastructure (Gen 2)","oneline":"The overall project took much longer than I expected, however I think it was worth it.  I do like a lot of the new features that come with the cloud console that make it more automated and easier to do tasks whether it be patching, adding ssh keys, running. The Product delivered on all promises made.  More important, we deployed OCI without an integration partners and through part time engagement with Oracle experts.  We did a dry run together with Oracle, figured out prerequisites, developed. Our implementation of Oracle Cloud for our PeopleSoft HRMS/Portal workload went really smooth.  We were able to provision servers in Oracle cloud promptly without any issues.  Oracle cloud offering for setting up Network/Storage/Load balancer. Oracle's OCI service is a good up and coming cloud offering.   While not offering the number of services of other cloud providers, the things they do offer are great for supporting other Oracle SaaS based products.   The offerings are all stable and highly. Oracle is a well known key vendor in financial space, where when moving product into cloud it needs to think of flexibility to integrate or allow toolsets which it is has some, need more improvement, specially with managed PaaS, integration with third party. In 2018 we migrated to OCI Gen 2 From OPC.  The xp was very clear and transparency.  We didn't have important or blocked issues. My experience with my vendor and interaction was hugely positive, they are professional with their approach and saw that the issue is properly addressed with regular checks. OCI provides data encryption and controls that protect customer data at rest and in transit.  Developer services, like Oracle Rest Data Services, APEX,  Interconnecting OCI and Microsoft Azure: In our case, it was decisive that we seamlessly could connect. My experience with the oracle cloud environment is little, but i can say it is very positive because I help in the managment of our enviroments in my current company and i have a positive history is solving doubts and support with the support of the. Moving from on premise to the cloud provided a great improvement in performance, scalability, security and availability of the application. Oracle Cloud Infrastructure is a cloud service offered by Oracle Corporation.  The services that are provided by Oracle are network, storage, servers etc.  and these services are provided by web based portal on On-demand basis.  It also offers. We choose Oracle Cloud (OCI) after we ran into performance bottlenecks while running Oracle DB on AWS VMs.   OCI provided excellent performance and features with Exadata Cloud services, though their IaaS offering leaves some room for. This was an amazing experience and journey with OCI.  They came up with some unique products which has helped me and my organisation to adopt some enterprise level solution. Oracle Cloud provides the compute, storage, database and platform services for organizations to setup there infrastructure on cloud.  It is a competitor to the market-leading competitor, Amazon.  They are continuously innovating and adding services. Public cloud service provided by oracle is easy to understand.  And we have effectively migrated our BCP from AWS to Oracle. Oracle Cloud Infrastructure is a cloud based service offered by Oracle that provides cloud infrastructure as per organization's needs.  They follow cost per use rule for billing where the user has to pay only for the resources that is being used.  Though. My overall experience with Oracle cloud is really great, it provides us flexibility to host our application, instances, databases etc.  Oracle cloud services are not so difficult to use, it provides high performance.  The support team are excellent in their work. Although I am not a customer of Oracle per say, I have experienced these products and service on or work platform.  Products and Services are flexible and adaptable whilst adhering to Governance, Security and Industry Standards.  I have and am. oracle has provided high availability innour kast 3 years expetience and has been resilient. Products are not often not very visual appealing but can get the job done.   Products also seem to be often overly complex for certain tasks. More flexibility on infrastructure like bare metal and VM compute machines.  Since not many services are supported out of the box, we need to deploy them on VMs and manage the same.  This gives us more control on the services but at the cost of. Oracle provides technology for data driven digital transformation.  The free license for developer has made it possible for expanded user community with deep knowledge of the products. Overall i had good experience working with oracle to implement those product in the oracle cloud. The capabilities are top notch with a great technical support system. It was incredibly straightforward to evaluate Oracle Cloud using their free forever product.  Without purchasing anything I was able to get familiar with the tools and workflow implementation of Oracle Cloud. Our Oracle cloud solutions are running well and are stable in operation.  We choose this platform to get a scalable solution for the future and we feel we have reached that goal. We conducted a successful prove of concept before we signed on with Oracle cloud infrastructure (OCI).  Oracle support team is very professional and knowledgeable.  We have deployed a large business system in OCI in 6 months including system. Oracle is a powerful tool which allows me to organize my data efficiently, accurately and more secured.  The data is being used in the running of the the daily and weekly procedures in the organization. We were able to migrate all our databases from on-premises to oracle cloud, with in schedule time.  Moving to Oracle cloud saved good amount to bank. Oracle Cloud Infrastructure onebof my best experience to use services.  OCI are provided Storage,Network, Servers on cloud with VM.  Oracle Cloud Infrastructure offers life free. OCI/OKE has vastly improved the past 2 years.  When we first compared OCI/OKE with AWS/EKS there were some gaps.  But, Oracle has closed those gaps and is a real player in this market. There are some great capabilities available in OCI that would help to develop and deploy advanced solutions in a short time to market. Generally very satisfied with relevant features and evidence of continuous improvement over time.  Excellent developer tools for flexible customization of solutions. thank you!!!! It was a great experience.  We learned so much.  Thank you everyone for your help.  loved it.  we would look forwrd to doing it again. My overall experience was quite good and the user experience is much more simpler and developer /sysadmin friendly compared to other cloud services. OCI is a very robust plataform with many unique features, especially when it comes to database and application infrastructure.  However, it lacks a little more tools for migrations between clouds and Tenant management. The product was and continues to be outstanding in the Cloud.   However, the service was lost somewhere along the way where there is not one source to help clients navigate the more complex landscape. The product is overall good.  Mostly this is an oracle cloud product.  Oracle is always leading in the ORacle database wherein it is always beneficial when you have a database along with Cloud setup with oracle.  It has good support in terms of. Excellent training session and customer support from Oracle.  Overall the cloud provides one platform to integrate everything. I have used this product in the our organization.  This was the first experience in a cloud product. Gen 2 is revolution in Oracle Cloud, helped in addressing various infrastructure and application challenges after migrating to Gen2. I work with support analyst of infrastructure, with others competitors cloud services of Oracle.  I see the ease in using Oracle Cloud  in a company. Overall experience has been engaging, but it is a lot to learn.   So many places to find information makes it a little difficult to get to wheat you need, but the team is there to help guide. Oracle has been an excellent partner in our move to the cloud.   They have worked with us directly and with our implementation partner to steer our projects to success. Fantastic course.  This helps people to progress in their professional technical advice to client needs and requirements. Excellent and highly resilient infrastructure and real time technical support. Migration was a large datacenter lift and shift with databases.  Overall smooth, Oracle heavily support their product envelope. We have experienced outages lately due to known issues which have taken far too long for RCA.   This is unacceptable for a contract of this size. OCI is customer focused.   Great project implementation.   OCI went above and beyond.   The project had challenges, but OCI stepped up and helped to resolve them with me.   True partnership.   This was a high risk move, but it went flawlessly. Outstanding broad set of products and services.   Great knowledgeable and responsive support.  Easy access to try before buy. Oracle has been very easy to work with.  The technical capabilities are outstanding. Oracle Cloud Infrastructure is a highly reliable and efficient service that can be used for various workloads.  It comes at very competitive pricing and is also available in a free version for evaluation purposes.  It is really easy to use and can be set up. I have worked with PCRF Oracle and I had all support needed when I it was necessary a response from Oracle. Oracle has been a pioneer in data science so I am delighted to use their services. Have received very good service and support.  Main area for improvement is developer services and product capabilities.  We are multi-cloud, and in these areas OCI is lacking.  However, they have been a great partner otherwise. Very good experience.  OCI proved its reselience and stability. Great experience with project at our org.  with the Siebels systems (CRM),. Overall experience is good - high availability and control of server and network capabilities all in one place. need to improve on billing.  the portal, services and features have made huge improvement in last 2 years.  a strong competitor to all other clouds. very impressive product and service these days i suppose.  oracle database has been there for quite along period of time. From a technical standpoint Oracle has always impressed & they have not failed to deliver.   They have improved their cloud offerings & posture to enable more customers to come on board. I want more Oracle experience.  Right now, I do not really use it for work, but I want to be able to. Very productive hands on experiences and great experience work with the representatives!. One on one customer service was excellent.   Oracle has many siloed divisions that do clearly integrate causing delays in getting issues resolved. Great customer experience.  Great experience using dozens of Oracle Cloud PaaS and IaaS offerings.  Come along way since on-prem world. My experience is pretty good! Since the first contact to CSN until today.  The production environment of the company is in the OCI and is attending our expectations. This is a new platform for our company and I was directed to this site for some fundamental training. Session was overall good and I got hands experience on VBS.  We also learnt how to propagate catalogs from different environments. evaluated PAAS solutions Visual builder, process cloud, integration cloud and they have all capabilities to build a web application. In my case, i had been operate cloud services for three years. Having good public cloud capabilities but still there are certain services based on traditional infrastructure, opportunity to enahnce the capabilities on security and avoiding depenecies on their native services to consume manadatorily. I habe been using Oracle products for over fifteen years.  Mainly the database and the Java language. My company is oracle partner network.  I work for post sales oracle product hardware dan software. excellent support to implement cloud solutions. Strong technical partnership and board engagement. Oracle team is supporting ours in definitions and knowledge transfer, to design the best architecture that fits our internal processes. So far so good but with the additional training, I am sure my experience shall be better. We use some oracle tools like ODI and SOA SUITE but these sometimes become hard to configure. The mais reasons of my ratings are based on our customer's necessities and other support's demmanded services. Overall OCI is evolving faster.  Their support is generally ok.  But lot of products on the platform are still under roadmap. Very good and very responsinve in most ways and ver best to deliver education online!. OCI Gen-2 Cloud infrastructure is working very well.   Autonomous Database services are apt and efficient.   I am sure OCI will continue to beat customer expectations. Oracle is a reliable and safe company to work with a critical system and now many companies to prepare to move to the cloud so I need to prepare and certify for this change. In the general use I appreciate the product.  The documentation and information is great.  I think in use more and after the time take a new assess. Best ERP oracle product and cloud architecture in OCI easy to managed the compute,storage,network,security. Good value.  Natural evolution of our Oracle Infraestructure by moving to cloud services and getting the best out of our on-premise licensing. I am happy with the overall experience.  Whether it is the learning path or the exam procedure. I have worked with oracle technology since 15 years ago i have excellent experience with all products. OCI Services are compatible and easy to integrate with my services.  securely safe for data and information also. OCI provides stable services.  The administration console covers the main configurations and features. In addition, Oracle has been close to our technical team. Oracle is the best Database Service Management Provider, Good Stuff. Overall this has been a very good move for HNI from a managed partner.  We have more stability and visibility into our infrustructure. Access to further learning, the customer focus, innovation, seamless integration, ease of use and simplicity on learning curb. OCI is cloud service platform that allow us to construct and execute various application in a highly available  and high performance environment. Yes, I have attended with more responsibility to involve with vendor. I found a great solution for Cloud, simple console and many features that help in business development. It's good idea for the training course.  That will bring everyone to know Oracle Cloud Infrastructure Product and services. I have good expectations.  I want learning more about oracle cloud. We have multi-cloud platform composed of OCI, AWS, Azure, and GCP.  Regarding OCI, we use it for development, testing, staging and production environment.   Especially OCI is very powerful and provides all the necessary functions for the public cloud. A good course with a good team.  It is a lot of documentation and a lot of information to process in a few time. oracle cloud infrastructure provides the best performance available in the market, optimal performance and lowests cost. I think so the Oracle Technology is the best at the industry. Multiple database sp and good to be used as to backup. I like treinament OCi because it's easy implementation. Overall experience positive and efficient, combability with existing products, provides multi-cloud solutions. Good experience, learning a lot about OCI.  I'm gonna keep improving knowledge in OCI. it covers the course content and good for beginners who wants to follow OCI, valuable details covered in the course. Oracle sets the bar for a secure, enterprise-grade experience. gr8 experience with Oracle since 2005 I am working on oracle products as Jd Edwards. very good cloud infrastructure is easily understood and flexibility. Oracle is the best tool to save and use data efficiently. we dont have any problem  the configuration is easy and provides free training. Satisfied with the products and services.  Oracle has always taken the developers and administrators to the learning journey and kept them updated using their upto date documentations. My experience is excellent, high quality service and an intuitive experience for its users. there is overall satisfaction on oracle product which is reliable and experience very less part failure.  The support and service is also good and proactiby basis. Very good,  the architecture of Oracle Cloud Infrastucture is among the best in the world. Indeed an outstanding product which fits into the customer needs. full service upgrade, but configuration and maintenance is cumbersome, complex and pricing structure needs simplification. Good experience, specially there support is excellent.  Keep up the good word. The terminology used in Oracle can be quite confusing and it is not intuitive to use. we have a very good experience for our iaas service.  good support. Good products, less support, not many experience, so i start learning about. Great experience and value for money.  Competent technical team to suport us in our challenges. no problem on ongoing since deploy and updates are recurrent. Excelent service .   We implemented since 10 years ago all BRM , Siebel an AIA. In my opinion, it is Generally satisfied, but the UX is inconvenient. Exciting, outstanding, industry-based, advanced technology. IT expert for my company with only onpremise experience. To tell the truth I don't have enough knowledge about recent Cloud Computing. Enterprise services and complete solution platform with a price tag. very supportive team to work with That made a difference to go ahead. This vendor is performing good.  Not giving more troubles. Excelent services on Oracle cloud.  I need capaciting for certification. The second generation OCI is easy, robust , secure and efficient platform to host your oracle database, weblogic server.  It's enterprise grade features and functionalities let you migrate your on premise data very easily.  You can can configure WAF to let your. I'm beginner and i would like to master this technology. - Easy to use/ integrated and managed in Oracle Cloud Infrastructure  - Good support from oracle team   -  Relatively fully integrated services. system integrator and security guarantee, it is cost effective. good.  Some of the services need improvements like AWS and azure.  Overall satisfied with the services. higher data stability and easy operation is best of best. Because attention of this partner in critical moments and solve solutions. Great, very reliable  in all the modules which we have been using. Gleaning timely insights from our massive data streams has become a huge challenge, impacting key business decisions, WIth Oracle's AI / ML powered autonomous database and analytic cloud service we gained the ability to perform faster, deeper. Good but certification type very hard.  any thing not possible to write this coloumn. nice and beautiful uncomparable experience lovely interface and catchy controls. Great experience, the security and ease of use, stood for me. Very good experience learning oracle cloud infraestructure. Excellent cloud service especially as PaaS.  Performance oriented databases (SaaS) having unique feature of vertical scaling with zero down time of database. Excellent.  The technical team was good at what they were presenting. We commissioned the infrastructure on Oracle Cloud within a week, throughout the week, the Oracle Cloud Architects provided knowledgeable and competent suggestions to guide us through our first implementation. great, thank you for making a great product and your services. NATURE OF WORK IS GOOD, BETTER USABLITY, IMPLEMENTATION IS INTRESTING. Our experience with Oracle services has been a very positive experience as a result of exceptional customer service and a wide range of products that enable the right mix of solutions for our company. I believe OCI's various products and services are very stable and work really well.  Their relationship managers were quite enthusiastic and supportive.  We didnt particularly like their insistence on long term contracts.  Also the number of product offerings is. Ease of operations, good support from the OCI team, having multiple options wrt service offering which enables to manage TCO within budget/limits. Oracle OCI environment is scalable, secure and add capabilities to our organization quickly to support new services for our customers.  Oracle teams are flexible to accommodate our changing needs. advantages : cost savings and flexibility disadvantages : poor service request, poor invoice process,response procedure. have some knowledge of AWS clouds and Oracle clouds. Oracle Cloud is immature compare to other cloud service providers.   The SR process is horrendous - every action seems to fall back by default to submit an SR and needs a manual process.  The default limits for Oracle Cloud are set so ridiculously low -. Smooth migration to OCI Gen 2 provided by the Oracle consulting team for this migration from Ravello to OCI.  Stable connectivity and up-time after go-live. We have migrated from other major Cloud provider to Oracle Cloud Infrastructure(Gen2) during pandemic. Our Migration process was smooth and within no time we achieved our goal. Our experience with Oracle cloud has been hassle free.  We too have the very supportive hands of local Oracle office personnel who extend their fullest support as and when needed. We were walked through the transition in at the perfect pace, the partners worked with us very transparently on getting he right solution in place. Oracle Cloud's technology and engineering teams have become our trusted advisors.  They first studied our business, understood our problem areas, analysed the initiatives and they proposed their cloud technology offerings that best fit our growth. Good and spontaneous  support provided by support team as well as product coordinator and account manager, easy to use, good documentation and online help. Overall it was good experience.  Right from selection of the service, soft provision /  sizing of the infrastructure.  Also technical expertise at every step was good. the performance is satisfactory and I look forward to the UI continuing to envolve.  please translate the manual into multiple languages. We have deployed OCI platform to run Oracle and non-Oracle applications.  The platform and the team that supports the environment has been great.  Very much on the ball and ready to help.  Our challenge has been with Oracle ACS service, which. I love the support we are getting from our vendor.  They are always there to support us and happy to answer all our inquiries and requests. We migrated our entire DWH to ADW & use OAC for reporting.  Great business advancements and best decision we made!. Till now what we wanted got it from here.  Very Secure for DR and easily manageable from Data Analysis point of view.  Managing the operation is quite automated. It was a good experience overall and the solution is stable, not many issues been reported after the deployment.  The only issue we had is the response from support which takes some longer time than we expect apart from this overall experience is. we have configured our corporate websites on OCI and overall happy with the compute security network architecture of the platform. Oracle Source Satish is very excellent resource to be utilized to maximum.  He has amazing energy and intelligence.  I love to work with and his commitment to deliver. Not bad overall.  However, the method and know-how are not sufficient when using the product.  and it seeems inexperienced Thank you. Oracle Cloud helped us go through the pandemic by providing us reliable cloud infrasttucture and able to launch our cloud based solutions. Oracle as a whole provides good support to us when we need clarification or guidance on how to proceed next whenever we need help. Oracle Cloud is general good as expected but experience the latency issue until the relocation to Japan in Nov.  We are happy for the follow up work by Oracle to push the relocation working with US team. Great platform with exeptional support.  This platform gives the funtionality for easy on-prem migration to OCI platform. OCI gen2 has given us a fullest experience on cloud infrastructure which enabed us to go to the next level.  Excellent performed infrastructure with lot of value added services. Pros: Very stable infrastructure and very good performance with affordable price.  It allows the use of oracle rac databases.  Very good customer support through customer success team Cons: Services oriented to their own stacks, e. g.  there isn't postgres. The service is resilient and the support from the regional teams was always excellent.  Documentation is also very comprehensive.   The management interface is a bit confusing, and there are several necessary features not existing or still in. There are still certain areas that need to be improved as rated from above capabilities.  Apart from that, there is nothing to add. In terms of convenience, I would recommend Oracle Cloud to anyone who seek hassle free operation.  Cost benefits can be considered as a major advantage as well. Oracle cloud services is one of the major players in the cloud space providing infrastructure as a service (IAAS).  It offers numerous products like the other cloud platforms.  It helps gain visibility into performance and uptime of their networks. Somewhat satisfied but can be improved.  The commercial is good at product introduction but the support is slow in responding. Autonomous DB is good.   It's easy to manage the scale up and down of the resources.   It can automatically manage the index of tables. The Production env upgrade was quite smooth but the Development env had a couple of server issues which delayed a few days of testing. ATP is a great cloud service integrating the most powerful database and low code application development tool APEX.  It's an ideal solution for developing cloud application for enterprise. OC can stand on our side to think the overall architecture.  They are professional and able to address our requirements / difficulties when thinking of the architecture design. OCI Gen 2 allows to my company to offer a Cloud high quality service to my customers.  Since several years we are offering our solutions in Oracle Cloud and this situation has allowed us to modernize our applications and services and continue. It is easy and intuitive to create new CPU on the Cloud.  The auto-scaling function also helps us to better utilize the Cloud service to our budget without compromising on performance. Deployment was smooth and average okay but further improvement is needed to make it better.  There are services such as snapshots quickly being done for testing.  Also the issues of platform challenges like SPARC vs Intel should be handled better since. The project was started in 2018 when OCI Gen 2 was in its infancy, quite a few feature gaps and lack of access to features available in Gen 1 (Classic) which were not suitable for Private IP based services.  The acceleration of features on Gen 2 has been. Hosting Fusion ERP on OCI has been cost effective as it is consumption based pricing model.  Easy and cost effective model.  Integrations are not easy to manage and not able to monitor load balancing. We had had a bad experience in the past regarding the implementation of the infrastructure in the cloud, so we started this project with reservations.  This new experience using Oracle Cloud infraestructure has been a success due to the. I received great assistance during the Oracle migration to the cloud from Oracle team members that helped make the transition transparent with minimal issues. The deployment of our software on Oracle Cloud Instances was good as expected.  When we had questions about the architecture, the support from the Oracle technical team has been quick and efficient. As a product, Oracle cloud has been evolving a lot, and, even if in its early iterations (classic cloud) there were a few glitches, it has really improved over time, and now is a very stable platform, easy to work with.  But the experience of working with Oracle,. On Oracle Blockchain we quickly and easily implemented our smart-contracts and get the fastest time to market. In general all the human service has been wonderful.  They help us fully and warmly  The infrastructure has been available until now 100%, without downtime or reduced capabilities. After one and half year of usage of OCI, my overall experience is very good.  They are adding more and more functionalities. Very powerful Infrastructure with easy setup services  It cover all what any company needs to move it's entire IT infrastructure from on-premise to the Cloud OCI. High performance environment with some technical support difficulties.  The company is satisfied with the use and performance. A very good experience with technical and functional support for the implementation of our needs.  A varied, flexible and efficient Cloud infrastructure that adapts perfectly to our projects. OCI has great IAAS services and a intuitive UI, api management also is very useful for out operations  and infrastructure team. In general we have a very satisfying experience so far with Oracle Autonomous Cloud solutions.  Very easy to use, self managed and with no limit scalability. As a newer commercial offering, there are some improvements that could be made, and are being made, around notification, ticketing, and RCA.  That said, adoption has been technically and logistically straightforward, and the platform is over-delivering. The assigned technicians perfectly understand the needs and requirements and make sure that they are met, offering various possibilities and options, with a complete vision and not only oriented to the OCI product. Excellent support and implementation service with dedicated resources and success manager to ensure effective and timely implementation.  Many technical challenges resolved very quickly. We were an old Gen1 Oracle PaaS/IaaS customer and recently migrated all our workloads to Gen2 OCI.  So far we have been extremely happy with that migration.  Oracle brought to bear key resources in sales, solution engineering, cloud. Oracle Cloud Infrastructure looks interesting and there is clear intention from Oracle to make it a success.  Post go live support is excellent. There was no downtime from the vendor in last two years and no hardware or network issue as well.   Also additional application management functionalities are available to test. We chose OCI because our value driver is not managing databases or infrastructure issues but rather using Oracle's infrastructure to create a robust product for our clients that utilizes data and databases to create more supply chain transparency and. Our organization's experience in migrating the Tax landscape to OCI was excellent and had full support from the vendor and technical partners.  There was no impact on the business or users experience.   The migration was transparent and fast. The maturity in Exadata Cloud Service is not the best on OCI, there are a lot of bugs and funcionalities that not works. I had used Oracle Cloud services continuously for 1. 5 years or so and I woud say that I have been satisfied by the experience and outcome that this software provides. The scalability, reliability, and security made this platform an overall good decision for our organization.  The web interface is pretty user-friendly. OCI and usage of the Autonomous Data Warehouse give the possibility to very easy-to-use access and set up.  Automated services mean less time on coding and more time focused on building out our data models and dashboards for our business users. They have a rich experience.  but it needs huge training in the area.  they should initiate to give training to their customers. A best platform which utilises latest standards & offers comprehensive & outstanding portfolio Makes the ERP business very easy ,financial accounting also gets easy with this. Technically more advanced, but will need more time to mature.  We are working directly with Oracle development team and is getting first-hand support.  Oracle is still late in the game in offering local (HK) data center to support our business growth. We have been working with the Oracle cloud HPC from the Bare metal GPUs all the way to the most recent A100 testing prior to release! It is an incredibly powerful infrastructure platform with great security and geared towards solving big data,. This piece of work was for a region specific deployment for our North America customer base.  Overall experience has been positive and the delivery would be regarded as a mid-complexity - especially factoring in data deliveries. Oracle Cloud Infrastructure (Gen 2) is great cloud platform, that's provide more scalability and flexibility with less cost as compare AWS.  It's provide visual editor for end user to create custom reports and charts for easy to analyze. The overall experience is good,  in terms of SLA we dont face downtimes  the better is the support when facing challenges. Supercomputing cloud IaaS provides a way to process all the tasks in parallel using cloud infrastructure.   Quite Faster than existing ASW.  Used for our big database project where we need to process millions of transactions securely.   Used in our online HD. With Oracle Cloud it is a tool that offers advanced processing and network performance, in addition to including a comprehensive portfolio of cloud services and infrastructure and platform.  this tool allows us to meet the needs of essential. Access to the Cloud Portal to view usage was initially very hard to get.  After finally getting it, the experience is nowhere comparable to AWS or Azure Cloud.  Performance has been a problem, however the tools to diagnose where it is occurring is. Difficult to integrate with on premise systems, certain services available at high cost.   Certain services are not mature. OIC environment simplify installation process and same time services are provision very fast with less technical effort. Great support in our journey to cloud.  Not many services but good quality in the available services and perfect for fulfilling our needs. Productive and professional experience.    Realized quantifiable value over previous hosting solution.   The biggest challenge was maneuvering the Oracle ecosystem between OCI, OCS, and ACS organizations. Competitors have technical support in Brazil and Oracle does not have support engineers in Brazil, but in any case at the beginning of the project we had all the support from Oracle in Brazil. We have had a bumpy migration to OCI, they are getting better, but somethings are still hard to do, as compared to AWS.   We are constantly having to escalate to get support issues resolved.   The things that they do well, the do really well, but we. Oracle cloud infrastructure is cost effective and we find it a great platform to start your cloud journey.  It provides fully management container service and high level APIs that enabled us to control our operating system, storage and deployed applications. works really well within the business.  Very scalable and cost-effective.  Integrations options were feasible and support was good. We have great cooperation with Oracle and our local vendor, they provided awesome consulting and support during our cloud environment implementation in OCI.  Support and consulting service was very professional, targeted and fast. The OCI Gen 2 worked well especially with ADW, OAC and Data Safe configurations.  When we started using the OCI Gen2, there were some confusion on using the correct URL to login.  Then we received clarification from Oracle support team to use. We have had a very good experience with web application diagnostics and log search errors.  The use allows you to record automatic response times while the applications are validated and then days later online you can use them to generate validation. Overall experience is good but there is some area need to improve like UI and load balancing feature need to improve. I have used this software when I did my internship.  Basically, I developed the program to store the data in the cloud for easy access.  There I need to calculate the storage space used, remaining, and updates for the particular user. Advantages: allows very fast processes, has better performance, affordable prices, easy use, easy to migrate.  Disadvantages: You must have a detailed plan to simplify the migration. It is the best platform for using the oracle database.  The scaling and deployment are good and fast.  It is easy to set up if you are using oracle database and also deployment is easy.  Overall it was a good experience of using oracle cloud infrastructure.  But. OCI is still evolving and bringing out some of the coolest features towards OCI Security and Architectural flexilibity i. e.  OS Management Services, Flexible Compute shapes and Modifiable VCNs etc. Oracle is always able to keep a good standard for any service , and OCI is one of them as well.  Platform is managed very well from operational point of view.  On the other side user interface is nice for this one as well and easy to manage devices on cloud. Very good an capable when talking about servers, information storage, web, all kind of applications and services. We in our organization, use Oracle Cloud Infrastructure to host our IaaS and PaaS resources.  And now we don't have any scalability or performance issues.  Is cost effective and is highly recommendable. I used Oracle for implementing Finance and Risk management programme at a bank.  I found the capabilities of product very reasonable but their integration with other BI/Analytics tools was poor and we have to spend significant amount of time to. Oracle cloud infrastructure is best computing services like network, storage , services and many other options in that, actually it is a best cloud infrastructure compare to others price wise performance wise like that,  and we can do data transfer as well in. We decided to use Oracle Cloud Infrastructure for migrating our on-premise application to cloud.  The team helped and guided us on every steps of the process.  We also opted for the autonomous database and self-repairing services option which. Oracle is relatively easy to use compared to its competitors.  Due to the fact that it's on the cloud, it is easily available.  Most importantly, Oracle is very cost-effective.  One downside is that I have experienced some network issues. Its a good platform to work.  In my previous company I had used it for invoice related purpose.  Only thing I felt was the speed of operation was slow. Lacking in capabilities when compared to Azure and Amazon.  Great for Oracle databases and simple VM based workloads, I have not tested functions or containers. Overall amazong experienceWonderfull support and very excellant team.  They had a real amazing developement team and their product is stable. The tool is scalable, predictable performance and consistent for our environment.  It is cost efficient and highly reliable infrastructure. Oracle Cloud Infrastructure has had the best high-performance computing power our company has experienced.  It has tremendously helped our company's IT workloads.  We love this product. Oracle kubernetes Engine and Kafka event Service are excellent.  Oracle startup team provided excellent service and support. technology expertise and leader in the segment , single stop solution , reliable and proven technology.  cost effective and ease of deployment. Best and powerful tool for the cloud infrastructure and more secure as well.  The over all cost is good for the large scale projects. Really helpful, also reduces the need for physical servers.  It is also a cost effective solution with great scalability. Oracle offers a very tailored solution for your business.  However it is complex to use and a a lot of diagnosis tools are hard to find or to implement.  Eventhough it can be tailored to all your needs, I find there are some provider that offer more intuitive. excellent experience in a highky complex architecture encompassing 17 enterprise architectures into an hybrid of on premise and public cloud synergetically interacting. Well formulated cloud infrastructure.  Apt number of services and much lower priced than the competitors like AWS and Azure. A new experience, totally different from the previous Oracle Cloud.  Much more stable and reliable.  We migrated part of our environment that was in Oracle Cloud Classic, is now much more stable.  We ran some Oracle databases and the ease of. Oracle Cloud Infrastructure was easy to setup initially and deploy Oracle database workload on top.  We used fast interconnect option that tremendously reduced the latency between various instance of our application running Oracle Database onto. Oracle cloud is robust and had a wide varieties but support model need more improvements.  It is simple to implement but not yet very stable and still way to go. It is extremely easy to get started.   You create an account and soon after you can start launching your database systems and application servers.   It is quick to fire up a server and when you are done using the server you can terminate it.   We have also started. The Oracle Cloud Infrastructure Gen 2 seems  is easy to understand and to implement new resources within the cloud.    I was impressed on how quickly we were able to implement new Virtual Machines.   We currently now provision our resources through. We are moving our workload to the OCI and the experience is being awesome.  I do really enjoy work with Oracle. Really appreciate the support provided to us and the responses, the team is very helpful and listens to our specific needs. Happy to see the direction Oracle is headed with their Cloud Infrastructure.   They're managed to design and offer a true enterprise class solution for Infrastructure as as Service. The level of support we received from the OCI team during our initial pilot test and on through our full production roll-out was out of this world.  I could never have expected such unparalleled customer service.  In a world where cloud infrastructure is a. Back in 2016 we started evaluating the Oracle Public Cloud (now called OCI Classic) with a Proof-of-Concept (PoC).  This PoC consisted mainly of Exadata Cloud Service (ExaCS), compute, storage and network connectivity.  The positive result of our. The system performance has been great and are extremely fast.    Machines have also been very reliable.    Oracle expects you to do things a little differently in OCI vs on premises which did create a few surprises. Given that our 14 module PeopleSoft ERP platform effectively runs the company, our move to Oracle Cloud Infrastructure was a major initiative.   Our overall experience from inception through design, planning, implementation and migration was excellent. I am using the OCI from the past 2 years and there are so many unstable resources are there in the OCI like OKE.  There are some services not available like API Management.  Apart from that so many  cloud services are good. Pros: 1.  Oracle Cloud Architecture best fits to our custom Java Application with Oracle Database architecture 2.  Oracle License compliance 3.  Scalability & Reliability  4.  Easy to setup the infrastructure   One of the best feature is the vertical scale up of. Supports a large range of OS versions hosted in a converged server,network ,and storage environment to enable general purpose applications. Great implementation strategy.   Team brings creative ideas to enhance service offerings.   They recognize the importance of building a partnership over transactional sales. Oracle has been an excellent partner in moving our ERP off premise and into their cloud.   Our ERP is Banner from Ellucian. Fast and easy setup for our project team,  Good support from Oracle and partener : high experience staff and good reactivity. Oracle using their own hardware (based on solid Sun background) makes their offerings extremely potent.   This includes compute, storage (ZFS), as well as access to Oracle Exadata.   The ability to have full access to bare-metal resource gives the. The sales and technology teams have been outstanding.  We've had multiple on-site meetings with prospects and customers, which included Oracle staff, and that has made a significant difference in our speed to market and prospect comfort levels. Tech support was very responsive.  Developer Outreach people were excellent.  Documentation is decent but a little sparse with details.  especially step by step guides.  Simple easy to use web portal is good. The infrastructure provisioning was fast & easy and  the migration / transition from on-premise was handled well.  Performance of the systems & application is as expected.   Elastic environments enabled us to be more agile and flexible.  And our cost model. We were first Oracle EBS customer on this platform.   Oracle team went above and beyond to get us on their platform. Due to uniqueness of the relationship there have been lessons learned on both sides as to how to make the best of the partnership. Very pleased with Oracle Bare Metal Cloud - super price & performance and a very responsive team. Oracle Cloud Infrastructure is a unique solution for hosting our product or services or any type of application solution.  mostly our services are running on oracle database, for our application database, we can create a database machine in couple of. Strong services Expertise, Strong Customer Focus, Overall Good. It was a good experience work with Oracle, specially when we need some kind of support to solve an issue. Try to deepen my knowledge of the products to have greater performance in the company with agility and practicality. Oracle cloud infrastructure is a  benefits seen are highly available, scalable and robust infrastructure, its providing a very good services at cloud services level.  best platform to host the services/application. Our database and application data will be secure with best compliance.  Its serves a good architecture and very much flexibility for public cloud to integrate with our services. good and make some practical examples more to understand the concepts. A full portfolio of first quality services enabled my customers' project to save time and money. Great platform to learn.  Its help me to enhanced my technical skill. The learning helped me to understand the services offered by Oracle Cloud Infrastructure. As a third party supplier, we need to deal with Oracle support on behalf of customer, sometimes Oracle support response is not the better. Oracle cloud infrastructure provides you to host your Software/services/product on there cloud.  and end user no need to worry about the security and maintenance activity for there hardware. Oracle Cloud infrastructure provide us very nice cloud architecture flexibility to host our application, database, storage.  and its very easy to manage the services and no need to worried about maintenance activity. GOOD, understandable, This product is very useful and informative. It is good and informative.  exceptional traninigs help users to learn and implement cloud technology .  This course will help me learn and support to my client in overseas. "}