{"name":"Tencent Cloud - International","oneline":"Tencent cloud provided good products and services which helped us a lot to improve efficiency of digital marketing. We've cooperated with Tencent for over 3 years. I think Tencent cloud team provided great services and easy to use/install/integrate platforms for us. Tencent cloud provided secure and integral products and cloud service, which helped us to save deployment time from 1 year to half a year. Tencent cloud is an excellent partner provide great products and services. One of the leaders in gaming and have more than 20+ years experience in technical expertise in gaming, cloud computing services, music, payments and many more. Tencent cloud - International provides best way to build gaming infrastructure in and out China. With 20+ years of experience in technology and being world biggest gaming company, Tencent's experience and technical expertise in gaming inside. We are using this software at workplace for the cloud based dependencies. It is nice to have this as it is secure, fast, reliable. It works same as the classic servers that were available. I don't encountered any Issue yet as accessing VM's on it But it's little. Tencent cloud is the platform that has allowed us to take a step forward in our organization, since although it is a paid service where the technological advantages of having services in the cloud managed by a company such as Tencent cloud are. The implementation of Tencent Cloud International in its calculation instances was very simple since it was done with a few clicks and few steps were required to change the configurations from the console, thanks to the variety of services we have been. Having Tencent cloud as a business partner as a provider of cloud services has been a wise decision in the company, since it is a reliable and high performance service, as users of cloud services Tencent cloud I am satisfied with the service, since it allows. With Tencent cloud we have at our disposal the services at competitive prices, it was easy to implement in the company, since it requires few steps to change the configurations from the console, thanks to the variety of services we have been. easy usage, competitive price level in China market, reliable and safe service.  after-sale service and support is better than its major competitor Ali. Very trusted provider in cyber security solutions and aggressive pricing compared with its competitors in China. strong capabilities in scaling and negotiable contract. bring value and benefit to my company through Tencent's partners and existing. 1. The lack of tools. 2. The permission system is not powerful. 3. There are not many programming languages supported by the API. 4. The API interface is unstable. The Tencent cloud is very responsible. It is reliable provider and safe service depend on its many years experience in cyber-security due to capabilities in To C business like game, social network. the online customer service experience is positive, but some product are not that solid to sell to customer as a serious production. All the service are very stable and useful."}