{"name":"V2 Cloud","oneline":"Our IT department uses V2 Cloud for cloud infrastructure maintenance and requirements. It is a very useful remote desktop for the entire work team to easily access the database without problems from anywhere to solve any problem that may arise. It is a stable and reliable platform with which you can manage multiple accounts remotely very easily. V2 Cloud is being used across the whole organization as our exclusive virtual desktop infrastructure solution. With the work from home mode of operations now relevant post the Covid 19 pandemic, it was critical we found a solution for our colleagues. V2 Cloud after rigorous research and search came up tops as the solution that would best fit our business and future corporate development. Due to the current health climate, we have transitioned our accounting firm to the cloud and decided to do so with V2 Cloud. V2 Cloud is reliable and it has worked well with a current staff of 6. It is user friendly and allows for data and screen sharing capabilities. Customer service is very quick to respond to any inquiries and they are open to helping with any issues or questions. It is also very well priced and we are happy with our decision to move forward with V2 cloud. It is being used across the organization. It allows the providers and medical assistants to move between exam rooms without having to carry laptops around and [has] the ability to stay logged in to the electronic health record and other apps. It improves workflow, productivity, and saves us money compared to other products. V2 Cloud is currently being used by the whole organization and is set up as virtual machines that can be accessed anywhere and share documents and software with all users. We have contractors in another country that is able to access the company's tools through V2 Cloud. It addresses the problems of hosting software that is not on the cloud but all users require access to it as well as solving how to share files across the organization. I purchased V2 Cloud for myself to use when I was away from my desk at work and for general computing for one of my side businesses. It is an excellent solution for people who are looking for a cloud computer without the restrictions of installing programs and needing in-depth knowledge in IT to set up. I use it daily and have not ever had any connection issues nor any issues when using the system. Their support is excellent with a response within minutes at any time of the day. I would very highly recommend V2 Cloud."}