{"name":"vCloud Air powered by OVH","oneline":"We have been using OVH since the early stage of our startup, one point that we like is the solution of disaster recovery. We were migrated to an OVH instance as part of the VMWare Air move to their Datacentre.  I was skeptical at first but the migration was faultless and performed with nothing but professionalism.  The solution works well and the staff are. File share service that performed very quick access to your documents. The perfect build internal network connection allowed a spectacular high-speed file transfer. Its efficient backup protocol permit keep well storage all you value information. The deployment is very fast and the Products are very scalable, the vCloud Products are one of the best i found on the marked. During a year in which we endured capital restraints we needed to elevate our DR capabilities for critical tier 1 apps in a particular geographic region in which we had no strong CoLo options.  We chose IaaS, partnering with VMware on vCloud Air. Work with them was very easy going and they were well versed in knowing what we need. Vcloud Air is an excellent solution for IaaS. vCloud Air is expensive, inflexible, and ultimately,  was sold off as a business by VMware.  If we had it to do over, we'd run screaming away from vCloud Air and just put it on AWS like we should have in the first place, and will wind up doing in the end. VCA engaged us and we were happy with not only the customer support; but also the willingness to grow in the direction we as a company were looking to grow.  Their future vision is strong and supports our roadmap. Overall, it's good. However, some bumpy road ahead. The virtual support team do not adhere to upgrade best practices. Great product.  A lot of time and effort went into building vCloud Air.  VMware's was smart in building/offering a best-of-breed cloud subscription service that could compete in the enterprise cloud arena.  For those who know and use VMware. Overall, VMware vCloud Air is an amazing alternative to the costly pricing models of other providers who's model is based on cpu cycles and I/O's. Where vCloud differs is its one price sandbox environment free from risk of over computing the cloud. There have been a couple severe outages, around 1 per year but that's normal when dealing with servers. there were some bumps in the road, but the infrastructure capabilities were delivered and new ones continue to be add. Time constraint with ATT end of life. The initial contact with VMware was productive and useful to understand their product offering. It was a surprise to find our on-premise solution using SRM, EMC Recover-Point was more mature than vCloud Air DRaaS. Product had a bit of a learning curve at first. Overall the product was good. VMware is a great partner, the VCloud services are still being evaluated. There were a few connectivity nuances, but all in all a successful implementation and easy to work with. The vendor is very knowledgeable of their product. Implementing was easy but integrating with back-end services was a difficult task."}