{"name":"Virtustream Enterprise Cloud","oneline":"Virtustream Enterprise Cloud is the best in class enterprise cloud which is built to run complex, mission-critical enterprise applications with a full suite of professional and managed services. It offers high availability and performance with SLAs, integrated security, and compliance solutions giving better returns on all the IT investments made. Virtustream has been a great company to partner with. Their commitment to after the sale customer service is refreshing and everyone on my team like dealing with those dedicated to our account. help me understand about architecture and component for cloud. It is full of component of a cloud system. But the value is not much because product used for test lab. Platform has been very reliable and performs very well  Technical capabilities are very solid (VMware HA, FT, SRM). VIrtustream helped us to scope our move to the cloud. They asked great questions and were not afraid to challenge our assumptions while bringing creative solutions to meet our needs.  They included technicians with suitable experience in all areas to speak to the entire solution and took the time to understand our business drivers and business culture. Virtustream has good experience managing SAP environment in the Cloud but it is a Company that has been growing to fast and many operational problems that affect the daily management. They lack the level of response and customer service at the Enterprise level. They have a lot of staff rotation, their invicing process lack of arigorous discipline; they don't communicate on time and consistently and many time they provide miss messages . they have good tech people when problems arise. Although customer oriented, and relatively flexible around pricing, during implementation, the lack of experience working with large, complex and international scenarios was disappointing. Strong commitment to achieve. Lack of versatile and structured PM processes. Defective and in cases, null communication between field engineers and leadership executives. Poor PM performance.  On steady state, major improvements in all areas, showing a great capacity for understanding, adapting and fulfilling customer's needs.  Great capacity to quickly learn from experience.  Still a long way to ride on administrative processes, e.g. Invoicing, reporting and legal interaction. We migrated to the Virtustream cloud starting in March 2016 and going through November 2016.  During that time Virtustream was essentially acquired twice, first by EMC and by Dell.  The result was some organizational and technical changes that impacted the efficiency of the project team and migration.  That said, the new leadership team from Virtustream has been outstanding at hearing our concerns, reacting and putting actions in motion that address our concerns.  Virtustream is executing on several enterprise cloud improvement initiatives that have already shown benefits.  VirtuStream jumped in and partnered with our organization during all phases of the implementation. Their technical resources were very knowledgeable, and their project managers were experienced in their core product.  They were very responsive through the entire process.  Unfortunately, the customizations that we required for provisioning delayed our startup significantly."}