{"name":"VMware Cloud on AWS","oneline":"VMWare cloud is very efficiently built to store, connect and secure all the on-premise apps onto the cloud platform.  Its distributed model helps to connect to AWS or any other public cloud for the management and delivery of public cloud systems. VMware Cloud on AWS enabled us to deploy a DC in a region of our choosing (out of a limited set of regions) and to move our on-premises deployment to the cloud.  The overall experience was good, except for the fact that it takes a few hours to be. When you subscribe VMC you get the infrastructure backed by 3 pillars of VMware - vSAN (storage), NSX (virtualization of network), and vSphere (virtualization of compute).  All this infra is backed by AWS' availability zone.  The complete. Excellent product I liked it a lot because it has the facility to add or remove hosts or clusters from the SDDC quickly, it allows to have instances available to implement laboratories for different development areas, quality. VMmare Cloud on AWS services, enabling customers to run any application cross vSphere-based private, public and hybrid cloud environments. VMware on AWS is undoubtebly the leading service provider becuase of its usability and flexibility.  Servers are secured by an advanced security policy thus users need not to worry about it. Vmware cloud on AWS has helped us to quickly deploy our similar technology infrastructure in different regions. Growth in the cloud has increased exponentially, in our company we are using the three best know clouds but for benefics this is our fist option. Great customer support team always there to back us up.  Very knowledgeable, proactive, quick in resolution and responsive.  The product is a great one VMware which has been helping us in managing all our various database based servers.  Our. VMware Cloud on AWS is seamless.   Very easy to deploy apps and OS and add resources to them as needs change. VMware is a known remote desktop service provider and I have used their product on AWS.  The connection time is fair considering a 30mbps connection and there have been only few noticeable down time. The overall experience after using VMS AWS has been good for our company as we have so many things that need to be running on server and clients has a different requirement which wants their software to run of the specific environment which. VMWare Cloud on AWS helped us swiftly migrate all our critical applications on to AWS Cloud, without having to rework on developing applications to work with AWS platform.  Considering the volume of Clients using different kinds of Virtual. I'm overall very much satisfied with the cloud services.  The range of features offered and the breadth at with we can scale solutions and get the code live quickly is great. We were having issues without cloud architecture - and a lot of those. VMware Cloud on AWS is one of the finest services that I have come across in recent times.  We are using the service for almost a year and very much satisfied with the overall service that we have been provided with.  VMware cloud is very much flexible. It was a good experience with VMware Cloud on AWS, it is consistent and reliable in its working.  The combination of VMware and Aws has proved it to be reliable, smooth and efficient cloud data services.  Be it for the developers ,testers or other technical team. The Overall experience has been very smooth and consistent with the VMware Cloud on Aws.  The partnership of VMware and Aws has paved the way for reliable and efficient hybrid cloud data services.  Be it development or testing or migration it has. The User Interface of the Cloud Submission permits a trivial exchange of data and pro rata analysis in AWS System, would recommend the user to inhibit the experience. We can manage our on premise and cloud based infrastructure from single point.  We are satisfied to use this facility of VMware Cloud on AWS. It's been a valuable tool as our on-premise virtual infrastructure is VMware.   There are a number of applications we did not want to build new in the AWS cloud so VMware Cloud on AWS was a good fit to help facilitate the migration relatively. The overall experience is good using VMware Cloud on AWS.  VMware Cloud on AWS permits organizations to run their application remaining tasks at hand across VMware-based private, public, and hybrid cloud conditions, with advanced admittance to the. VMware Cloud provided high availability and distributed resource scheduler ensure our systems are always online and performing well.  The VMware cloud solution is  stable, secure and easy to update.  We can managed our cloud infrastructure. While working with VMware and Aws overall experience is very effective and consistence.  The partnership of VMware and Aws has got the way for efficient hybrid cloud data services. I am really impressed by the consistency of the product. This tool was very good for the applications we wanted to connect to other apps without having to transform or redevelop a lot of our functionality. It enables us to run production applications across VMware vSphere-based hybrid cloud environments, with optimized access to AWS services. VMWare deployment was used as the baremetal device on top of which many containerised architecture were run.  Multiple instances were required for the project and isolation and interoperability was crucial between the containers.  VmWare. Overall, VMware software is extremely robust, and has been a great addition to my infrastructure.  Having it on AWS just makes it easier to deploy and scale for demand.  Coming from on-prem VMware VMs to VMware VMs in the cloud, made migration a. VMWare's overall solution has been a big plus in our environment.  Server creation, patching, management and uptime have all improved with this solution. In general speaking, we have been using AWS for a while in order to get High availability but now we have integrated VMware Cloud, which has provided us a good performance in our app services. I had a great experience in using this product a good interface for managing data stored on multiple VM machines.  and also a fast response from the support team when there is a load issue or other issues. as a market leader for private cloud, VMware's product is quite mature, and have very good documentation from design, deployment to operation, all phases, also have a good training platform and certification paths. We have been using VMware for a couple years now and have been very happy with them.   The product has been robust and given us the exactly what we need. Need to work on enterprise integration options as compared to the other competitor.  Dell and VMware solution are perfect solution.  We are trying to push the solution in BFSI segment. VMWare cloud increases work load flexibility and eliminates the burden of infrastructure management.  It helps to extend data centers, but their are usage and migration challenges. VMware is one of the preferred public cloud partner and Vsphere based workloads.  Rapidly extend and migrate protect our VMware environment to the AWS public cloud.  Deliver the seamless and hybrid cloud by extending your on premises. very stable medium easy to configure, easy to expand, diversity in virtualization configurations, easy to implement. Hosting our virtual machines on VMWare cloud on AWS seemed like a complex effort but it was made easy with the VMWare team.  We were able to sort of issues with DR handling with a joint effort.  Many efforts such as security features, workload. Very unique offering from VMWARE.  Organisation specially bigger one can adopt and migrate their on-prem workloads to cloud in no time and reduce their cost, efforts, complexities in the cloud migration journey. Similar platform as a private Vmware cloud with more flexibility elasticity and agility .  It has high performance and cloud DR which is business need . great optimisation techniques which allows you to experiment with the other tools.  Customers can preserve the data and can retrive the data when needed great support. The key capabilities of VMware Cloud are : - Good User Interface to review and Monitor - Robust Tool - Simple and faster - Good back up facilities on server failures - Easy to operate even if it is for the first time. VMware has been a rock solid product that we leverage every single day.  In the three years that we have used VMWare we have never run into any substantial issues that support could not resolve day of. Easy to deploy and intergrade with existing on-prem environment .  Provide seamless integration and its user friendly. I am using this product from last 3 years and i am very comfort to use this product.  it secure all data with all the rest ApI and uses vSAN software encryption so performance is very good.  also provide automatic scalling. overall experience , its mature product and long run i would expect it would work for multi cloud hybris so that it can leverage other cloud too. The support and the quality of it is great.  Never had a bad experience.  The interface is minimalistic and I do enjoy that.  Wish there was more Linux support. The Design, Architecture and the Implementation of a System with the use of VMware products is amazing!. It had deployed so easy letting us use it on day 1.   it allows us to manager our infrastructure between multiple cloud applications. I like vmware support and services.  Their cloud products provide information when there is maintanance, upgrades and outages. We have had this product in place for about 7 years at our organization and have been impressed with their development and expansion since implementation and meeting our needs. vmware is awesome and very usefull for any company to store their things with the greatest level of security with this product.  you can store anything you want on the cloud provided by vmware.  it's very important for any company to have such a great. We had been previously using Microsoft Hyper-V.  We've now added VMware and find it to be much more user friendly and has better features than Hyper-V. This product is very simple and faster.  It provides an outstanding user interface tool to review and monitor the application.  We didn't face any problem even while dealing with a large amount of data.  They also provide good backup in case of server. This tool provides an amazing UI from which we can monitor and review all the applications easily.  We integrated this tool easily and connected all the applications managers with VMware servers. overall the product is very good.  Ticks all the boxes, having said that they are commercially very rigid and not open to negotations. Basically this is used for distributing the workload across the cloud based server and structure.  This allows businesses to run their application workloads across VMware-based hybrid , private and public cloud environments, with AWS services. VMWare does provide cutting edge technology, however needs to improve the user experience significantly.  The customer service is also good. VMWARE products are reliable and the best on the market, very easy to learn and to maintain and great customer support. I think VMware is the best virtualization platform in the World.  I like specially Vcenter feature.  Because I use min.  two server and I organize with VMware both server. Go exp.  in Cloud implementation and VCF.  Management is easy with real time virtualization.  Better resource utilization. VMware Product is excellent.  Very easy to deploy, configuration, and management.  Various options are given in the software, so we can easily use this product. Leverage predictable, high-performance compute and application uptime through capabilities built directly in the service, such as vSphere HA, DRS, auto host remediation and stretched clusters for zero-RPO infrastructure availability. Migration efforts have been made extremely easy and efficient.   The rapid adoption of the integrated capabilities by administrators has seen productivity improvements. If you have vSphere or NSX, now you can move it to cloud using AWS.  This is the VMware Cloud on AWS proposal and once VMware don't have a cloud solution, we get the great AWS support and use it on our vSphere environments with the on-premise. VMware provides us with a very detailed and comprehensive performance metrics always.   We were able to integrate easily and connect applications manager with VMware servers.  Likewise,  it also very easy to operate with little or no prior. Host your Servers allows u to reduce the physical hardware associated with it. Save both cost as well as bottlenecks associated with maintenance. It's great extension with On-premises supported and more secured communication setup with MFA implementation. One of the best hybrid cloud service provided by joint efforts taken by VMware nd AWS gives users highly scalable and secure services which helps in migrating on premises VMware based environments to AWS cloud. Offers the ability to migrate the on-premise applications easily to AWS cloud without any new requirement to procure hardware and with zero impact to business.  Better HA solutioning with integration of VMWare with AWS.  Retaining the same data, the. Its very flexible to use this application.  Its easy way to access and friendly.  Very good technical background. Vware cloud has its comparative advantages in terms of its management in the cloud is very efficient and works properly with Amazon Web Services, since its features are very complete so implementing it with other services offers not only the desired. This was a great move for VMWare.  We used their vCloud offering through a local MSP, this is nothing like it and makes us feel at home when it comes to AWS and VMWare.  Yes it costs us a little bit more for that functionality and feel, however, being in. New hybrid cloud service called VMware cloud on AWS(VMC) , it eliminates burden of infrastructure managment and controls shadow IT also eliminates organization to leverage existing skill ,tool and process. It also pramotes the utilization of native AWS. VMware Cloud on AWS is a great extension of the on-premise data center.  VMC on AWS provides a hybrid cloud model where workloads can be quickly and easily moved between on-prem and the cloud.  Hybrid cloud lets you run your on-prem. My experience with respect to this product is good  I have been using it for a year now but has it's own limitations too that when you are onto VDI it's slower than your local windows, and sometimes the work also get stuck whenever there is a memory issue. This system is very good, we had already taken into account and seeing features until we encourage you to acquire and try, actually we are very grateful with this thing since it works as expected and we found several extra functions where they help us even. Overall experience is quite satisfactory as it provides to access the VDI from anywhere and prevent any kind of data loss as it is machine independent. VMware workloads running on the AWS Cloud have native access to a broad and rich set of AWS services including compute, database, analytics, IoT, AI/ML, security, mobile, resource deployment, application services, and more. We have always been an on premises based company, with VMware and the cloud we are able to easily and securely spin up servers in no time at all which is HUGE for our student and employee base. I had a legacy app that I needed to move to a Cloud Platform.  Refactoring my old code (a Java app that worked as a server with sockets) and change it into another more web friendly language (javascript or python) was going to prove a heavy challenge.  In. This rental of equipment and tools in the cloud was carried out as smoothly as possible without any hiccups due to the vast experience of both parties. A fantastic service that rapidly makes my business growth.   Very flexible cloud environment easy to be implemented in any kind of situation/company. Great way to get VM images hosted in the Cloud.  Still slow vs just having an actual OS running though. Managing the VMware Cloud is very easy with AWS.  We do utilize most of the VMware vSphere, NSX and vSAN on AWS EC2.  Our migration of Data Center is very much simplified with this tool.  Its very elastic and auto scaling.  Talking about the. We are extremely satisfied with VMware cloud on AWS and we had a fast setup and transition.  The contracting was easy process through VMware with no direct AWS involvement.  It is certainly of value because of the cost efficiencies and rapid. They are very responsive when comes to any request from them.  They have very good expert to work with. We had started the process to move our Physical Datacentre to Cloud.  We planned to move our all application to cloud without any issue.  VMware Cloud on AWS helps us to move our Physical Datacentre to VMware Cloud. It is important to understand that VMware Cloud on AWS (VMC) doesn't look much like the regular AWS.  It provides a total VMware stack (ESXi, vSAN, NSX, and vCenter) provisioned and managed by VMware that runs on top of dedicated hosts provided. It works almost as it is your own DC.  However, VMware support is the same and not well trained.  I would recommend moving slowly in the beginning. we recently implemented vmware HCI with the help of hp vendor and the support given through remote session. .  during deployment explanation given by hp team is awesome. Fantastic method of deploying multiple test instances with little to no effort.   Backing up is exactly as simple. VMWare for Cloud has good support and works well for certain applications in our environment.  It makes application deployment more seamless and takes the burden of updates and access off our support department. Great for disaster recovery and business continuity.  Easy way to enter the cloud if you are getting pressure from CIO.  uses familiar tools so easy to manage. This is a future of virtualization but it is not cost effective as traditional onpremise services.  I think that for 5-10 years cloud services will be more popular and cheaper. Easy to use, this is a greate product that can help us in sharing infra-structure to our team.  Easy and usefull. "}