{"name":"ZStack Enterprise","oneline":"With the rapid development of business, enterprises have increasing demands on computing and storage. ZStack can meet these demands. Rapid deployment, ease of use, and support for any X86 architecture have greatly improved our productivity. With the continuous development of the company's business, the company adopts the hybrid cloud platform to carry the unified data platform. By calling the API interface of ZStack, the private cloud is gathered into the cloud management platform. As the number of information systems supporting business processes continues to increase, so does the demand for IT resource. After a year-long selection and investigation,ZStack Cloud platfom was finally selected to build a stable,elastic. As a leading  futures company in the industry,we have huge amount of data  information and dense network transactions. One of the most important reasons to consider the cloud is to reduce costs and increase efficiency. ZStack cares more about the the interest of end uses and partners rather than its own profits. It pays much attention on how to improve its products and service to lead the trend and serve the uses better. After a failed private cloud project,ZStack  Cloud went through the testing process. we work closely together, and made reasonable proposals for the company's IT mixed architecture. ZStack has high stability and solves many of our problems. After comparing many manufacturers,ZStack products can well meet the needs. Rapid deployment and ease of use,and support for any X86 architecture,the legacy of strong savings for us. And the platform can be completely seamless upgrade. Before using ZStack solution, we have tested products of many brands in the market for a long time and finally choose ZStack product, because of its product stability, ease of use and rapid deployment environment, which makes us very comfortable to use. ZStack service experience is good,product and technical team is very professional,in the speed and time to deal with the problem is very guaranteed. Besides,ZStack is a company that attaches great importance to product technology. At present,the overall security compliance of the cloud platform is relatively good,and it is also a form of product output. However,it is not completely rejected for customized development. It can collect market information and make the next iteration. ZStack is powerful,lightweight deployment,core open source,rich version planning to meet the business needs of a variety of customers,provide powerful private cloud function and flexible bare metal management,enterprise. ZStack has a strong ability to recycle old products,simple deployment, flexible capacity expansion,and one-click upgrade without affecting the business,which plays a very good role in our digital transformation. The architecture is streamlined and compatible, suitable for rapid deployment and has low implementation costs, and supports seamless upgrade. The performance is stable during operation, which can well support business development. ZStack provide build complete IAAS cloud computing platform solution,for business customers a complete heterogeneous locations/management platform,cloud computing resources for the future of intelligent data center,through the provision. The experience of the whole process is very good,From the establishment of Cluster,host addition,storage ,network creation,and finally the start of cloud host,the whole process is very smooth and fully meets the needs of the company. 1. Zstack now has the basic functions of IAAS cloud, which is closer to the experience of public cloud in terms of function and experience. 2. From the use process, the stability is relatively good, and there is no collapse, jamming, etc. Zstack cloud platform product has solved the problem of server deployment in our company for a long time. After a long period of POC test, we finally decided to use this product. Our technical engineers from the manufacturer have provided very good. The cloud Platform was stable with few problems. cloud product are Powerful functions and satifly the operation of existing businesses. simple,robust,flexible,intelligent 4S features easy to install. easy to apply. can be very kindness for the masses . the UI very friendly. I was impressed by the 4S features of ZStack, especially its simplicity,easy installation and easy maintenance,which brought us a lot of convenience. I  have used zstack cloud platform for 3 years , the overall experience is very good  for 3 reasions. 1/ improve our server resource unitilization 2/ improve business stability 3/ simplify the operation and maintenance. Highly product-oriented open source cloud platform,quality assurance. is a flexible and usable cloud product,to improve our business processes. Zstack Enterprise is totally satisfied our requirement on IAAS Platform. And it's CMP feature help our customer accelerate IT service transformation. ZStack has high performance and strong stability. simple and easy to use high degree of friendliness homegrown software. we compared ZStack to vmware. it is found that ZStack has more functions and lower price. After trying to user it,the convenience of operation also impressed us. After running for 3 months. the stability is also very guaranteed."}